ffxiv_map_nav = {}
ffxiv_map_nav.data = {
	[144] = 
	{
		[130] = {
			{id = 130, cost = 3, x = -38.920, y = 0.025, z = 98.243, h = 1, a = 1011022, i = 1 
				, requires =  {
					["QuestCompleted(435)"] = true,
					["CanUseAirship()"] = true,
				}
				, conversationstrings = {
                   ["E"] = "Seek Passage to Ul'dah",
                   ["J"] = "「ウルダハ」へ行く",
                   ["G"] = "Nach Ul'dah",
                   ["F"] = "Aller à Ul'dah",
                   ["CN"] = "前往乌尔达哈",
                   ["KR"] = "'울다하'로 이동",
                },
			},
		},
		[132] = {
			{id = 132, cost = 3, x = -38.920, y = 0.025, z = 98.243, h = 1, a = 1011022, i = 2 
				, requires =  {
					["QuestCompleted(435)"] = true,
					["CanUseAirship()"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Purchase Passage to Gridania",
                    ["J"] = "「グリダニア」へ行く",
                    ["G"] = "Nach Gridania",
                    ["F"] = "Aller à Gridania",
                    ["CN"] = "前往格里达尼亚",
                    ["KR"] = "'그리다니아'로 이동",
                },
			},
		},
		[128] = {
			{id = 128, cost = 3, x = -38.920, y = 0.025, z = 98.243, h = 1, a = 1011022, i = 3 
				, requires =  {
					["QuestCompleted(435)"] = true,
					["CanUseAirship()"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Purchase Passage to Limsa Lominsa",
                    ["J"] = "「リムサ・ロミンサ」へ行く",
                    ["G"] = "Nach Limsa Lominsa",
                    ["F"] = "Aller à Limsa Lominsa",
                    ["CN"] = "前往利姆萨·罗敏萨",
                    ["KR"] = "'림사 로민사'로 이동",
                },
			},
		},
		[388] = {
			{id = 388, cost = 3, x = -83.325, y = 0.0442, z = 29.0272, h = -1.597130, a = 1011044},
		},
		[419] = {
			{id = 419, cost = 3, x = -38.920, y = 0.025, z = 98.243, h = 1, a = 1011022, i = 4
				, requires =  {
					["QuestCompleted(1664)"] = true,
				}
				, conversationstrings = {
					["E"] = "Purchase Passage to Ishgard",
					["J"] = "「イシュガルド」へ行く",
					["G"] = "Nach Ishgard",
					["F"] = "Aller à Ishgard",
					["CN"] = "前往伊修加德",
					["KR"] = "'이슈가르드'로 이동",
                },
			},
		},
	},
	[388] =
	{
		[144] = {
			{id = 144, cost = 3, x = 2.4002, y = 0, z = 11.271, h = -1.597130, a = 1010489},
		},
	},
	[130] = 
	{	
		[128] = {
			{id = 128, cost = 3, x = -22.364, y = 83.199, z = -4.82, h = 1, a = 1004433, i = 2 
				, requires =  {
					["CanUseAirship()"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Purchase Passage to Limsa Lominsa",
                    ["J"] = "「リムサ・ロミンサ」へ行く",
                    ["G"] = "Nach Limsa Lominsa",
                    ["F"] = "Aller à Limsa Lominsa",
                    ["CN"] = "前往利姆萨·罗敏萨",
                    ["KR"] = "'림사 로민사'로 이동",
                },
			},
		},
		[131] = {
			{id = 131, cost = 1, x = -120.054825,	z = -8.766253,		y = 10.031486, 	h = 1.575879},
			{id = 131, cost = 1, x = -119.854446,	z = 9.584025,		y = 9.999928,	h = 1.596821},
			{id = 131, cost = 1, x = 94.658661,		z = -108.452988,	y = 4.000000,	h = 0.847061},
			{id = 131, cost = 1, x = 60.834011,		z = -85.825699,		y = 8.000000,	h = 0.780104},
			{id = 131, cost = 1, x = -11.271012,	z = -40.652363,		y = 10.000000,	h = 0.174165},
		},
		[132] = {
			{id = 132, cost = 3, x = -22.364, y = 83.199, z = -4.82, h = 1, a = 1004433, i = 1 
				, requires =  {
					["CanUseAirship()"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Purchase Passage to Gridania",
                    ["J"] = "「グリダニア」へ行く",
                    ["G"] = "Nach Gridania",
                    ["F"] = "Aller à Gridania",
                    ["CN"] = "前往格里达尼亚",
                    ["KR"] = "'그리다니아'로 이동",
                },
			},
		},
		[140] = {
			{id = 140, cost = 3, x = -180.163864,	z = -14.053099,	    y = 14.000000,	h = -1.597130},
		},
		[141] = {
			{id = 141, cost = 3, x = 43.772938,		z = -163.789337,	y = 3.999976,	h = 2.879770},
		},
		[144] = {
			{id = 144, cost = 3, x = -22.364, y = 83.199, z = -4.82, h = 1, a = 1004433, i = 3 
				, requires =  {
					["QuestCompleted(435)"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Seek Passage to the Gold Saucer",
                    ["J"] = "「ゴールドソーサー」へ行く",
                    ["G"] = "Zum Gold Saucer",
                    ["F"] = "Aller au Gold Saucer",
                    ["CN"] = "前往金碟游乐场",
                    ["KR"] = "'골드 소서'로 이동",
                },
			},
		},
		[178] = {
			{id = 178, cost = 1, x = 29.635, y = 7.000, z = -80.346, h = -0.131, b = 1001976, i = 1 },
		},
	},
	[178] =
	{
		[130] = {
			{id = 130, cost = 1, x = -0.04, y = -0.00, z = 7.00, h = 0.01, g = 2001011},
		},
	},
	[131] = 
	{
		[130] = {
			{id = 130, cost = 1, x = 64.644173,		z = -82.809769,		y = 8.000000, 	h = -2.319770},
			{id = 130, cost = 1, x = 92.698357,		z = -110.785194,	y = 4.000000,	h = -2.242315},
			{id = 130, cost = 1, x = -8.388394,		z = -32.459148,		y = 10.576365,	h = -2.864407},
			{id = 130, cost = 1, x = -110.161224,	z = 9.562051,		y = 7.000000,	h = -1.586749},
			{id = 130, cost = 1, x = -110.437424,	z = -8.940209,		y = 7.011384,	h = -1.549050},
		},
		[141] = {
			{id = 141, cost = 3, x = 163.689270,	z = 43.879639,	    y = 3.999968, 	h = 1.268068},
		},
	},
	[140] = 
	{
		[129] = {
			{id = 129, cost = 3, x = -486.74, y = 23.99, z = -331.675, h = -2, b = 1004037
				, requires =  {
					["Player.level >= 12"] = true,
					["CanUseAirship()"] = true,
				},
			},
		},
		[141] = {
			{id = 141, cost = 5, x = 261.533295,	z = -9.452567,	    y = 53.309750, 	h = 2.670389},
		},
		[341] = {
			{id = 341, cost = 5, x = 317.43,	z = 236.260666,	    y = 67.180557,	h = -0.030786, r = true
				--, requires = {
					--["QuestCompleted(1213)"] = true,
				--},
			},
		},
		[130] = {
			{id = 130, cost = 3, x = 471.744293,	z = 159.596161,	    y = 96.620567,	h = 1.362059
				, requires =  {
					["Player.level >= 12"] = true,
					["CanUseAirship()"] = true,
				},
			},
		},
		[212] = {
			{id = 212, cost = 5, x = -482.076,		z = -387.232,		y = 17.075,		h = 1.394, 	g = 2001711},
		},
	},
	[341] = 
	{
		[140] = {
			{id = 140, cost = 5, x = -10.554447,	z = -197.729034,	y = -11.076664,	h = -2.267869, rx = true
				--, requires = {
					--["QuestCompleted(1213)"] = true,
				--},
			},
		},
	},
	[141] = 
	{
		[130] = {
			{id = 130, cost = 3, x = -116.704605,	z = 339.036774,	    y = 18.374495,	h = -0.296405},
		},
		[131] = {
			{id = 131, cost = 3, x = 13.381968,	    z = 563.856323,	    y = 18.375681,	h = -1.863721},
		},
		[140] = {
			{id = 140, cost = 5, x = -406.028320,	z = 98.055061,	    y = -1.327996,	h = -1.252450},
		},
		[145] = {
			{id = 145, cost = 5, x = 450.149078,	z = -179.656448,	y = -17.999840,	h = 2.399650},
		},
		[146] = {
			{id = 146, cost = 5, x = 232.728973,	z = 674.237854,	    y = 2.753296,	h = 0.907127},
		},
		[147] = {
			{id = 147, cost = 5, x = -27.951309,	z = -494.383026,	y = 33.000000,	h = 3.133206},
		},
	},
	[145] = 
	{
		[153] = {
			{id = 153, cost = 5, x = 369.957184,	z = -296.594879,	y = 32.385502,	h = 2.514460},
		},
		[146] = {
			{id = 146, cost = 5, x = -169.531570,	z = 489.810608,	    y = -46.311321,	h = 0.533979},
		},
		[141] = {
			{id = 141, cost = 5, x = -564.688477,	z = 340.296539,	    y = -19.019501,	h = -0.745622},
		},		
	},
	[146] = 
	{
		[141] = {
			{id = 141, cost = 5, x = -427.950775,	z = -426.944122,	y = 12.862315,	h = -2.438309},
		},
		[145] = {
			{id = 145, cost = 5, x = -28.638260,	z = -767.939148,	y = 17.150595,	h = -3.138837},
		},
	},
	[147] = 
	{
		[141] = {
			{id = 141, cost = 5, x = 36.747425,	    z = 512.867920,	    y = 6.114986,	h = 0.016709},
		},
		[146] = {
			{id = 156, cost = 5, x = -96.634842,	z = -415.727081,	y = 84.427101,	h = 2.398999},
		},
	},
	[156] = 
	{
		[147] = {
			{id = 147, cost = 5, x = -419.502350,	z = -116.779129,	y = -3.216816,	h = 0.353663},
		},
		[155] = {
			{id = 155, cost = 5, x = 124.911911,	z = -770.00,	y = 31.45,	h = 2.35},
		},
		[351] = {
			{id = 351, cost = 5, x = 21.12418,	y = 21.25272, z = -631.3731, h = 0.103,	g = 2002881},
		},
		[418] = {
			{id = 418, cost = 5, x = -162.28, y = 304.56, z = -329.25, h = -2.80, b = 1012149
				, requires =  {
					["QuestCompleted(1580)"] = true,
				}
			},
		},
		[842] = {
			{id = 842, cost = 1, x = 351, y = -26, z = -370, h = 3.13, b = 1029791
				, requires =  {
					["GetQuestInfo(3279,'step') > 1 or QuestCompleted(3279)"] = true,
				}
			},
		},
	},
	[132] =
	{
		[133] = {
			{id = 133, cost = 1, x = 100.587738,	z = 15.518513,	    y = 4.958726,	h = 2.319835},
			{id = 133, cost = 1, x = 11.472159,	    z = -13.339621,  	y = 1.167319,	h = 2.703871},
			{id = 133, cost = 1, x = -104.582939,	z = 9.293154,	    y = 1.157480,	h = -2.935570},
		},
		[148] = {
			{id = 148, cost = 5, x = 154.172577,	z = 157.515976,	    y = -12.851933,	h = 1.553804},
		},
		[130] = {
			{id = 130, cost = 3, x = 29.1025, y = -19.000, z = 102.408, h = 1, a = 1000106, i = 1
				, requires =  {
					["CanUseAirship()"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Purchase Passage to Ul'dah",
                    ["J"] = "「ウルダハ」へ行く",
                    ["G"] = "Nach Ul'dah",
                    ["F"] = "Aller à Ul'dah",
                    ["CN"] = "前往乌尔达哈",
                    ["KR"] = "'울다하'로 이동",
                },
			},
		},
		[128] = {
			{id = 128, cost = 3, x = 29.1025, y = -19.000, z = 102.408, h = 1, a = 1000106, i = 2 
				, requires =  {
					["CanUseAirship()"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Purchase Passage to Limsa Lominsa",
                    ["J"] = "「リムサ・ロミンサ」へ行く",
                    ["G"] = "Nach Limsa Lominsa",
                    ["F"] = "Aller à Limsa Lominsa",
                    ["CN"] = "前往利姆萨·罗敏萨",
                    ["KR"] = "'림사 로민사'로 이동",
                },
			},
		},
		[144] = {
			{id = 144, cost = 3, x = 29.1025, y = -19.000, z = 102.408, h = 1, a = 1000106, i = 3 
				, requires =  {
					["QuestCompleted(435)"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Seek Passage to the Gold Saucer",
                    ["J"] = "「ゴールドソーサー」へ行く",
                    ["G"] = "Zum Gold Saucer",
                    ["F"] = "Aller au Gold Saucer",
                    ["CN"] = "前往金碟游乐场",
                    ["KR"] = "'골드 소서'로 이동",
                },
			},
		},
		[179] = {
			{id = 179, cost = 1, x = 25.977, y = -8, z = 100.151, h = -1.760, b = 1000102, i = 1 },
		},
		[204] = {
			{id = 204, cost = 1, x = 232, y = 1.90, z = 45.5, h = 1.16, b = 1000423, i = 1},
		},
	},
	[204] =
	{
		[132] = {
			{id = 132, cost = 1, x = 0, y = 1, z = 9.8, h = 0, g = 2001215},
		},
	},
	[179] =
	{
		[132] = {
			{id = 132, cost = 1, x = 0.04, y = 0.00, z = 6.77, h = -0.03, g = 2000087},
		},
	},
	[351] = 
	{
		[156] = {
			{id = 156, cost = 5, x = 0.04466, z = 27.38899,	y = 2.0534,	 h = 0.00209,	g = 2002879},
		},
	},
	[133] =
	{
		[132] = {
			{id = 132, cost = 1, x = 140.014786,	z = -21.999306,	    y = 11.062968,	h = -0.824087},
			{id = 132, cost = 1, x = 14.614426,	    z = -88.333893,	    y = 8.351574,	h = -0.629290},
			{id = 132, cost = 1, x = -129.454391,	z = -36.090492,  	y = 5.504999,	h = 1.396102},
		},
		[152] = {
			{id = 152, cost = 3, x = 179.866, y = -2.239, z = -241.585, h = 1, b = 1001263, i = 1
				, requires =  {
					["Player.level >= 10"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Purchase Passage to Sweetbloom Pier",
                    ["J"] = "「花蜜桟橋」へ行く",
                    ["G"] = "Zum Honigblumen-Steg",
                    ["F"] = "Aller à la jetée du Bouquet",
                    ["CN"] = "前往花蜜栈桥",
                    ["KR"] = "'꽃꿀 나루'로 이동",
                },
			},
		},
		[154] = {
			{id = 154, cost = 5, x = -207.365845,	z = -95.740646,	    y = 10.368533,	h = -1.571268},
		},
		[205] = {
			{id = 205, cost = 1, x = -159.5, y = 4, z = -4.199, h = -.836, b = 1000460},
		},
	},
	[205] =
	{
		[133] = {
			{id = 133, cost = 1, x = 45.799, y = 7.699, z = 47.400, h = 0, g = 2001216},
		},
	},
	[148] =
	{
		[132] = {
			{id = 132, cost = 5, x = 127.973625,	z = -315.603302,    y = 25.274239,	h = 3.113573},
		},
		[152] = {
			{id = 152, cost = 5, x = 385.957275,	z = -184.674515,    y = -3.278250,	h = 2.149688},
		},
		[153] = {
			{id = 153, cost = 5, x = 159.596100,	z = 550.260925,	    y = -23.807894,	h = -0.010091},
		},
		[154] = {
			{id = 154, cost = 5, x = -501.604462,	z = -355.052673,	y = 74.197563,	h = 3.075810
				, requires =  {
					["Player.level >= 25"] = true,
					["CanUseAirship()"] = true,
				},
			},
		},
		[340] = {
			{id = 340, cost = 5, x = 199,	z = 324.05,	    y = -32.05,	h = 1.83, g = 1005656, r = true
				--, requires = {
					--["QuestCompleted(1212)"] = true,
				--},
			},
		},
	},
	[340] = {
		[148] = {
			{id = 148, cost = 5, x = 10.75,	z = 206.67,	    y = 2.61,	h = 0.36, g = 1005655, rx = true
				--, requires = {
					--["QuestCompleted(1212)"] = true,
				--},
			},
		},
	},
	[152] =
	{
		[133] = {
			{id = 133, cost = 3, x = -575.629, y = 8.274, z = 74.9197, h = 1, b = 1000541, i = 1
				, requires =  {
					["Player.level >= 10"] = true,
				},
			},
		},
		[148] = {
			{id = 148, cost = 5, x = -515.380066,	z = 276.312958,	    y = 18.856667,	h = 0.029517},
		},
		[153] = {
			{id = 153, cost = 5, x = -161.377731,	z = 450.613647,	    y = 4.327631,	h = 1.632315},
		},
		[612] = {
			{id = 612, cost = 1, x = 26.93, y = 6.18, z = 401.05, h = 0, b = 1021535
				, requires =  {
					["QuestCompleted(2446)"] = true,
				},
			},
		},
	},
	[153] =
	{
		[148] = {
			{id = 148, cost = 5, x = -368.008545,	z = -243.654633,	y = 29.841984,	h = -2.376045},
		},
		[152] = {
			{id = 152, cost = 5, x = 276.864288,	z = -259.381195,	y = 11.068289,	h = 2.220435},
		},
		[145] = {
			{id = 145, cost = 5, x = -285.880859,	z = 696.760864,	 y = -0.202368,	h = -0.557287},
		},
	},
	[154] =
	{
		[133] = {
			{id = 133, cost = 5, x = 454.377014, z = 194.206085, y = -1.377332,	h = 2.202893},
		},
		[148] = {
			{id = 148, cost = 5, x = 18.537865,	z = 531.396240,	 y = -54.870895, h = 0.723304
				, requires =  {
					["Player.level >= 25"] = true,
					["CanUseAirship()"] = true,
				},
			},
		},
		[155] = {
			{id = 155, cost = 5, x = -369.235107, z = 189.336166, y = -5.984657, h = -2.549946},
		},
	},
	[155] =
	{
		[154] = {
			{id = 154, cost = 5, x = 9.579012,		z = 580.486389,	  	y = 183.084641,	h = 0.293345},
		},
		[156] = {
			{id = 156, cost = 5, x = -221.167343,	z = 702.521790,	    y = 217.634018,	h = 0.803411},
		},
		[395] = {
			{id = 395, cost = 5, x = 264.9519,	y = 302.2564,    z = -223.5088,	h = 3.1356,	b = 1009973 },
		},
		[418] = {
			{id = 418, cost = 5, x = -163.6195,	y = 304.1538,    z = -332.2256,	h = -2.4607, b = 1012149
				, requires =  {
					["QuestCompleted(428)"] = true,
				},
			},
		},
	},
	[128] =
	{
		[129] = {
			{id = 129, cost = 1, x = -5.868670,	    z = -27.703053,	    y = 43.095970,	h = -1.319617},
			{id = 129, cost = 1, x = -72.385811,	z = -122.175789,	y = 39.727707,	h = -0.803213},
			{id = 129, cost = 1, x = -94.809868,	z = 103.263062,	    y = 35.500000,	h = -2.218227},
		},
		[135] = {
			{id = 135, cost = 5, x = 24.692057,	    z = 180.197906,	    y = 44.499928,	h = 0.009527},
		},
		[130] = {
			{id = 130, cost = 3, x = -23.511, y = 91.99, z = -3.719, h = 1, a = 1002695, i = 1 
				, requires = {
					["CanUseAirship()"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Purchase Passage to Ul'dah",
                    ["J"] = "「ウルダハ」へ行く",
                    ["G"] = "Nach Ul'dah",
                    ["F"] = "Aller à Ul'dah",
                    ["CN"] = "前往乌尔达哈",
                    ["KR"] = "'울다하'로 이동",
                },
			},
		},
		[132] = {
			{id = 132, cost = 3, x = -23.511, y = 91.99, z = -3.719, h = 1, a = 1002695, i = 2 
				, requires = {
					["CanUseAirship()"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Purchase Passage to Gridania",
                    ["J"] = "「グリダニア」へ行く",
                    ["G"] = "Nach Gridania",
                    ["F"] = "Aller à Gridania",
                    ["CN"] = "前往格里达尼亚",
                    ["KR"] = "'그리다니아'로 이동",
                },
			},
		},
		[144] = {
			{id = 144, cost = 3, x = -23.511, y = 91.99, z = -3.719, h = 1, a = 1002695, i = 3 
				, requires =  {
					["QuestCompleted(435)"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Seek Passage to the Gold Saucer",
                    ["J"] = "「ゴールドソーサー」へ行く",
                    ["G"] = "Zum Gold Saucer",
                    ["F"] = "Aller au Gold Saucer",
                    ["CN"] = "前往金碟游乐场",
                    ["KR"] = "'골드 소서'로 이동",
                },
			},
		},
		[177] = {
			{id = 177, cost = 1, x = 13.245, y = 39.999, z = 11.8289, h = 1.0427, b = 1000974, i = 1 },
		},
	},
	[177] = 
	{
		[128] = {
			{id = 128, cost = 1, x = 0.02, y = 0.01, z = 6.85, h = -0.03, g = 2001010 },
		},
	},
	[129] =
	{
		[128] = {
			{id = 128, cost = 1, x = -83.549187,	z = -25.898380,	    y = 17.999935,	h = 3.123204},
			{id = 128, cost = 1, x = -5.879787,	    z = 27.567932,	    y = 20.365623,	h = -1.726619},
			{id = 128, cost = 1, x = -90.283981,	z = 114.456573,	    y = 21.482763,	h = -0.000968},
		},
		[134] = { 
			{id = 134, cost = 5, x = 63.212173,	    z = 0.221235,	    y = 19.999994,	h = 1.553629},
		},
		[140] = {
			{id = 140, cost = 3, x = -359.895, y = 8, z = 41.566, h = -1, b = 1003540
				, requires = {
					["Player.level >= 12"] = true,
					["CanUseAirship()"] = true,
				},
			},
		},
		[138] = {
			{id = 138, cost = 3, x = -190.834, y = 1, z = 210.829, h = -1, b = 1000868, i = 1
				, requires = {
					["Player.level >= 15"] = true,
					["CanUseAirship()"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Purchase Passage to Aleport",
                    ["J"] = "「エールポート」へ行く",
                    ["G"] = "Zum Bierhafen",
                    ["F"] = "Aller à Port-aux-Ales",
                    ["CN"] = "前往小麦酒港",
                    ["KR"] = "'맥주 항구'로 이동",
                },
			},
		},
		[137] = {
			{id = 137, cost = 3, x = -190.834, y = 1, z = 210.829, h = -1, b = 1000868, i = 2
				, requires = {
					["Player.level >= 30"] = true,
					["CanUseAirship()"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Purchase Passage to Costa del Sol",
                    ["J"] = "「コスタ・デル・ソル」へ行く",
                    ["G"] = "Zur Sonnenküste",
                    ["F"] = "Aller à Costa del Sol",
                    ["CN"] = "前往太阳海岸",
                    ["KR"] = "'코스타 델 솔'로 이동",
                },
			},
		},
		[628] = {
			{id = 628, cost = 1, x = -356.02, y = 8.01, z = 46.85, h = -1.63, g = 1021536
				, requires = {
					["QuestCompleted(2469)"] = true, -- check quest id. only added to stop low lvl chars attempting pathing
                },
			},
		},
		[680] = {
			{id = 680, cost = 1, x = -357.66, y = 8.00, z = 45.82, h = 1.61, g = 1020442 },
		},
	},
	[134] =
	{
		[129] = {
			{id = 129, cost = 5, x = -43.422066,	z = 153.802917,	    y = 35.445602,	h = -1.105748},
		},
		[135] = {
			{id = 135, cost = 5, x = 203.290405,	z = 285.331512,	    y = 65.182816,	h = 1.558325},
		},
		[137] = {
			{id = 137, cost = 5, x = -163.673187,	z = -734.864807,	y = 35.884563,	h = 2.833870},
		},
		[138] = {
			{id = 138, cost = 5, x = -375.221436,	z = -603.032593,	y = 33.130100,	h = -2.164589},
		},
	},
	[135] =
	{
		[128] = {
			{id = 128, cost = 5, x = -52.436810,	z = 116.130196,	    y = 75.830246,	h = -1.584678},
		},
		[134] = {
			{id = 134, cost = 5, x = 230.518661,	z = -342.391663,	y = 74.490341,	h = -2.258913},
		},
		[137] = {
			{id = 137, cost = 5, x = 694.988586,	z = -387.720428,	y = 79.927017,	h = -3.131416},
			{id = 137, cost = 5, x = 570.413635,	z = -523.798584,	y = 96.407211,	h = 3.126078},
		},
		[339] = {
			{id = 339, cost = 5, x = 598.555847,	z = -108.400681,	y = 61.519623,	h = 0.287259, r = true
				--, requires = {
					--["QuestCompleted(1214)"] = true,
				--},
			},
		},
	},
	[339] =
	{
		[135] = {
			{id = 135, cost = 5, x = -9.653202,		z = -169.488068,	y = 48.346123,	h = -3.115577, rx = true
				--, requires = {
					--["QuestCompleted(1214)"] = true,
				--},
			},
		},
	},
	[137] =
	{
		[129] = {
			{id = 129, cost = 3, x = 606.901, y = 11.6, z = 391.991, h = -1, b = "1003585;1005420", i = 1
				, requires = {
					["Player.level >= 30"] = true,
					["CanUseAirship()"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Purchase Passage to Limsa Lominsa",
                    ["J"] = "「リムサ・ロミンサ」へ行く",
                    ["G"] = "Nach Limsa Lominsa",
                    ["F"] = "Aller à Limsa Lominsa",
                    ["CN"] = "前往利姆萨·罗敏萨",
                    ["KR"] = "'림사 로민사'로 이동",
                },
			},
		},
		[134] = {
			{id = 134, cost = 5, x = -113.323311,	z = 47.165649,	    y = 70.324112,	h = -1.409805},
		},
		[135] = {
			{id = 135, cost = 5, x = 246.811844,	z = 837.507141,	    y = 56.341099,	h = -0.146225},
			{id = 135, cost = 5, x = -132.151001,	z = 743.861389,	    y = 69.843018,	h = -0.003346},
		},
		[139] = {
			{id = 139, cost = 5, x = 78.965446,	    z = -119.879181,	y = 80.393074,	h = 3.141325},
		},
	},
	[138] =
	{
		[129] = {
			{id = 129, cost = 3, x = 318.314, y = -36, z = 351.376, h = -1, b = 1003584, i = 1
				, requires = {
					["Player.level >= 15"] = true,
					["CanUseAirship()"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Purchase Passage to Limsa Lominsa",
                    ["J"] = "「リムサ・ロミンサ」へ行く",
                    ["G"] = "Nach Limsa Lominsa",
                    ["F"] = "Aller à Limsa Lominsa",
                    ["CN"] = "前往利姆萨·罗敏萨",
                    ["KR"] = "'림사 로민사'로 이동",
                },
			},
		},
		[135] = {
			{id = 135, cost = 3, x = 318.314, y = -36, z = 351.376, h = -1, b = 1003584, i = 2
				, requires = {
					["Player.level >= 15"] = true,
					["CanUseAirship()"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Purchase Passage to Candlekeep Quay",
                    ["J"] = "「キャンドルキープ埠頭」へ行く",
                    ["G"] = "Zum Kerzenwacht-Kai",
                    ["F"] = "Aller au quai de la Torche",
                    ["CN"] = "前往守炬埠头",
                    ["KR"] = "'촛불지기 부두'로 이동",
                },
			},
		},
		[134] = {
			{id = 134, cost = 5, x = 811.963623,	z = 390.644775,	    y = 49.586365,	h = 0.378320},
		},
		[139] = {
			{id = 139, cost = 5, x = 410.657715,	z = -10.786478,	    y = 30.619648,	h = 2.819475},
		},
	},
	[139] =
	{
		[137] = {
			{id = 137, cost = 5, x = 719.070007,	z = 214.217957,	    y = 0.217405,	h = 0.028251},
		},
		[138] = {
			{id = 138, cost = 5, x = -476.706177,	z = 287.913330,	    y = 1.921210,	h = -0.688538
				, requires = {
					["(Player.localmapid ~= 139 or (Player.localmapid == 139 and ((Player.pos.x < 0) or (Player.pos.x > 0 and GilCount() >= 40))))"] = true,
				}
			},
		},
		[180] = {
			{id = 180, cost = 5, x = -341.941010,	z = -18.610147,	    y = 48.610909,	h = 1.852675},
			{id = 180, cost = 5, x = 284.691162,	z = -202.286819,	y = 42.024910,	h = -2.485059},
		},
	},
	[180] =
	{
		[139] = {
			{id = 139, cost = 5, x = -324.825165,	z = -81.512505,	    y = 50.272530,	h = 0.180411},
			{id = 139, cost = 5, x = 244.891861,	z = -251.455048,	y = 53.276550,	h = 1.401489},
		},
	},
	[198] =
	{
		[129] = {
			{id = 129, cost = 5, x = 0, y = 1, z = 7.9, h = -0.03, g = 2001835},
		},
	},
	[212] = 
	{
		[140] = {
			{id = 140, cost = 5, x = -15.1326, z = -0.0081, y = 0, h = -1.6396, g = 2001716},
		},
	},
	[395] =
	{
		[155] = {
			{id = 155, cost = 5, x = -3.9291, z = 10.2243, y = -1.1920, h = -0.06821, g = 2004781},
		},
	},
	[331] = 
	{
		[132] = {
			{id = 132, cost = 3, x = -86.5248, y = -0.2377, z = -35.6936, h = 1, g = 1007602 },
		},
	},
	[397] = 
    {
        [398] = {
            {id = 398, cost = 5, x = -849.0742, y = 117.6830, z = -655.5919, h = -2.0784
				, requires = {
					["GetQuestInfo(1609,'step') >= 1 or QuestCompleted(1609)"] = true,
				},
			},
        },
        [418] = {
            {id = 418, cost = 5, x = 468.7914, y = 224.4822, z = 880.5457, h = -0.2626
                , requires = {
                    ["IsOnMap(397) and (CanFlyInZone() or QuestCompleted(1634))"] = true, -- check quest, can be accessed sooner?
                },
            },
        },
    },
	[398] = 
	{
		[397] = {
			{id = 397, cost = 5, x = 870.6607, y = -3.6288, z = 351.0845, h = 1.01271
				, requires = {
					["GetQuestInfo(1609,'step') >= 4 or QuestCompleted(1609)"] = true,
				},
			},
		},
		[399] = {
			{id = 399, cost = 5, x = -799.82757568359, y = -122.63314819336, z = 577.40979003906, h = -1.5792300701141  
				, requires = {
					["GetQuestInfo(1655,'step') >= 1 or QuestCompleted(1655)"] = true,
				},
			},
		},
		[400] = {
			{id = 400, cost = 5, x = -693.9, y = 5.2, z = -841, h = -0.10000000149012, b = 1011946
				, requires = {
					["GetQuestInfo(1617,'step') == 255 or QuestCompleted(1617)"] = true,
				},
			},
		},
	},
	[399] = 
	{
		[398] = {
			{id = 398, cost = 5, x = 909.19537353516, y = 162.49412536621, z = 188.35443115234, h = 1.4070112705231
				, requires = {
					["GetQuestInfo(1617,'step') == 255 or QuestCompleted(1617)"] = true,
				},
			},
		},
		[463] = {
			{id = 463, cost = 3, x = -488.83758544922, y = 137.78799438477, z = 740.47930908203, h = -2.7809858322144, g = 2005336},
		},
		[478] = {
			{id = 478, cost = 3, x = -228.93890380859, y = 106.87369537354, z = -631.58227539063, h = -2.89  },
			{id = 478, cost = 3, x = -544, y = 155.82, z = -515.16, h = -2.74  
				, requires = {
					["QuestCompleted(1658)"] = true,
				},
			},
		},
	},
	[400] = 
	{
		[398] = {
			{id = 398, cost = 5, x = 199.5, y = -69.7, z = 708.3, h = 1.0, g = 2005371},
		},
	},
	[401] = 
	{
		[419] = {
			{id = 419, cost = 3, x = -734.40356445313, y = -105.04070281982, z = 459.84994506836, h = -2.2330574989319, b = 1011949 },
		},
	},
	[402] = 
	{
		[419] = { 
			{id = 419, cost = 3, x = -876.7509765625, y = -184.29299926758, z = -669.19744873047, h = -2.3307199478149, b = 2005372
				, requires =  {
					["QuestCompleted(1664)"] = true,
				}
			},
        },
    },
	[418] = 
	{
		[155] = {
			{id = 155, cost = 5, x = 4.2846689224243, y = -2.5668189525604, z = 148.25918579102, h = 0.24493718147278, b = 1011224 },
		},
		[397] = {
           {id = 397, cost = 5, x = -163.44, y = 2.15, z = -5.51, b = 1011195, i = 1
                , requires =  {
                    ["CanUseAetheryte(71)"] = true,
                }
            },  
			{id = 397, cost = 1, x = -186.16, y = 14, z = -57.15, h = -2.27
                , requires =  {
                    ["QuestCompleted(1634)"] = true, -- check access, can be accessed sooner?
                }
            },   
        },
		[419] = {
			{id = 419, cost = 1, x = -153.8108215332, y = 30.949907302856, z = -141.81959533691, h = -3.120050907135},
			{id = 419, cost = 1, x = -57.653438568115, y = 20.542848587036, z = -97.128196716309, h = 2.4447572231293},
			{id = 419, cost = 1, x = 53.141960144043, y = 29.736303329468, z = -80.891120910645, h = -2.9000406265259},
			{id = 419, cost = 1, x = 156.03057861328, y = -19.477405548096, z = 55.064247131348, h = 2.3485136032104},
		},
		[439] = {
			{id = 439, cost = 1, x = 93.577056884766, y = 24.026489257813, z = -33.090774536133, h = 1.1162509918213, a = 1011214 
				, requires = {
					["CanUseAirship()"] = true,
				},
			},
		},
	},
	[419] = 
	{
		[427] = {
			{id = 427, cost = 1, x = -144.67098, y = 14.8031, z = -129.4461, h = -1.5209, b = 1011215 },
		},
		[433] = {
			{id = 433, cost = 1, x = 17.2442, y = 16.0096, z = -9.5047, h = 1.5103, b = 1011217 },
		},
		[418] = {
			{id = 418, cost = 1, x = 17.5327, y = -13.0772, z = -66.0502, h = -0.86},
			{id = 418, cost = 1, x = -16.8083, y = -13.0683, z = -67.0495, h = 0.92},
			{id = 418, cost = 1, x = 258.4115, y = -13.7349, z = -103.4960, h = 1.72},
			{id = 418, cost = 1, x = -314.8616, y = -25.5761, z = -64.8715, h = -0.79},
		},
		
		[130] = {
			{id = 130, cost = 3, x = 151.99447631836, y = -12.559194564819, z = -8.2321929931641, h = -1.4262824058533, b = 1011211, i = 1
				, requires =  {
					["QuestCompleted(1664)"] = true,
				}
				, conversationstrings = {
                   ["E"] = "Purchase Passage to Ul'dah",
                   ["J"] = "「ウルダハ」へ行く",
                   ["G"] = "Nach Ul'dah",
                   ["F"] = "Aller à Ul'dah",
                   ["CN"] = "前往乌尔达哈",
                   ["KR"] = "'울다하'로 이동",
                },
			},
		},
		[132] = {
			{id = 132, cost = 3, x = 151.99447631836, y = -12.559194564819, z = -8.2321929931641, h = -1.4262824058533, b = 1011211, i = 2 
				, requires =  {
					["QuestCompleted(1664)"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Purchase Passage to Gridania",
                    ["J"] = "「グリダニア」へ行く",
                    ["G"] = "Nach Gridania",
                    ["F"] = "Aller à Gridania",
                    ["CN"] = "前往格里达尼亚",
                    ["KR"] = "'그리다니아'로 이동",
                },
			},
		},
		[128] = {
			{id = 128, cost = 3, x = 151.99447631836, y = -12.559194564819, z = -8.2321929931641, h = -1.4262824058533, b = 1011211, i = 3
				, requires =  {
					["QuestCompleted(1664)"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Purchase Passage to Limsa Lominsa",
                    ["J"] = "「リムサ・ロミンサ」へ行く",
                    ["G"] = "Nach Limsa Lominsa",
                    ["F"] = "Aller à Limsa Lominsa",
                    ["CN"] = "前往利姆萨·罗敏萨",
                    ["KR"] = "'림사 로민사'로 이동",
                },
			},
		},
		[144] = {
			{id = 144, cost = 3, x = 151.99447631836, y = -12.559194564819, z = -8.2321929931641, h = -1.4262824058533, b = 1011211, i = 4
				, requires =  {
					["QuestCompleted(435)"] = true,
					["QuestCompleted(1664)"] = true,
				} 
				, conversationstrings = {
					["E"] = "Seek Passage to the Gold Saucer",
					["J"] = "「ゴールドソーサー」へ行く",
					["G"] = "Zum Gold Saucer",
					["F"] = "Aller au Gold Saucer",
					["CN"] = "前往金碟游乐场",
					["KR"] = "'골드 소서'로 이동",
				},
			},
		},
		[401] = {
			{id = 401, cost = 3, x = 151.99447631836, y = -12.559194564819, z = -8.2321929931641, h = -1.4262824058533, b = 1011211, i = 5 },
		},
		[402] = {
            {id = 402, cost = 3, x = 166.46820068359, y = -14.313319206238, z = 48.422393798828, h = 0.81401968002319, b = 1012153
				, requires =  {
					["QuestCompleted(1664)"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Seek Passage to Azys Lla",
                    --["J"] = "「グリダニア」へ行く",
                   -- ["G"] = "Nach Gridania",
                   -- ["F"] = "Aller à Gridania",
                    --["CN"] = "前往格里达尼亚",
                   -- ["KR"] = "'그리다니아'로 이동",
                },
			},
        },
	},
	[427] = 
	{
		[419] = {
			{id = 419, cost = 3, x = -5.0512, y = 0, z = 11.495, h = 0, g = 2005332 },
		},
	},
	[433] = 
	{
		[419] = {
			{id = 419, cost = 3, x = -0.04325, y = 0, z = 12.5567, h = -0.0167, g = 2005334 },
		},
	},
	[439] = 
	{
		[418] = {
			{id = 418, cost = 1, x = 29.30, y = 6.5, z = -20.3, h = 2.32, g = 2005335 },
		},
	},
	[463] = 
	{
		[399] = {
			{id = 399, cost = 3, x = 7.5150, y = 37.7879, z = -50.2450, h = 2.9914, g = 2005337 },
		},
	},
	[478] = 
	{
		[398] = {
			{id = 398, cost = 3, x = 147.0463, y = 207, z = 115.8594, h = 0.9793},
		},
		[399] = {
			{id = 399, cost = 3, x = 147.0463, y = 207, z = 115.8594, h = 0.9793},
			{id = 399, cost = 3, x = 73.25932, y = 205, z = 143.0470, h = -0.522
				, requires = {
					["QuestCompleted(1658)"] = true,
				},
			},
		},
		[463] = {
			{id = 463, cost = 3, x = 73.25932, y = 205, z = 143.0470, h = -0.522
				, requires = {
					["QuestCompleted(1658)"] = true,
				},
			},
		},
	},	
	[210] =
	{
		[130] = {
			{id = 130, cost = 1, x = 0, y = 0, z = 10, h = 0, g = 2001695},
		},
	},
	[612] =
	{
		[152] = {
			{id = 152, cost = 1, x = -664.33, y = 130.00, z = -533.29, h = 0, g = 1019516
				, requires = {
					["GetQuestInfo(2446,'step') == 255 or QuestCompleted(2446)"] = true,
				},
			},
		},
		[620] = {
			{id = 620, cost = 1, x = 848.3, y = 86.1, z = 363.3, h = 1.03, 
			requires = {
					["GetQuestInfo(2534,'step') >= 3 or QuestCompleted(2534)"] = true,
				},
			},
		},
		[635] = {
			{id = 635, cost = 1, x = 482.54, y = 61.65, z = -556.99, h = 2.01
				, requires = {
					["GetQuestInfo(2447,'step') >= 4 or QuestCompleted(2447)"] = true,
				},
			},
		},
		[683] = {
			{id = 683, cost = 1, x = 802.3, y = 178.22, z = -302.3, h = 0, g = 2008200
				, requires = {
					["GetQuestInfo(2532,'step') >= 4 or QuestCompleted(2532)"] = true,
				},
			},
		},
	},
	[613] =
	{
		[614] = {
			{id = 614, cost = 1, x = -828.24, y = 19.88, z = -267.71, h = -0.91
				, requires = {
					["HasQuest(2491) or QuestCompleted(2491)"] = true,
				},
			},
		},
		[622] = {
			{id = 622, cost = 1, x = -742.36, y = -0.83, z = -866.99, h = -2.08
				, requires = {
					["GetQuestInfo(2630,'step') >= 2 or QuestCompleted(2630)"] = true,
				},
			},
		},
		[628] = {
            {id = 628, cost = 1, x = 879.8, y = 1.18, z = 876.13, h = 0.73
				, requires = {
					["QuestCompleted(2476)"] = true,
				},
			},
        }, 
	},
	[614] =
	{
		[613] = {
			{id = 613, cost = 1, x = 828.95, y = 99.96, z = -411.88, h = -0.69
				, requires = {
					["HasQuest(2491) or QuestCompleted(2491)"] = true,
				},
			},
		},
		[759] = {
			{id = 759, cost = 1, x = -493.98, y = 1.30, z = 542.90, h = 2.14, b = 1024794},
		},
	},
	[620] =
	{
		[612] = {
			{id = 612, cost = 1, x = -789.5, y = 297.4, z = 214.69, h = -1.6, 
			requires = {
					["GetQuestInfo(2534,'step') >= 3 or QuestCompleted(2534)"] = true,
				},
			},
		},
		[621] = {
			{id = 621, cost = 1, x = 587.64, y = 344.09, z = 420.33, h = 1.60
				, requires = {
					["GetQuestInfo(2548,'step') >= 3 or QuestCompleted(2548)"] = true,
				},
			},
		},
		[635] = {
			{id = 635, cost = 1, x = -658.47, y = 50.87, z = -792.97, h = -2.08
				, requires = {
					["GetQuestInfo(2447,'step') >= 4 or QuestCompleted(2447)"] = true,
				},
			},
		},
	},
	[621] =
	{
		[620] = {
			{id = 620, cost = 1, x = -658.47, y = 50.87, z = -792.97, h = -2.08
				, requires = {
					["GetQuestInfo(2548,'step') >= 3 or QuestCompleted(2548)"] = true,
				},
			},
		},
		[738] = {
            {id = 738, cost = 1, x = 754.27, y = 70.00, z = 424.70, h = 0.07, b = 1024113 },
        },
	},
	[622] =
	{
		[613] = {
			{id = 613, cost = 1, x = 543.48, y = -21.83, z = 699.90, h = -0.03
				, requires = {
					["GetQuestInfo(2630,'step') >= 2 or QuestCompleted(2630)"] = true,
				},
			},
		},
		[614] = {
			{id = 614, cost = 1, x = -164.0, y = 0.65, z = 850.7, h = 0.2
				, requires = {
					["QuestCompleted(2517)"] = true,
				},
			},
		},
	},
	[628] =
    {
        [129] = {
            {id = 129, cost = 1, x = -100.02, y = -7.78, z = -63.81, h = -2.9, g = 1019004},
        },
        [639] = {
            {id = 639, cost = 1, x = 151.02, y = 14.78, z = 93.81, h = 0.14, g = 1019070},
        },
        [613] = {
            {id = 613, cost = 1, x = -134.31, y = -6.91, z = -58.86, h = -1.61
				, requires = {
					["GetQuestInfo(2476,'step') == 255 or QuestCompleted(2476)"] = true,
				},
			},
        },    
    },
	[635] =
	{
		[612] = {
			{id = 612, cost = 1, x = -32.02, y = 14.31, z = 163.50, h = 0, },
			{id = 612, cost = 1, x = 2.10, y = -2.12, z = 163.50, h = 0, },
		},	
		[620] = {	
			{id = 620, cost = 1, x = 129.18, y = -0.28, z = -3.39, h = 1.49
				, requires = {
					["HasQuest(2455) or QuestCompleted(2455)"] = true,
				},
			},
		},
	},
	[639] =
	{
		[628] = {
			{id = 628, cost = 1, x = 0.04, y = 0.00, z = 12.88, h = -0.00, g = 2008134},
		},
	},
	[680] =
	{
		[129] = {
			{id = 129, cost = 1, x = -0.02, y = 16.35, z = -19.03, h = 3.13, g = 2008373},
		},
	},
	[683] =
	{
		[612] = {
			{id = 612, cost = 1, x = 1.0, y = -4.27, z = 43.45, h = 0.00, g = 2008372},
		},
	},
	[738] =
    {
        [621] = {
            {id = 621, cost = 1, x = 0.18, y = -2.00, z = 66.02, h = 0.00, b = 2009215},
        },
    },
	[744] =
    {
        [759] = {
            {id = 759, cost = 1, x = 0.02, y = 0.91, z = 18.31, h = 0.00, b = 2009289},
        },
    },
	[759] =
    {
        [614] = {
            {id = 614, cost = 1, x = 147.81, y = -4.18, z = 49.45, h = 0.00, b = 1024792},
        },
		[744] = {
            {id = 744, cost = 1, x = -10.33, y = 0.20, z = 12.89, h = 0.00, b = 1024974},
        },
    },
	[813] =
    {
        [815] = {
            {id = 815, cost = 1, x = 535, y = -5, z = 862, h = 0.01
                , requires = {
                    ["QuestCompleted(3609)"] = true,
                },
            },
        },
        [816] = {
            {id = 816, cost = 1, x = -323, y = 116, z = -832, h = -3.0
				, requires = {
					["GetQuestInfo(3305,'step') == 255 or QuestCompleted(3305)"] = true,
				},
			},
        },
        [817] = {
            {id = 817, cost = 1, x = 878, y = 42, z = -290, h = 1.6
				, requires = {
					["QuestCompleted(3323)"] = true,
				},
			},
        },
        [819] = {
            {id = 819, cost = 1, x = 831, y = 38, z = 407, h = 1.57},
        },
    },
	[814] =
    {
        [819] = {
            {id = 819, cost = 1, x = 802, y = 1, z = 253, h = -1.55, b = 1029807
				, requires = {
					["GetQuestInfo(3282,'step') == 255 or QuestCompleted(3282)"] = true,
				},
			},
        },
        [818] = {
            {id = 818, cost = 1, x = -495, y = 8, z = 586, h = -1.61, b = 1027448
				, requires = {
					["QuestCompleted(3647)"] = true,
				},
			},
        },
        [820] = {
            {id = 820, cost = 1, x = 173, y = 58, z = 879, h = -0.05
				, requires = {
					["GetQuestInfo(3286,'step') > 1 or QuestCompleted(3286)"] = true,
				},
			},
        },
    },
	[815] =
    {
        [819] = {
            {id = 819, cost = 1, x = 688, y = -38, z = -661, h = 0.96, b = 1027863
				, requires = {
					["GetQuestInfo(3291,'step') >= 4 or QuestCompleted(3291)"] = true,
				},
			},
        },
        [813] = {
            {id = 813, cost = 1, x = -616, y = 58, z = -675, h = -2.15
				, requires = {
					["QuestCompleted(3609)"] = true,
				},
			},
        },
    },
	[816] =
    {
        [813] = {
            {id = 813, cost = 1, x = -694, y = 112, z = 833, h = -0.24
				, requires = {
					["GetQuestInfo(3305,'step') == 255 or QuestCompleted(3305)"] = true,
				},
			},
        },
    },
	[817] =
    {
        [813] = {
            {id = 813, cost = 1, x = -811, y = 1, z = 743, h = -0.85},
        },
    },
	[818] =
    {
        [814] = {
            {id = 814, cost = 1, x = 261, y = 420, z = -885, h = -0.01, g = 2010635
				, requires = {
					["QuestCompleted(3647)"] = true,
				},
			},
        },
    },
	[819] =
    {
        [813] = {
            {id = 813, cost = 1, x = -241, y = -3, z = -0, h = -1.61},
        },
        [814] = {
            {id = 814, cost = 1, x = 61, y = 36, z = -169, h = -1.19, b = 1027225
				, requires = {
					["GetQuestInfo(3282,'step') == 255 or QuestCompleted(3282)"] = true,
				},
			},
        },
        [815] = {
            {id = 815, cost = 1, x = 60, y = 36, z = -171, h = -1.07, b = 1027264
				, requires = {
					["GetQuestInfo(3291,'step') >= 4 or QuestCompleted(3291)"] = true,
				},
			},
        },
        [844] = {
            {id = 844, cost = 1, x = 118, y = 14, z = 7, h = -1.61, b = 1027230
				, requires = {
					["QuestCompleted(3281)"] = true,
				},
			},
        },
    },
	[820] =
    {
        [814] = {
            {id = 814, cost = 1, x = 0, y = -17, z = -160, h = -3.13},
        },
    },
	[842] =
    {
        [156] = {
            {id = 156, cost = 1, x = -72, y = 6, z = 80, h = -0.5, g = 2010599},
        },
        [877] = {
            {id = 877, cost = 1, x = -52, y = 1.5, z = 39, h = 2.9, b = 1029797
                , requires = {
                    ["GetQuestInfo(3279,'step') >= 3 and GetQuestInfo(3279,'step') < 255"] = true,
                },
            },
        },
        [844] = {
            {id = 844, cost = 1, x = -52, y = 1.5, z = 39, h = 2.9, b = 1029804
                , requires = {
                    ["GetQuestInfo(3279,'step') >= 255 or QuestCompleted(3279)"] = true,
                },
            },
        },
    },
	[844] =
    {
        [842] = {
            {id = 842, cost = 1, x = 0, y = 0, z = -13, h = 0.00, g = 2010509},
        },
        [819] = {
            {id = 819, cost = 1, x = 0, y = 1, z = 14, h = -0.00, g = 2009758},
        },
    },
	[877] =
    {
        [842] = {
            {id = 842, cost = 1, x = 176, y = 5, z = 60, h = 2.9, b = 2010609
				, requires = {
					["GetQuestInfo(3279,'step') >= 3 or QuestCompleted(3279)"] = true,
				},
			},
        },
    },
}-- set reference for mesh mgr

ffxiv_aethercurrent_data = {
	[397] = {
		{ id = 6, aethid = 2005536, x = 402.058, y = 191.541, z = 561.445},
		{ id = 7, aethid = 2006186, x = 608.951, y = 88.1169, z = 186.118},
		{ id = 8, aethid = 2006187, x = 451.54, y = 171.227, z = -535.67},
		{ id = 9, aethid = 2006188, x = 84.7696, y = 87.159, z = -699.125},
		{ id = 10, aethid = 2006189, x = -438.927, y = 110.267, z = -740.026},
		{ id = 11, aethid = 2006190, x = 47.747, y = 196.606, z = -677.929},
		{ id = 12, aethid = 2006191, x = -575.219, y = 133.976, z = -196},
		{ id = 13, aethid = 2006192, x = 371.444, y = 165.494, z = 116.185},
		{ id = 14, aethid = 2006193, x = 148.119, y = 187.018, z = 232.186},
		{ id = 15, aethid = 2006194, x = -76.4965, y = 141.845, z = 600.819},
	},
	[398] = {
		{ id = 6, aethid = 2006195, x = 765.024, y = -15.7942, z = 289.11},
		{ id = 7, aethid = 2006196, x = 384.909, y = -41.6825, z = 74.2806},
		{ id = 8, aethid = 2006197, x = 707.74, y = -41.0985, z = -14.5569},
		{ id = 9, aethid = 2006198, x = 208.02, y = -36.5306, z = 3.51},
		{ id = 10, aethid = 2006199, x = 256.851, y = -104.576, z = 834.321},
		{ id = 11, aethid = 2006200, x = -143.666, y = -83.6647, z = 611.14},
		{ id = 12, aethid = 2006201, x = 18.6733, y = -25.8571, z = -103.857},
		{ id = 13, aethid = 2006202, x = -487.92, y = 223.904, z = -135.417},
		{ id = 14, aethid = 2006203, x = -662.597, y = -102.896, z = 680.747},
		{ id = 15, aethid = 2006204, x = 167.249, y = -4.21957, z = -479.439},
	},
	[399] = {
		{ id = 6, aethid = 2006205, x = 675.619, y = 135.767, z = 197.819},
		{ id = 7, aethid = 2006206, x = 744.64, y = 136.651, z = -50.3513},
		{ id = 8, aethid = 2006207, x = 34.4594, y = 52.6953, z = 33.2403},
		{ id = 9, aethid = 2006208, x = -236.357, y = 123.323, z = -218.483},
		{ id = 10, aethid = 2006209, x = -827.154, y = 163.863, z = -35.5453},
		{ id = 11, aethid = 2006210, x = -570.766, y = 147.104, z = 67.3139,
			requires = function () return QuestCompleted(1658) end,
		},  
		{ id = 12, aethid = 2006211, x = -854.555, y = 200.848, z = 531.08,
			requires = function () return QuestCompleted(1658) end,
		},  
		{ id = 13, aethid = 2006212, x = -85.2537, y = 202.54, z = 766.753,
			requires = function () return QuestCompleted(1658) end,
		},  
		{ id = 14, aethid = 2006213, x = 239.162, y = 101.922, z = 210.727,
			requires = function () return QuestCompleted(1658) end,
		},  
		{ id = 15, aethid = 2006214, x = -175.834, y = 201.45, z = 460.727,
			requires = function () return QuestCompleted(1658) end,
		},  
	},
	[400] = {
		{ id = 6, aethid = 2006215, x = 52.9045, y = -33.7666, z = -147.831},
		{ id = 7, aethid = 2006216, x = 421.189, y = -43.0455, z = 661.798},
		{ id = 8, aethid = 2006217, x = -115.066, y = 36.3944, z = 174.009},
		{ id = 9, aethid = 2006218, x = -775.238, y = 123.762, z = 243.706},
		{ id = 10, aethid = 2006219, x = -242.503, y = 40.9613, z = 275.764},
		{ id = 11, aethid = 2006220, x = -314.117, y = 81.6021, z = -90.216},
		{ id = 12, aethid = 2006221, x = -44.822, y = 81.8169, z = -110.67},
		{ id = 13, aethid = 2006222, x = 601.823, y = -9.46701, z = -336.299},
		{ id = 14, aethid = 2006223, x = 718.436, y = 34.9302, z = 177.179},
		{ id = 15, aethid = 2006224, x = -210.703, y = 160.491, z = -726.487},
	},
	[401] = {
		{ id = 6, aethid = 2006225, x = -595.001, y = -166.226, z = 582.444},
		{ id = 7, aethid = 2006226, x = 484.737, y = -142.446, z = 689.118},
		{ id = 8, aethid = 2006227, x = -505.577, y = -217.551, z = 329.869},
		{ id = 9, aethid = 2006228, x = 157.968, y = -177.266, z = 785.124, 
			requires = function () return QuestCompleted(1643) end,
		},
		{ id = 10, aethid = 2006229, x = -631.148, y = -59.0628, z = -159.611, 
			requires = function () return QuestCompleted(1643) end,
		},
		{ id = 11, aethid = 2006230, x = 180.448, y = 30.01, z = -471.095, 
			requires = function () return QuestCompleted(1643) end,
		},
		{ id = 12, aethid = 2006231, x = 486.183, y = 113.107, z = -185.697, 
			requires = function () return QuestCompleted(1643) end,
		},
		{ id = 13, aethid = 2006232, x = 64.1026, y = 150.499, z = -139.863, 
			requires = function () return QuestCompleted(1643) end,
		},
		{ id = 14, aethid = 2006233, x = 231.301, y = -82.111, z = 261.018, 
			requires = function () return QuestCompleted(1643) end,
		},
		{ id = 15, aethid = 2006234, x = 616.023, y = -65.5365, z = -111.587, 
			requires = function () return QuestCompleted(1643) end,
		},
	},
	[612] = {
		{ id = 6, aethid = 2007965, x = -487.266, y = 76.726, z = -249.561}, 
		{ id = 7, aethid = 2007966, x = -106.523, y = 60.6825, z = -847.99}, 
		{ id = 8, aethid = 2007967, x = 179.126, y = 78.0766, z = -517.449}, 
		{ id = 9, aethid = 2007968, x = -592.615, y = 49.9769, z = 320.851}, 
		{ id = 10, aethid = 2007969, x = -201.495, y = 20.9112, z = -316.213}, 
		{ id = 11, aethid = 2007970, x = 177.081, y = 54.5858, z = 237.14,
			requires = function () return QuestCompleted(2530) end,
		},  
		{ id = 12, aethid = 2007971, x = 322.591, y = 88.9832, z = 10.5134,
			requires = function () return QuestCompleted(2530) end,
		},  
		{ id = 13, aethid = 2007972, x = 715.328, y = 174.403, z = -236.652,
			requires = function () return QuestCompleted(2530) end,
		},  
		{ id = 14, aethid = 2007973, x = 410.574, y = 59.5974, z = 369.68,
			requires = function () return QuestCompleted(2530) end,
		},  
		{ id = 15, aethid = 2007974, x = 636.988, y = 78.4892, z = 430.167,
			requires = function () return QuestCompleted(2530) end,
		}, 
	},
	[613] = {
		{ id = 6, aethid = 2007995, x = 425.711, y = 16.9188, z = 870.146},
		{ id = 7, aethid = 2007996, x = -309.743, y = 0.7707, z = 846.158},
		{ id = 8, aethid = 2007997, x = -649.439, y = 22.1694, z = -610.925},
		{ id = 9, aethid = 2007998, x = -187.163, y = 6.84874, z = -698.442},
		{ id = 10, aethid = 2007999, x = 21.2863, y = 24.0112, z = -623.621},
		{ id = 11, aethid = 2008000, x = 502.068, y = 20.8987, z = -750.027},
		{ id = 12, aethid = 2008001, x = 62.4551, y = 6.47697, z = -877.501},
		{ id = 13, aethid = 2008002, x = 703.914, y = 38.2971, z = -46.6163},
		{ id = 14, aethid = 2008003, x = 499.016, y = 7.585, z = 180.011},
		{ id = 15, aethid = 2008004, x = -676.918, y = 27.4336, z = 374.133,
			requires = function () return QuestCompleted(2484) end,
		},  -- swim required
	},
	[614] = {
		{ id = 6, aethid = 2008005, x = 894.499, y = 157.256, z = -38.285},
		{ id = 7, aethid = 2008006, x = 384.296, y = 80.8301, z = -230.307},
		{ id = 8, aethid = 2008007, x = 497.337, y = 16.3552, z = 402.518},
		{ id = 9, aethid = 2008008, x = 162.005, y = 144.57, z = -11.5206},
		{ id = 10, aethid = 2008009, x = 417.676, y = 89.1245, z = 98.7672},
		{ id = 11, aethid = 2008010, x = 159.25, y = 4.6722, z = 471.467},
		{ id = 12, aethid = 2008011, x = 457.528, y = 32.3773, z = 822.43},
		{ id = 13, aethid = 2008012, x = -267.323, y = 47.6668, z = 397.177},
		{ id = 14, aethid = 2008013, x = -86.3203, y = 9.20952, z = 561.456},
		{ id = 15, aethid = 2008014, x = -491.444, y = 68.8427, z = 315.036},
	},
	[620] = { 
		{ id = 6, aethid = 2007975, x = -481.468, y = 57.8362, z = -780.026},
		{ id = 7, aethid = 2007976, x = 261.372, y = 126.251, z = -725.399},
		{ id = 8, aethid = 2007977, x = 711.269, y = 262.499, z = -489.83},
		{ id = 9, aethid = 2007978, x = -283.07, y = 127.531, z = -225.757},
		{ id = 10, aethid = 2007979, x = 302.01, y = 197.673, z = -31.2851},
		{ id = 11, aethid = 2007980, x = -661.982, y = 275.228, z = 553.795,
			requires = function () return HasQuest(2534) or QuestCompleted(2534) end,
		}, 
		{ id = 12, aethid = 2007981, x = -532.463, y = 304.567, z = 250.42,
			requires = function () return HasQuest(2534) or QuestCompleted(2534) end,
		}, 
		{ id = 13, aethid = 2007982, x = -238.025, y = 267.843, z = 523.064,
			requires = function () return HasQuest(2534) or QuestCompleted(2534) end,
		}, 
		{ id = 14, aethid = 2007983, x = -13.8095, y = 302.219, z = 28.1528,
			requires = function () return QuestCompleted(2537) end,
		},  -- gated
		{ id = 15, aethid = 2007984, x = 120.256, y = 305.38, z = 521.141,
			requires = function () return QuestCompleted(2537) end,
		},   -- gated
	},
	[621] = { 
		{ id = 6, aethid = 2007985, x = -641.962, y = 64.3077, z = -291.188},
		{ id = 7, aethid = 2007986, x = -321.515, y = 51.7777, z = -456.407},
		{ id = 8, aethid = 2007987, x = -355.612, y = 25.0425, z = 12.3751},
		{ id = 9, aethid = 2007988, x = 673.579, y = 111.8, z = -712.49},
		{ id = 10, aethid = 2007989, x = 51.2245, y = -0.001, z = -254.17},
		{ id = 11, aethid = 2007990, x = -173.5, y = 31.265, z = 475.097},
		{ id = 12, aethid = 2007991, x = -405.448, y = 204.199, z = 740.993},
		{ id = 13, aethid = 2007992, x = 109.608, y = 42.0051, z = 788.66},
		{ id = 14, aethid = 2007993, x = 400.626, y = 116.789, z = 69.962},
		{ id = 15, aethid = 2007994, x = 675.776, y = 83.0, z = 508.537,
			requires = function () return QuestCompleted(2550) end,
		},  
	},
	[622] = {
		{ id = 6, aethid = 2008015, x = 624.332, y = -34.9395, z = 458.625},
		{ id = 7, aethid = 2008016, x = 742.701, y = -2.0423, z = -194.929},
		{ id = 8, aethid = 2008017, x = 282.856, y = 81.4797, z = -458.915},
		{ id = 9, aethid = 2008018, x = -267.346, y = 64.9846, z = -361.471},
		{ id = 10, aethid = 2008019, x = 105.608, y = 116.043, z = -49.6987, 
			requires = function () return QuestCompleted(2507) end,
		}, 
		{ id = 11, aethid = 2008020, x = -410.025, y = 29.8629, z = -28.8243},
		{ id = 12, aethid = 2008021, x = -775.098, y = 13.7657, z = 347.003},
		{ id = 13, aethid = 2008022, x = -641.034, y = 6.11269, z = 702.88},
		{ id = 14, aethid = 2008023, x = -305.288, y = 18.9369, z = 648.576},
		{ id = 15, aethid = 2008024, x = 106.096, y = -11.2446, z = 386.191},
	},
}

ffxiv_aetheryte_data = {
	[132] = {
		{id = 132, aethid = 2, x = 30.390216827393, y = 1.8258748054504, z = 26.265508651733},
	},
	[148] = {
		{id = 148, aethid = 3, x = 13.585005760193, y = -1.1827243566513, z = 41.725193023682},
	},
	[152] = {
		{id = 152, aethid = 4, x = -189.0665435791, y = 4.4424576759338, z = 293.23275756836},
	},
	[153] = {
		{id = 153, aethid = 5, x = 181.93789672852, y = 8.6657190322876, z = -66.213958740234},
		{id = 153, aethid = 6, x = -226.1929473877, y = 21.010675430298, z = 355.90420532227},
	},
	[154] = {
		{id = 154, aethid = 7, x = -45.544578552246, y = -39.256271362305, z = 230.90368652344},
	},
	[129] = {
		{id = 129, aethid = 8, x = -85.681526184082, y = 18.800333023071, z = -6.4848699569702},
	},
	[130] = {
		{id = 130, aethid = 9, x = -141.2413, y = -3.154881, z = -166.22462},
	},
	[135] = {
		{id = 135, aethid = 10, x = 156.93988037109, y = 14.09584903717, z = 668.01940917969},
	},
	[137] = {
		{id = 137, aethid = 11, x = 490.56713867188, y = 17.416807174683, z = 474.01110839844},
		{id = 137, aethid = 12, x = -20.159227371216, y = 70.599250793457, z = 7.4133810997009},
	},
	[138] = {
		{id = 138, aethid = 13, x = 652.9736328125, y = 9.2408666610718, z = 509.41586303711},
		{id = 138, aethid = 14, x = 259.89932250977, y = -22.75, z = 223.38513183594},
	},
	[139] = {
		{id = 139, aethid = 15, x = 433.61944580078, y = 3.6090106964111, z = 92.736114501953},
	},
	[180] = {
		{id = 180, aethid = 16, x = -122.27465820313, y = 64.79615020752, z = -211.87341308594},
	},
	[140] = {
		{id = 140, aethid = 17, x = 71.629104614258, y = 45.432174682617, z = -230.00273132324},
	},
	[145] = {
		{id = 145, aethid = 18, x = -379.7414855957, y = -59, z = 142.57489013672},
	},
	[146] = {
		{id = 146, aethid = 19, x = -165.46360778809, y = 26.138355255127, z = -414.46130371094},
		{id = 146, aethid = 20, x = -321.84567260742, y = 8.2604389190674, z = 406.19985961914},
	},
	[147] = {
		{id = 147, aethid = 21, x = 21.909135818481, y = 6.9785833358765, z = 458.83193969727},
		{id = 147, aethid = 22, x = -24.236480712891, y = 48.309478759766, z = -27.79927444458},
	},
	[155] = {
		{id = 155, aethid = 23, x = 227.28480529785, y = 312, z = -229.6822052002},
	},
	[156] = {
		{id = 156, aethid = 24, x = 48.166370391846, y = 20.295000076294, z = -667.26159667969},
	},
	[134] = {
		{id = 134, aethid = 52, x = 224.27067565918, y = 113.09999084473, z = -261.05822753906},
	},
	[141] = {
		{id = 141, aethid = 53, x = -15.56315612793, y = -1.8785282373428, z = -169.75825500488},
	},
	[418] = {
		{id = 418, aethid = 70, x = -68.819107055664, y = 8.1133041381836, z = 46.482696533203},
	},
	[397] = {
		{id = 397, aethid = 71, x = 477.33963012695, y = 213.68281555176, z = 712.01037597656},
	},
	[401] = {
		{id = 401, aethid = 72, x = -611.17010498047, y = -122.47959899902, z = 545.20111083984},
		{id = 401, aethid = 73, x = -613, y = -49.5, z = -415, 
			requires = function () return QuestCompleted(1643) end,
		},
	},
	[402] = {
		{id = 402, aethid = 74, x = -719.61926269531, y = -186.96055603027, z = -591.29595947266},
	},
	[478] = {
		{id = 478, aethid = 75, x = 70.658157348633, y = 209.25, z = -15.381930351257},
	},
	[398] = {
		{id = 398, aethid = 76, x = 533.27545166016, y = -50.119258880615, z = 35.244457244873},
		{id = 398, aethid = 77, x = -300.9377746582, y = -21.131076812744, z = 30.079961776733},
	},
	[399] = {
		{id = 478, aethid = 75, x = 70.658157348633, y = 209.25, z = -15.381930351257},
	},
	[400] = {
		{id = 400, aethid = 78, x = 256.49853515625, y = -41.158931732178, z = 599.15924072266},
		{id = 400, aethid = 79, x = -583.82263183594, y = 49.774040222168, z = 316.41677856445},
	},
	[144] = {
		{id = 144, aethid = 62, x = 3.3, y = 1.04, z = -2.98},
	},
	[250] = {
		{id = 250, aethid = 55, x = 40.9, y = 5.4, z = -14.9},
	},
	[635] = {
		{id = 635, aethid = 104, x = 77.099, y = 0, z = 92.986},
	},
	[612] = {
		{id = 612, aethid = 98, x = -629.11, y = 132.89, z = -509.15},
		{id = 612, aethid = 99, x = 417.77, y = 114.27, z = 240.70,
			requires = function () return QuestCompleted(2530) end,
		},
	},
	[613] = {
		{id = 613, aethid = 106, x = 90.50, y = 3.03, z = -587.47},
		{id = 613, aethid = 105, x = 365.97, y = -117.95, z = -263.31, 
			requires = function () return QuestCompleted(2482) end,
		},
	},
	[614] = {
		{id = 614, aethid = 107, x = 432.43, y = 68.81, z = -85.83},
		{id = 614, aethid = 108, x = 241.02, y = 5.08, z = -402.3, 
			requires = function () return QuestCompleted(2518) end,
		},
	},
	[620] = {
		{id = 620, aethid = 100, x = 114.58, y = 120.10, z = -747.07},
		{id = 620, aethid = 101, x = -272.97, y = 258.03, z = 746.08,
			requires = function () return QuestCompleted(2534) end,
		},
	},
	[621] = {
		{id = 621, aethid = 102, x = -653.27, y = 50.50, z = -12.33
			, requires = {
					["GetQuestInfo(2548,'step') >= 3 or QuestCompleted(2548)"] = true,
			},
		},
		{id = 621, aethid = 103, x = 616.35, y = 81.39, z = 657.47,
			requires = function () return QuestCompleted(2550) end,
		},
	},
	[622] = {
		{id = 622, aethid = 109, x = 555.07, y = -19.51, z = 346.61, 
			requires = function () return QuestCompleted(2630) end,
		},
		{id = 622, aethid = 110, x = 71.34, y = 114.90, z = 36.01, 
			requires = function () return QuestCompleted(2507) end,
		},
	},
	[628] = {
		{id = 628, aethid = 111, x = 45.89, y = 4.20, z = -40.59},
	},
	[759] = {
		{id = 759, aethid = 127, x = 42.65, y = 1.42, z = -14.88},
	},
	[813] = {
		{id = 813, aethid = 132, x = 753, y = 24, z = -28.8},
		{id = 813, aethid = 136, x = -735, y = 53, z = -230},
	},
	[814] = {
		{id = 814, aethid = 137, x = 668, y = 29, z = 289},
		{id = 814, aethid = 138, x = -244, y = 20, z = 385},
		{id = 814, aethid = 139, x = -431, y = 417, z = -618, 
			requires = function () return QuestCompleted(3634) end,
		},
	},
	
	[815] = {
		{id = 815, aethid = 140, x = 246, y = 13, z = -220},
		{id = 815, aethid = 141, x = -499, y = 45, z = -210, 
			requires = function () return QuestCompleted(3609) end,
		},
		{id = 815, aethid = 161, x = 399, y = -24, z = 307},
	},
	[816] = {
		{id = 816, aethid = 144, x = -355, y = 46, z = 482, 
			requires = function () return QuestCompleted(3305) end,
		},
		{id = 816, aethid = 145, x = -72, y = 103, z = -857, 
			requires = function () return QuestCompleted(3313) end,
		},
		{id = 816, aethid = 146, x = 380, y = 87, z = -687, 
			requires = function () return QuestCompleted(3313) end,
		},
	},
	[817] = {
		{id = 817, aethid = 142, x = -103, y = -19, z = 297},
		{id = 817, aethid = 143, x = 382, y = 21, z = -194, 
			requires = function () return QuestCompleted(3338) end,
		},
	},
	[818] = {
		{id = 818, aethid = 147, x = 561, y = 352, z = -199},
		{id = 818, aethid = 148, x = -141, y = -280, z = 218, 
			requires = function () return QuestCompleted(3652) end,
		},
	},
	[819] = {
		{id = 819, aethid = 133, x = -65, y = 4, z = 0},
	},
	[820] = {
		{id = 820, aethid = 134, x = 0, y = 82, z = 0, 
			requires = function () return QuestCompleted(3631) end,
		},
	},
}	

function ffxiv_map_nav.GetAetherytes()
	local list = {}
	
	local data = ffxiv_aetheryte_data
	if (table.valid(data)) then
		for mapid,aetherytes in pairs(data) do
			if (table.valid(aetherytes)) then
				for i,aetheryte in pairs(aetherytes) do
					list[aetheryte.aethid] = true
				end
			end
		end
	end
	
	return list
end

ffxiv_map_nav.list = ffxiv_map_nav.GetAetherytes()

function ffxiv_map_nav.IsAetheryte(id)
	return ffxiv_map_nav.list[id] ~= nil
end

function ffxiv_map_nav.IsAethernet(id)
	return ffxiv_map_nav.list[id] == nil
end

function ffxiv_map_nav.SetupNavNodes()
	ml_nav_manager.nodes = {}
    for id, neighbors in pairs(ffxiv_map_nav.data) do
		local node = ml_node:Create()
		if (ValidTable(node)) then
			node.id = id
			for nid, posTable in pairs(neighbors) do
				node:AddNeighbor(nid, posTable)
			end
			ml_nav_manager.AddNode(node)
		end
	end
end

ffxiv_map_nav.SetupNavNodes()
