ffxiv_map_nav = {}
ffxiv_map_nav.data = {
	[144] = 
	{
		[130] = {
			{id = 130, cost = 3, x = -38.920, y = 0.025, z = 98.243, h = 1, a = 1011022, i = 1 
				, requires =  {
					["QuestCompleted(435)"] = true,
					["CanUseAirship()"] = true,
				}
				, conversationstrings = {
                   ["E"] = "Seek Passage to Ul'dah",
                   ["J"] = "「ウルダハ」へ行く",
                   ["G"] = "Nach Ul'dah",
                   ["F"] = "Aller à Ul'dah",
                   ["CN"] = "前往乌尔达哈",
                   ["KR"] = "'울다하'로 이동",
                },
			},
		},
		[132] = {
			{id = 132, cost = 3, x = -38.920, y = 0.025, z = 98.243, h = 1, a = 1011022, i = 2 
				, requires =  {
					["QuestCompleted(435)"] = true,
					["CanUseAirship()"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Purchase Passage to Gridania",
                    ["J"] = "「グリダニア」へ行く",
                    ["G"] = "Nach Gridania",
                    ["F"] = "Aller à Gridania",
                    ["CN"] = "前往格里达尼亚",
                    ["KR"] = "'그리다니아'로 이동",
                },
			},
		},
		[128] = {
			{id = 128, cost = 3, x = -38.920, y = 0.025, z = 98.243, h = 1, a = 1011022, i = 3 
				, requires =  {
					["QuestCompleted(435)"] = true,
					["CanUseAirship()"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Purchase Passage to Limsa Lominsa",
                    ["J"] = "「リムサ・ロミンサ」へ行く",
                    ["G"] = "Nach Limsa Lominsa",
                    ["F"] = "Aller à Limsa Lominsa",
                    ["CN"] = "前往利姆萨·罗敏萨",
                    ["KR"] = "'림사 로민사'로 이동",
                },
			},
		},
		[388] = {
			{id = 388, cost = 3, x = -83.325, y = 0.0442, z = 29.0272, h = -1.597130, a = 1011044},
		},
		[419] = {
			{id = 419, cost = 3, x = -38.920, y = 0.025, z = 98.243, h = 1, a = 1011022, i = 4
				, requires =  {
					["QuestCompleted(1664)"] = true,
				}
				, conversationstrings = {
					["E"] = "Purchase Passage to Ishgard",
					["J"] = "「イシュガルド」へ行く",
					["G"] = "Nach Ishgard",
					["F"] = "Aller à Ishgard",
					["CN"] = "前往伊修加德",
					["KR"] = "'이슈가르드'로 이동",
                },
			},
		},
	},
	[388] =
	{
		[144] = {
			{id = 144, cost = 3, x = 2.4002, y = 0, z = 11.271, h = -1.597130, a = 1010489},
		},
	},
	[535] =
	{
		--uldah barracks to uldah
		[130] = {
			{id = 130, cost = 1, x = -0.01, y = 0.99, z = 12.49, h = 1, a = 2007530,},
		},	
	},		
	[130] = 
	{	
		[535] = {
			--uldah to uldah barracks 
			{id = 535, cost = 1, x = -153.30, y = 5.23, z = -98.03, h = 1, a = 2007529,},
		},		
		[128] = {
			{id = 128, cost = 3, x = -22.364, y = 83.199, z = -4.82, h = 1, a = 1004433, i = 2 
				, requires =  {
					["CanUseAirship()"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Purchase Passage to Limsa Lominsa",
                    ["J"] = "「リムサ・ロミンサ」へ行く",
                    ["G"] = "Nach Limsa Lominsa",
                    ["F"] = "Aller à Limsa Lominsa",
                    ["CN"] = "前往利姆萨·罗敏萨",
                    ["KR"] = "'림사 로민사'로 이동",
                },
			},
		},
		[131] = {
			{id = 131, cost = 1, x = -120.054825,	z = -8.766253,		y = 10.031486, 	h = 1.575879},
			{id = 131, cost = 1, x = -119.854446,	z = 9.584025,		y = 9.999928,	h = 1.596821},
			{id = 131, cost = 1, x = 94.658661,		z = -108.452988,	y = 4.000000,	h = 0.847061},
			{id = 131, cost = 1, x = 60.834011,		z = -85.825699,		y = 8.000000,	h = 0.780104},
			{id = 131, cost = 1, x = -11.271012,	z = -40.652363,		y = 10.000000,	h = 0.174165},
		},
		[132] = {
			{id = 132, cost = 3, x = -22.364, y = 83.199, z = -4.82, h = 1, a = 1004433, i = 1 
				, requires =  {
					["CanUseAirship()"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Purchase Passage to Gridania",
                    ["J"] = "「グリダニア」へ行く",
                    ["G"] = "Nach Gridania",
                    ["F"] = "Aller à Gridania",
                    ["CN"] = "前往格里达尼亚",
                    ["KR"] = "'그리다니아'로 이동",
                },
			},
		},
		[140] = {
			{id = 140, cost = 3, x = -180.163864,	z = -14.053099,	    y = 14.000000,	h = -1.597130},
		},
		[141] = {
			{id = 141, cost = 3, x = 43.772938,		z = -163.789337,	y = 3.999976,	h = 2.879770},
		},
		[144] = {
			{id = 144, cost = 3, x = -22.364, y = 83.199, z = -4.82, h = 1, a = 1004433, i = 3 
				, requires =  {
					["QuestCompleted(435)"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Seek Passage to the Gold Saucer",
                    ["J"] = "「ゴールドソーサー」へ行く",
                    ["G"] = "Zum Gold Saucer",
                    ["F"] = "Aller au Gold Saucer",
                    ["CN"] = "前往金碟游乐场",
                    ["KR"] = "'골드 소서'로 이동",
                },
			},
		},
		[178] = {
			{id = 178, cost = 1, x = 29.635, y = 7.000, z = -80.346, h = -0.131, b = 1001976, i = 1 },
		},
	},
	[178] =
	{
		[130] = {
			{id = 130, cost = 1, x = -0.04, y = -0.00, z = 7.00, h = 0.01, g = 2001011},
		},
	},
	[131] = 
	{
		[130] = {
			{id = 130, cost = 1, x = 64.644173,		z = -82.809769,		y = 8.000000, 	h = -2.319770},
			{id = 130, cost = 1, x = 92.698357,		z = -110.785194,	y = 4.000000,	h = -2.242315},
			{id = 130, cost = 1, x = -8.388394,		z = -32.459148,		y = 10.576365,	h = -2.864407},
			{id = 130, cost = 1, x = -110.161224,	z = 9.562051,		y = 7.000000,	h = -1.586749},
			{id = 130, cost = 1, x = -110.437424,	z = -8.940209,		y = 7.011384,	h = -1.549050},
		},
		[141] = {
			{id = 141, cost = 3, x = 163.689270,	z = 43.879639,	    y = 3.999968, 	h = 1.268068},
		},
		[210] = {
			{id = 210, cost = 1, x =-123.859, y = 39.9998, z = 95.4089, h = 0, g = 1004005, i = 1},
		},
		[971] = {
			{id = 971, cost = 3, x = 115, y = 8, z = 8, b = 1036632
				, requires =  {
					["HasQuest(4073) or QuestCompleted(4073)"] = true,
				},
			},
		},
	},
	[140] = 
	{
		[129] = {
			{id = 129, cost = 3, x = -486.74, y = 23.99, z = -331.675, h = -2, b = 1004037
				, requires =  {
					["Player.level >= 12"] = true,
					["CanUseAirship()"] = true,
				},
			},
		},
		[141] = {
			{id = 141, cost = 5, x = 261.533295,	z = -9.452567,	    y = 53.309750, 	h = 2.670389},
		},
		[341] = {
			{id = 341, cost = 5, x = 317.43,	z = 236.260666,	    y = 67.180557,	h = -0.030786, r = true
				--, requires = {
					--["QuestCompleted(1213)"] = true,
				--},
			},
		},
		[130] = {
			{id = 130, cost = 3, x = 471.744293,	z = 159.596161,	    y = 96.620567,	h = 1.362059
				, requires =  {
					["Player.level >= 12"] = true,
					["CanUseAirship()"] = true,
				},
			},
		},
		[212] = {
			{id = 212, cost = 5, x = -482.076,		z = -387.232,		y = 17.075,		h = 1.394, 	g = 2001711},
		},
	},
	[341] = 
	{
		[140] = {
			{id = 140, cost = 5, x = -10.554447,	z = -197.729034,	y = -11.076664,	h = -2.267869, rx = true
				--, requires = {
					--["QuestCompleted(1213)"] = true,
				--},
			},
		},
	},
	[141] = 
	{
		[130] = {
			{id = 130, cost = 3, x = -116.704605,	z = 339.036774,	    y = 18.374495,	h = -0.296405},
		},
		[131] = {
			{id = 131, cost = 3, x = 13.381968,	    z = 563.856323,	    y = 18.375681,	h = -1.863721},
		},
		[140] = {
			{id = 140, cost = 5, x = -406.028320,	z = 98.055061,	    y = -1.327996,	h = -1.252450},
		},
		[145] = {
			{id = 145, cost = 5, x = 450.149078,	z = -179.656448,	y = -17.999840,	h = 2.399650},
		},
		[146] = {
			{id = 146, cost = 5, x = 232.728973,	z = 674.237854,	    y = 2.753296,	h = 0.907127},
		},
		[147] = {
			{id = 147, cost = 5, x = -27.951309,	z = -494.383026,	y = 33.000000,	h = 3.133206},
		},
	},
	[145] = 
	{
		[153] = {
			{id = 153, cost = 5, x = 369.957184,	z = -296.594879,	y = 32.385502,	h = 2.514460},
		},
		[146] = {
			{id = 146, cost = 5, x = -169.531570,	z = 489.810608,	    y = -46.311321,	h = 0.533979},
		},
		[141] = {
			{id = 141, cost = 5, x = -564.688477,	z = 340.296539,	    y = -19.019501,	h = -0.745622},
		},		
	},
	[146] = 
	{
		[141] = {
			{id = 141, cost = 5, x = -427.950775,	z = -426.944122,	y = 12.862315,	h = -2.438309},
		},
		[145] = {
			{id = 145, cost = 5, x = -28.638260,	z = -767.939148,	y = 17.150595,	h = -3.138837},
		},
	},
	[147] = 
	{
		[141] = {
			{id = 141, cost = 5, x = 36.747425,	    z = 512.867920,	    y = 6.114986,	h = 0.016709},
		},
		[146] = {
			{id = 156, cost = 5, x = -96.634842,	z = -415.727081,	y = 84.427101,	h = 2.398999},
		},
	},
	[156] = 
	{
		[147] = {
			{id = 147, cost = 5, x = -419.502350,	z = -116.779129,	y = -3.216816,	h = 0.353663},
		},
		[155] = {
			{id = 155, cost = 5, x = 124.911911,	z = -770.00,	y = 31.45,	h = 2.35},
		},
		[351] = {
			{id = 351, cost = 5, x = 21.12418,	y = 21.25272, z = -631.3731, h = 0.103,	g = 2002881},
		},
		[418] = {
			{id = 418, cost = 5, x = -162.28, y = 304.56, z = -329.25, h = -2.80, b = 1012149
				, requires =  {
					["QuestCompleted(1580)"] = true,
				}
			},
		},
		[842] = {
			{id = 842, cost = 1, x = 351, y = -26, z = -370, h = 3.13, b = 1029828 -- 5.1 changed id
				, requires =  {
					["GetQuestInfo(3279,'step') > 1 or QuestCompleted(3279)"] = true,
				}
			},
		},
	},
	[534] = {
		--grid barracks to gridania
		[132] = {
			{id = 132, cost = 1, x = -0.01, y = 0.99, z = 11.73, h = 1, a = 2006963,},
		},			
	},	
	[132] =
	{
		[534] = {
		--gridania barracks
			{id = 534, cost = 1, x = -80.21, y = 0.47, z = -7.00, h = 1, a = 2006962,},
		},	
		[133] = {
			{id = 133, cost = 1, x = 100.587738,	z = 15.518513,	    y = 4.958726,	h = 2.319835},
			{id = 133, cost = 1, x = 11.472159,	    z = -13.339621,  	y = 1.167319,	h = 2.703871},
			{id = 133, cost = 1, x = -104.582939,	z = 9.293154,	    y = 1.157480,	h = -2.935570},
		},
		[148] = {
			{id = 148, cost = 5, x = 154.172577,	z = 157.515976,	    y = -12.851933,	h = 1.553804},
		},
		[130] = {
			{id = 130, cost = 3, x = 29.1025, y = -19.000, z = 102.408, h = 1, a = 1000106, i = 1
				, requires =  {
					["CanUseAirship()"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Purchase Passage to Ul'dah",
                    ["J"] = "「ウルダハ」へ行く",
                    ["G"] = "Nach Ul'dah",
                    ["F"] = "Aller à Ul'dah",
                    ["CN"] = "前往乌尔达哈",
                    ["KR"] = "'울다하'로 이동",
                },
			},
		},
		[128] = {
			{id = 128, cost = 3, x = 29.1025, y = -19.000, z = 102.408, h = 1, a = 1000106, i = 2 
				, requires =  {
					["CanUseAirship()"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Purchase Passage to Limsa Lominsa",
                    ["J"] = "「リムサ・ロミンサ」へ行く",
                    ["G"] = "Nach Limsa Lominsa",
                    ["F"] = "Aller à Limsa Lominsa",
                    ["CN"] = "前往利姆萨·罗敏萨",
                    ["KR"] = "'림사 로민사'로 이동",
                },
			},
		},
		[144] = {
			{id = 144, cost = 3, x = 29.1025, y = -19.000, z = 102.408, h = 1, a = 1000106, i = 3 
				, requires =  {
					["QuestCompleted(435)"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Seek Passage to the Gold Saucer",
                    ["J"] = "「ゴールドソーサー」へ行く",
                    ["G"] = "Zum Gold Saucer",
                    ["F"] = "Aller au Gold Saucer",
                    ["CN"] = "前往金碟游乐场",
                    ["KR"] = "'골드 소서'로 이동",
                },
			},
		},
		[179] = {
			{id = 179, cost = 1, x = 25.977, y = -8, z = 100.151, h = -1.760, b = 1000102, i = 1 },
		},
		[204] = {
			{id = 204, cost = 1, x = 232, y = 1.90, z = 45.5, h = 1.16, b = 1000423, i = 1},
		},
	},
	[204] =
	{
		[132] = {
			{id = 132, cost = 1, x = 0, y = 1, z = 9.8, h = 0, g = 2001215},
		},
	},
	[179] =
	{
		[132] = {
			{id = 132, cost = 1, x = 0.04, y = 0.00, z = 6.77, h = -0.03, g = 2000087},
		},
	},
	[351] = 
	{
		[156] = {
			{id = 156, cost = 5, x = 0.04466, z = 27.38899,	y = 2.0534,	 h = 0.00209,	g = 2002879},
		},
	},
	[133] =
	{
		[132] = {
			{id = 132, cost = 1, x = 140.014786,	z = -21.999306,	    y = 11.062968,	h = -0.824087},
			{id = 132, cost = 1, x = 14.614426,	    z = -88.333893,	    y = 8.351574,	h = -0.629290},
			{id = 132, cost = 1, x = -129.454391,	z = -36.090492,  	y = 5.504999,	h = 1.396102},
		},
		[152] = {
			{id = 152, cost = 3, x = 179.866, y = -2.239, z = -241.585, h = 1, b = 1001263, i = 1
				, requires =  {
					["Player.level >= 10"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Purchase Passage to Sweetbloom Pier",
                    ["J"] = "「花蜜桟橋」へ行く",
                    ["G"] = "Zum Honigblumen-Steg",
                    ["F"] = "Aller à la jetée du Bouquet",
                    ["CN"] = "前往花蜜栈桥",
                    ["KR"] = "'꽃꿀 나루'로 이동",
                },
			},
		},
		[154] = {
			{id = 154, cost = 5, x = -207.365845,	z = -95.740646,	    y = 10.368533,	h = -1.571268},
		},
		[205] = {
			{id = 205, cost = 1, x = -159.5, y = 4, z = -4.199, h = -.836, b = 1000460},
		},
	},
	[205] =
	{
		[133] = {
			{id = 133, cost = 1, x = 45.799, y = 7.699, z = 47.400, h = 0, g = 2001216},
		},
	},
	[148] =
	{
		[132] = {
			{id = 132, cost = 5, x = 127.973625,	z = -315.603302,    y = 25.274239,	h = 3.113573},
		},
		[152] = {
			{id = 152, cost = 5, x = 385.957275,	z = -184.674515,    y = -3.278250,	h = 2.149688},
		},
		[153] = {
			{id = 153, cost = 5, x = 159.596100,	z = 550.260925,	    y = -23.807894,	h = -0.010091},
		},
		[154] = {
			{id = 154, cost = 5, x = -501.604462,	z = -355.052673,	y = 74.197563,	h = 3.075810
				, requires =  {
					["Player.level >= 25"] = true,
					["CanUseAirship()"] = true,
				},
			},
		},
		[340] = {
			{id = 340, cost = 5, x = 199,	z = 324.05,	    y = -32.05,	h = 1.83, g = 1005656, r = true
				--, requires = {
					--["QuestCompleted(1212)"] = true,
				--},
			},
		},
	},
	[340] = {
		[148] = {
			{id = 148, cost = 5, x = 10.75,	z = 206.67,	    y = 2.61,	h = 0.36, g = 1005655, rx = true
				--, requires = {
					--["QuestCompleted(1212)"] = true,
				--},
			},
		},
	},
	[152] =
	{
		[133] = {
			{id = 133, cost = 3, x = -575.629, y = 8.274, z = 74.9197, h = 1, b = 1000541, i = 1
				, requires =  {
					["Player.level >= 10"] = true,
				},
			},
		},
		[148] = {
			{id = 148, cost = 5, x = -515.380066,	z = 276.312958,	    y = 18.856667,	h = 0.029517},
		},
		[153] = {
			{id = 153, cost = 5, x = -161.377731,	z = 450.613647,	    y = 4.327631,	h = 1.632315},
		},
		[612] = {
			{id = 612, cost = 1, x = 26.93, y = 6.18, z = 401.05, h = 0, b = 1021535
				, requires =  {
					["QuestCompleted(2446)"] = true,
				},
			},
		},
	},
	[153] =
	{
		[148] = {
			{id = 148, cost = 5, x = -368.008545,	z = -243.654633,	y = 29.841984,	h = -2.376045},
		},
		[152] = {
			{id = 152, cost = 5, x = 276.864288,	z = -259.381195,	y = 11.068289,	h = 2.220435},
		},
		[145] = {
			{id = 145, cost = 5, x = -285.880859,	z = 696.760864,	 y = -0.202368,	h = -0.557287},
		},
	},
	[154] =
	{
		[133] = {
			{id = 133, cost = 5, x = 454.377014, z = 194.206085, y = -1.377332,	h = 2.202893},
		},
		[148] = {
			{id = 148, cost = 5, x = 18.537865,	z = 531.396240,	 y = -54.870895, h = 0.723304
				, requires =  {
					["Player.level >= 25"] = true,
					["CanUseAirship()"] = true,
				},
			},
		},
		[155] = {
			{id = 155, cost = 5, x = -369.235107, z = 189.336166, y = -5.984657, h = -2.549946},
		},
	},
	[155] =
	{
		[154] = {
			{id = 154, cost = 5, x = 9.579012,		z = 580.486389,	  	y = 183.084641,	h = 0.293345},
		},
		[156] = {
			{id = 156, cost = 5, x = -221.167343,	z = 702.521790,	    y = 217.634018,	h = 0.803411
				, requires = {
					["GetPatchLevel() < 5.3"] = true,
				},
			},
			{id = 156, cost = 5, x = -221.167343,	z = 706.521790,	    y = 217.634018,	h = 0.703411
				, requires = {
					["GetPatchLevel() >= 5.3"] = true,
				},
			},
		},
		[395] = {
			{id = 395, cost = 5, x = 264.9519,	y = 302.2564,    z = -223.5088,	h = 3.1356,	b = 1009973 },
		},
		[418] = {
			{id = 418, cost = 5, x = -163.6195,	y = 304.1538,    z = -332.2256,	h = -2.4607, b = 1012149
				, requires =  {
					["QuestCompleted(428)"] = true,
				},
			},
		},
	},
	[536] =
	{
		--limsa barracks to upper limsa
		[128] = {
			{id = 128, cost = 1, x = -0.01, y = 0.99, z = 11.94, h = 1, a = 2007528,},
		},	
	},	
	[128] =
	{
		[536] = {
			--upper limsa to limsa barracks 
			{id = 536, cost = 1, x = 98.00, y = 41.27, z = 62.79, h = 1, a = 2007527,},
		},		
		[129] = {
			{id = 129, cost = 1, x = -5.868670,	    z = -27.703053,	    y = 43.095970,	h = -1.319617},
			{id = 129, cost = 1, x = -72.385811,	z = -122.175789,	y = 39.727707,	h = -0.803213},
			{id = 129, cost = 1, x = -94.809868,	z = 103.263062,	    y = 35.500000,	h = -2.218227},
		},
		[135] = {
			{id = 135, cost = 5, x = 24.692057,	    z = 180.197906,	    y = 44.499928,	h = 0.009527},
		},
		[130] = {
			{id = 130, cost = 3, x = -23.511, y = 91.99, z = -3.719, h = 1, a = 1002695, i = 1 
				, requires = {
					["CanUseAirship()"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Purchase Passage to Ul'dah",
                    ["J"] = "「ウルダハ」へ行く",
                    ["G"] = "Nach Ul'dah",
                    ["F"] = "Aller à Ul'dah",
                    ["CN"] = "前往乌尔达哈",
                    ["KR"] = "'울다하'로 이동",
                },
			},
		},
		[132] = {
			{id = 132, cost = 3, x = -23.511, y = 91.99, z = -3.719, h = 1, a = 1002695, i = 2 
				, requires = {
					["CanUseAirship()"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Purchase Passage to Gridania",
                    ["J"] = "「グリダニア」へ行く",
                    ["G"] = "Nach Gridania",
                    ["F"] = "Aller à Gridania",
                    ["CN"] = "前往格里达尼亚",
                    ["KR"] = "'그리다니아'로 이동",
                },
			},
		},
		[144] = {
			{id = 144, cost = 3, x = -23.511, y = 91.99, z = -3.719, h = 1, a = 1002695, i = 3 
				, requires =  {
					["QuestCompleted(435)"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Seek Passage to the Gold Saucer",
                    ["J"] = "「ゴールドソーサー」へ行く",
                    ["G"] = "Zum Gold Saucer",
                    ["F"] = "Aller au Gold Saucer",
                    ["CN"] = "前往金碟游乐场",
                    ["KR"] = "'골드 소서'로 이동",
                },
			},
		},
		[177] = {
			{id = 177, cost = 1, x = 13.245, y = 39.999, z = 11.8289, h = 1.0427, b = 1000974, i = 1 },
		},
	},
	[177] = 
	{
		[128] = {
			{id = 128, cost = 1, x = 0.02, y = 0.01, z = 6.85, h = -0.03, g = 2001010 },
		},
	},
	[129] =
	{
		[128] = {
			{id = 128, cost = 1, x = -83.549187,	z = -25.898380,	    y = 17.999935,	h = 3.123204},
			{id = 128, cost = 1, x = -5.879787,	    z = 27.567932,	    y = 20.365623,	h = -1.726619},
			{id = 128, cost = 1, x = -90.283981,	z = 114.456573,	    y = 21.482763,	h = -0.000968},
		},
		[134] = { 
			{id = 134, cost = 5, x = 63.212173,	    z = 0.221235,	    y = 19.999994,	h = 1.553629},
		},
		[140] = {
			{id = 140, cost = 3, x = -359.895, y = 8, z = 41.566, h = -1, b = 1003540
				, requires = {
					["Player.level >= 12"] = true,
					["CanUseAirship()"] = true,
				},
			},
		},
		[138] = {
			{id = 138, cost = 3, x = -190.834, y = 1, z = 210.829, h = -1, b = 1000868, i = 1
				, requires = {
					["Player.level >= 15"] = true,
					["CanUseAirship()"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Purchase Passage to Aleport",
                    ["J"] = "「エールポート」へ行く",
                    ["G"] = "Zum Bierhafen",
                    ["F"] = "Aller à Port-aux-Ales",
                    ["CN"] = "前往小麦酒港",
                    ["KR"] = "'맥주 항구'로 이동",
                },
			},
		},
		[137] = {
			{id = 137, cost = 3, x = -190.834, y = 1, z = 210.829, h = -1, b = 1000868, i = 2
				, requires = {
					["Player.level >= 30"] = true,
					["CanUseAirship()"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Purchase Passage to Costa del Sol",
                    ["J"] = "「コスタ・デル・ソル」へ行く",
                    ["G"] = "Zur Sonnenküste",
                    ["F"] = "Aller à Costa del Sol",
                    ["CN"] = "前往太阳海岸",
                    ["KR"] = "'코스타 델 솔'로 이동",
                },
			},
		},
		[198] = {
			{id = 198, cost = 5, x = 9.192, y = 20.98, z = -15.184, b = 1001029, i = 1},
		},
		[628] = {
			{id = 628, cost = 1, x = -356.02, y = 8.01, z = 46.85, h = -1.63, g = 1021536
				, requires = {
					["QuestCompleted(2476)"] = true, -- check quest id. only added to stop low lvl chars attempting pathing
                },
			},
		},
		[680] = {
			{id = 680, cost = 1, x = -357.66, y = 8.00, z = 45.82, h = 1.61, g = 1020442 },
		},
		[962] = {
			{id = 962, cost = 1, x = -386.02, y = 6.01, z = 41.85, h = 1.61, b = 1037069
				, requires = {
					["QuestCompleted(4357)"] = true,
                },
			},
		},
	},
	[134] =
	{
		[129] = {
			{id = 129, cost = 5, x = -43.422066, z = 153.802917, y = 35.445602, h = -1.105748
				, requires = {
					["GetPatchLevel() < 5.3"] = true,
				}
			},
			{id = 129, cost = 5, x = -50, z = 157, y = 34, h = -1.15
				, requires = {
					["GetPatchLevel() >= 5.3"] = true,
				}
			},
		},
		[135] = {
			{id = 135, cost = 5, x = 203.290405,	z = 285.331512,	    y = 65.182816,	h = 1.558325
				, requires = {
					["GetPatchLevel() < 5.3"] = true,
				}
			},
			{id = 135, cost = 5, x = 209.290405,	z = 285.331512,	    y = 65.182816,	h = 1.558325
				, requires = {
					["GetPatchLevel() >= 5.3"] = true,
				}
			},
		},
		[137] = {
			{id = 137, cost = 5, x = -163.673187,	z = -734.864807,	y = 35.884563,	h = 2.833870},
		},
		[138] = {
			{id = 138, cost = 5, x = -375.221436,	z = -603.032593,	y = 33.130100,	h = -2.164589},
		},
	},
	[135] =
	{
		[128] = {
			{id = 128, cost = 5, x = -52.436810,	z = 116.130196,	    y = 75.830246,	h = -1.584678
				, requires = {
					["GetPatchLevel() < 5.3"] = true,
				}
			},
			{id = 128, cost = 5, x = -63.436810,	z = 115,	    y = 75.830246,	h = -1.64
				, requires = {
					["GetPatchLevel() >= 5.3"] = true,
				}
			},
		},
		[134] = {
			{id = 134, cost = 5, x = 230.518661,	z = -342.391663,	y = 74.490341,	h = -2.258913},
		},
		[137] = {
			{id = 137, cost = 5, x = 694.988586,	z = -387.720428,	y = 79.927017,	h = -3.131416},
			{id = 137, cost = 5, x = 570.413635,	z = -523.798584,	y = 96.407211,	h = 3.126078},
		},
		[339] = {
			{id = 339, cost = 5, x = 598.555847,	z = -108.400681,	y = 61.519623,	h = 0.287259, r = true
				--, requires = {
					--["QuestCompleted(1214)"] = true,
				--},
			},
		},
	},
	[339] =
	{
		[135] = {
			{id = 135, cost = 5, x = -9.653202,		z = -169.488068,	y = 48.346123,	h = -3.115577, rx = true
				--, requires = {
					--["QuestCompleted(1214)"] = true,
				--},
			},
		},
	},
	[137] =
	{
		[129] = {
			{id = 129, cost = 3, x = 606.901, y = 11.6, z = 391.991, h = -1, b = "1003585;1005420", i = 1
				, requires = {
					["Player.level >= 30"] = true,
					["CanUseAirship()"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Purchase Passage to Limsa Lominsa",
                    ["J"] = "「リムサ・ロミンサ」へ行く",
                    ["G"] = "Nach Limsa Lominsa",
                    ["F"] = "Aller à Limsa Lominsa",
                    ["CN"] = "前往利姆萨·罗敏萨",
                    ["KR"] = "'림사 로민사'로 이동",
                },
			},
		},
		[134] = {
			{id = 134, cost = 5, x = -113.323311,	z = 47.165649,	    y = 70.324112,	h = -1.409805},
		},
		[135] = {
			{id = 135, cost = 5, x = 246.811844,	z = 837.507141,	    y = 56.341099,	h = -0.146225},
			{id = 135, cost = 5, x = -132.151001,	z = 743.861389,	    y = 69.843018,	h = -0.003346},
		},
		[139] = {
			{id = 139, cost = 5, x = 78.965446,	    z = -119.879181,	y = 80.393074,	h = 3.141325},
		},
	},
	[138] =
	{
		[129] = {
			{id = 129, cost = 3, x = 318.314, y = -36, z = 351.376, h = -1, b = 1003584, i = 1
				, requires = {
					["Player.level >= 15"] = true,
					["CanUseAirship()"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Purchase Passage to Limsa Lominsa",
                    ["J"] = "「リムサ・ロミンサ」へ行く",
                    ["G"] = "Nach Limsa Lominsa",
                    ["F"] = "Aller à Limsa Lominsa",
                    ["CN"] = "前往利姆萨·罗敏萨",
                    ["KR"] = "'림사 로민사'로 이동",
                },
			},
		},
		[135] = {
			{id = 135, cost = 3, x = 318.314, y = -36, z = 351.376, h = -1, b = 1003584, i = 2
				, requires = {
					["Player.level >= 15"] = true,
					["CanUseAirship()"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Purchase Passage to Candlekeep Quay",
                    ["J"] = "「キャンドルキープ埠頭」へ行く",
                    ["G"] = "Zum Kerzenwacht-Kai",
                    ["F"] = "Aller au quai de la Torche",
                    ["CN"] = "前往守炬埠头",
                    ["KR"] = "'촛불지기 부두'로 이동",
                },
			},
		},
		[134] = {
			{id = 134, cost = 5, x = 811.963623,	z = 390.644775,	    y = 49.586365,	h = 0.378320
				, requires = {
					["GetPatchLevel() < 5.3"] = true,
				}
			},
			{id = 134, cost = 5, x = 813.963623,	z = 395.644775,	    y = 49.586365,	h = 0.46
				, requires = {
					["GetPatchLevel() >= 5.3"] = true,
				}
			},
		},
		[139] = {
			{id = 139, cost = 5, x = 410.657715,	z = -10.786478,	    y = 30.619648,	h = 2.819475},
		},
	},
	[139] =
	{
		[137] = {
			{id = 137, cost = 5, x = 719.070007,	z = 214.217957,	    y = 0.217405,	h = 0.028251},
		},
		[138] = {
			{id = 138, cost = 5, x = -476.706177,	z = 287.913330,	    y = 1.921210,	h = -0.688538
				, requires = {
					["(Player.localmapid ~= 139 or (Player.localmapid == 139 and ((Player.pos.x < 0) or (Player.pos.x > 0 and GilCount() >= 40))))"] = true,
				}
			},
		},
		[180] = {
			{id = 180, cost = 5, x = -341.941010,	z = -18.610147,	    y = 48.610909,	h = 1.852675},
			{id = 180, cost = 5, x = 284.691162,	z = -202.286819,	y = 42.024910,	h = -2.485059},
		},
	},
	[180] =
	{
		[139] = {
			{id = 139, cost = 5, x = -324.825165,	z = -81.512505,	    y = 50.272530,	h = 0.180411},
			{id = 139, cost = 5, x = 244.891861,	z = -251.455048,	y = 53.276550,	h = 1.401489},
		},
	},
	[198] =
	{
		[129] = {
			{id = 129, cost = 5, x = 0, y = 1, z = 7.9, h = -0.03, g = 2001835},
		},
	},
	[212] = 
	{
		[140] = {
			{id = 140, cost = 5, x = -15.1326, z = -0.0081, y = 0, h = -1.6396, g = 2001716},
		},
	},
	[395] =
	{
		[155] = {
			{id = 155, cost = 5, x = -3.9291, z = 10.2243, y = -1.1920, h = -0.06821, g = 2004781},
		},
	},
	[331] = 
	{
		[132] = {
			{id = 132, cost = 3, x = -86.5248, y = -0.2377, z = -35.6936, h = 1, a = 1007602 },
		},
	},
	[397] = 
    {
        [398] = {
            {id = 398, cost = 5, x = -849.0742, y = 117.6830, z = -655.5919, h = -2.0784
				, requires = {
					["GetQuestInfo(1609,'step') >= 1 or QuestCompleted(1609)"] = true,
				},
			},
        },
        [418] = {
            {id = 418, cost = 5, x = 468.7914, y = 224.4822, z = 880.5457, h = -0.2626
                , requires = {
                    ["HasAllCurrents(397)"] = true, -- check quest, can be accessed sooner?
                },
            },
        },
    },
	[398] = 
	{
		[397] = {
			{id = 397, cost = 5, x = 870.6607, y = -3.6288, z = 351.0845, h = 1.01271
				, requires = {
					["GetQuestInfo(1609,'step') >= 4 or QuestCompleted(1609)"] = true,
				},
			},
		},
		[399] = {
			{id = 399, cost = 5, x = -799.82757568359, y = -122.63314819336, z = 577.40979003906, h = -1.5792300701141  
				, requires = {
					["GetQuestInfo(1655,'step') >= 1 or QuestCompleted(1655)"] = true,
				},
			},
		},
		[400] = {
			{id = 400, cost = 5, x = -693.9, y = 5.2, z = -841, h = -0.10000000149012, b = 1011946
				, requires = {
					["GetQuestInfo(1617,'step') == 255 or QuestCompleted(1617)"] = true,
				},
			},
		},
	},
	[399] = 
	{
		[398] = {
			{id = 398, cost = 5, x = 909.19537353516, y = 162.49412536621, z = 188.35443115234, h = 1.4070112705231
				, requires = {
					["GetQuestInfo(1617,'step') == 255 or QuestCompleted(1617)"] = true,
				},
			},
		},
		[463] = {
			{id = 463, cost = 3, x = -488.83758544922, y = 137.78799438477, z = 740.47930908203, h = -2.7809858322144, g = 2005336},
		},
		[478] = {
			{id = 478, cost = 3, x = -228.93890380859, y = 106.87369537354, z = -631.58227539063, h = -2.89  },
			{id = 478, cost = 3, x = -544, y = 155.82, z = -515.16, h = -2.74  
				, requires = {
					["QuestCompleted(1658)"] = true,
				},
			},
		},
	},
	[400] = 
	{
		[398] = {
			{id = 398, cost = 5, x = 199.5, y = -69.7, z = 708.3, h = 1.0, g = 2005371},
		},
	},
	[401] = 
	{
		[419] = {
			{id = 419, cost = 3, x = -734.40356445313, y = -105.04070281982, z = 459.84994506836, h = -2.2330574989319, b = 1011949 },
		},
	},
	[402] = 
	{
		[419] = { 
			{id = 419, cost = 3, x = -876.7509765625, y = -184.29299926758, z = -669.19744873047, h = -2.3307199478149, b = 2005372
				, requires =  {
					["QuestCompleted(1664)"] = true,
				}
			},
        },
    },
	[418] = 
	{
		[155] = {
			{id = 155, cost = 5, x = 4.2846689224243, y = -2.5668189525604, z = 148.25918579102, h = 0.24493718147278, b = 1011224 },
		},
		[397] = {
           {id = 397, cost = 5, x = -163.44, y = 2.15, z = -5.51, b = 1011195, i = 1
                , requires =  {
                    ["CanUseAetheryte(71)"] = true,
                }
            },  
			{id = 397, cost = 1, x = -186.16, y = 14, z = -57.15, h = -2.27
                , requires =  {
                    ["HasAllCurrents(397)"] = true, -- check access, can be accessed sooner?
                }
            },   
        },
		[419] = {
			{id = 419, cost = 1, x = -153.8108215332, y = 30.949907302856, z = -141.81959533691, h = -3.120050907135},
			{id = 419, cost = 1, x = -57.653438568115, y = 20.542848587036, z = -97.128196716309, h = 2.4447572231293},
			{id = 419, cost = 1, x = 53.141960144043, y = 29.736303329468, z = -80.891120910645, h = -2.9000406265259},
			{id = 419, cost = 1, x = 156.03057861328, y = -19.477405548096, z = 55.064247131348, h = 2.3485136032104},
		},
		[429] =
		{
			{id = 429, cost = 1, x = 84.5, y = 15, z = 33.96, h = -3, b = 1011193, i = 1 
				--, requires = {
					--["GetQuestInfo(3291,'step') >= 4 or QuestCompleted(3291)"] = true,
				--},
			},
		},
		[439] = {
			{id = 439, cost = 1, x = 93.577056884766, y = 24.026489257813, z = -33.090774536133, h = 1.1162509918213, a = 1011214 
				, requires = {
					["CanUseAirship()"] = true,
				},
			},
		},
		[886] = {
			{id = 886, cost = 1, x = 152, y = -20, z = 63, b = 1031682, i = 1
				, requires = {
					["QuestCompleted(3672)"] = true,
				},
			},
			{id = 886, cost = 1, x = -63, y = 11, z = 43, b = 70 , i = 2
				, requires =  {
					["QuestCompleted(3672)"] = true,
				}
				, conversationstrings = {
                   ["E"] = "Travel to the Firmament.",
                   ["J"] = "蒼天街転送",
                   ["G"] = "Himmelsstadt",
                   ["F"] = "Azurée",
                   ["CN"] = "传送到天穹街",
                   ["KR"] = "창천 거리 이동",
                },
			},
		},
		[1001] = {
			{id = 1001, cost = 1, x = 114, y = 24, z = -11, b = 1011223 , i = 1
				, requires =  {
					["QuestCompleted(4126)"] = true,
				} 
			},
		},
	},
	[429] =
	{
		[418] = {
			{id = 418, cost = 1, x = 0, y = 0, z = 7, h = 0, g = 2005628},
		},
	},
	[886] = {
		[418] = {
			{id = 418, cost = 1, x = 13, y = -15, z = 183, b = 1031683 },
		},
	},
	[419] = 
	{
		[427] = {
			{id = 427, cost = 1, x = -144.67098, y = 14.8031, z = -129.4461, h = -1.5209, b = 1011215 },
		},
		[433] = {
			{id = 433, cost = 1, x = 17.2442, y = 16.0096, z = -9.5047, h = 1.5103, b = 1011217 },
		},
		[418] = {
			{id = 418, cost = 1, x = 17.5327, y = -13.0772, z = -66.0502, h = -0.86},
			{id = 418, cost = 1, x = -16.8083, y = -13.0683, z = -67.0495, h = 0.92},
			{id = 418, cost = 1, x = 258.4115, y = -13.7349, z = -103.4960, h = 1.72},
			{id = 418, cost = 1, x = -314.8616, y = -25.5761, z = -64.8715, h = -0.79},
		},
		
		[130] = {
			{id = 130, cost = 3, x = 151.99447631836, y = -12.559194564819, z = -8.2321929931641, h = -1.4262824058533, b = 1011211, i = 1
				, requires =  {
					["QuestCompleted(1664)"] = true,
				}
				, conversationstrings = {
                   ["E"] = "Purchase Passage to Ul'dah",
                   ["J"] = "「ウルダハ」へ行く",
                   ["G"] = "Nach Ul'dah",
                   ["F"] = "Aller à Ul'dah",
                   ["CN"] = "前往乌尔达哈",
                   ["KR"] = "'울다하'로 이동",
                },
			},
		},
		[132] = {
			{id = 132, cost = 3, x = 151.99447631836, y = -12.559194564819, z = -8.2321929931641, h = -1.4262824058533, b = 1011211, i = 2 
				, requires =  {
					["QuestCompleted(1664)"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Purchase Passage to Gridania",
                    ["J"] = "「グリダニア」へ行く",
                    ["G"] = "Nach Gridania",
                    ["F"] = "Aller à Gridania",
                    ["CN"] = "前往格里达尼亚",
                    ["KR"] = "'그리다니아'로 이동",
                },
			},
		},
		[128] = {
			{id = 128, cost = 3, x = 151.99447631836, y = -12.559194564819, z = -8.2321929931641, h = -1.4262824058533, b = 1011211, i = 3
				, requires =  {
					["QuestCompleted(1664)"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Purchase Passage to Limsa Lominsa",
                    ["J"] = "「リムサ・ロミンサ」へ行く",
                    ["G"] = "Nach Limsa Lominsa",
                    ["F"] = "Aller à Limsa Lominsa",
                    ["CN"] = "前往利姆萨·罗敏萨",
                    ["KR"] = "'림사 로민사'로 이동",
                },
			},
		},
		[144] = {
			{id = 144, cost = 3, x = 151.99447631836, y = -12.559194564819, z = -8.2321929931641, h = -1.4262824058533, b = 1011211, i = 4
				, requires =  {
					["QuestCompleted(435)"] = true,
					["QuestCompleted(1664)"] = true,
				} 
				, conversationstrings = {
					["E"] = "Seek Passage to the Gold Saucer",
					["J"] = "「ゴールドソーサー」へ行く",
					["G"] = "Zum Gold Saucer",
					["F"] = "Aller au Gold Saucer",
					["CN"] = "前往金碟游乐场",
					["KR"] = "'골드 소서'로 이동",
				},
			},
		},
		[401] = {
			{id = 401, cost = 3, x = 151.99447631836, y = -12.559194564819, z = -8.2321929931641, h = -1.4262824058533, b = 1011211, i = 5 },
		},
		[402] = {
            {id = 402, cost = 3, x = 166.46820068359, y = -14.313319206238, z = 48.422393798828, h = 0.81401968002319, b = 1012153
				, requires =  {
					["QuestCompleted(1664)"] = true,
				}
				, conversationstrings = {
                    ["E"] = "Seek Passage to Azys Lla",
                    --["J"] = "「グリダニア」へ行く",
                   -- ["G"] = "Nach Gridania",
                   -- ["F"] = "Aller à Gridania",
                    --["CN"] = "前往格里达尼亚",
                   -- ["KR"] = "'그리다니아'로 이동",
                },
			},
        },
	},
	[427] = 
	{
		[419] = {
			{id = 419, cost = 3, x = -5.0512, y = 0, z = 11.495, h = 0, g = 2005332 },
		},
	},
	[433] = 
	{
		[419] = {
			{id = 419, cost = 3, x = -0.04325, y = 0, z = 12.5567, h = -0.0167, g = 2005334 },
		},
	},
	[439] = 
	{
		[418] = {
			{id = 418, cost = 1, x = 29.30, y = 6.5, z = -20.3, h = 2.32, g = 2005335 },
		},
	},
	[463] = 
	{
		[399] = {
			{id = 399, cost = 3, x = 7.5150, y = 37.7879, z = -50.2450, h = 2.9914, g = 2005337 },
		},
	},
	[478] = 
	{
		[398] = {
			{id = 398, cost = 3, x = 147.0463, y = 207, z = 115.8594, h = 0.9793},
		},
		[399] = {
			{id = 399, cost = 3, x = 147.0463, y = 207, z = 115.8594, h = 0.9793},
			{id = 399, cost = 3, x = 73.25932, y = 205, z = 143.0470, h = -0.522
				, requires = {
					["QuestCompleted(1658)"] = true,
				},
			},
		},
		[463] = {
			{id = 463, cost = 3, x = 73.25932, y = 205, z = 143.0470, h = -0.522
				, requires = {
					["QuestCompleted(1658)"] = true,
				},
			},
		},
	},	
	[210] =
	{
		[131] = {
			{id = 131, cost = 1, x = 0.030, y = 0.928, z = 10.156, h = 0, g = 2001695},
		},
	},
	[612] =
	{
		[152] = {
			{id = 152, cost = 1, x = -664.33, y = 130.00, z = -533.29, h = 0, g = 1019516
				, requires = {
					["GetQuestInfo(2446,'step') == 255 or QuestCompleted(2446)"] = true,
				},
			},
		},
		[620] = {
			{id = 620, cost = 1, x = 848.3, y = 86.1, z = 363.3, h = 1.03, 
			requires = {
					["GetQuestInfo(2534,'step') >= 3 or QuestCompleted(2534)"] = true,
				},
			},
		},
		[635] = {
			{id = 635, cost = 1, x = 482.54, y = 61.65, z = -556.99, h = 2.01
				, requires = {
					["GetQuestInfo(2447,'step') >= 4 or QuestCompleted(2447)"] = true,
				},
			},
		},
		[683] = {
			{id = 683, cost = 1, x = 802.3, y = 178.22, z = -302.3, h = 0, g = 2008200
				, requires = {
					["GetQuestInfo(2532,'step') >= 4 or QuestCompleted(2532)"] = true,
				},
			},
		},
	},
	[613] =
	{
		[614] = {
			{id = 614, cost = 1, x = -828.24, y = 19.88, z = -267.71, h = -0.91
				, requires = {
					["HasQuest(2491) or QuestCompleted(2491)"] = true,
				},
			},
		},
		[622] = {
			{id = 622, cost = 1, x = -742.36, y = -0.83, z = -866.99, h = -2.08
				, requires = {
					["GetQuestInfo(2630,'step') >= 2 or QuestCompleted(2630)"] = true,
				},
			},
		},
		[628] = {
            {id = 628, cost = 1, x = 879.8, y = 1.18, z = 876.13, h = 0.73
				, requires = {
					["QuestCompleted(2476)"] = true,
				},
			},
        }, 
	},
	[614] =
	{
		[613] = {
			{id = 613, cost = 1, x = 828.95, y = 99.96, z = -411.88, h = -0.69
				, requires = {
					["HasQuest(2491) or QuestCompleted(2491)"] = true,
				},
			},
		},
		[681] = {
			{id = 681, cost = 1, x = 276.36, y = 3.66, z = -377.52, b = 1019291},
		},
		[759] = {
			{id = 759, cost = 1, x = -493.98, y = 1.30, z = 542.90, h = 2.14, b = 1024794},
		},
	},
	[620] =
	{
		[612] = {
			{id = 612, cost = 1, x = -789.5, y = 297.4, z = 214.69, h = -1.6, 
			requires = {
					["GetQuestInfo(2534,'step') >= 3 or QuestCompleted(2534)"] = true,
				},
			},
		},
		[621] = {
			{id = 621, cost = 1, x = 587.64, y = 344.09, z = 420.33, h = 1.60
				, requires = {
					["GetQuestInfo(2548,'step') >= 3 or QuestCompleted(2548)"] = true,
				},
			},
		},
		[635] = {
			{id = 635, cost = 1, x = -658.47, y = 50.87, z = -792.97, h = -2.08
				, requires = {
					["GetQuestInfo(2447,'step') >= 4 or QuestCompleted(2447)"] = true,
				},
			},
		},
	},
	[621] = -- The Lochs:
	{
		[620] = {
			{id = 620, cost = 1, x = -658.47, y = 50.87, z = -792.97, h = -2.08
				, requires = {
					["GetQuestInfo(2548,'step') >= 3 or QuestCompleted(2548)"] = true,
				},
			},
		},
		[738] = {
            {id = 738, cost = 1, x = 754.27, y = 70.00, z = 424.70, h = 0.07, b = 1024113 },
        },
		[958] = { -- to Garlemald
            {id = 958, cost = 1, x = 742.58, y = 70.00, z = 539.57, b = 1039554
                , requires = {
                    ["QuestCompleted(4395)"] = true,
                },
            },
        },
	},
	[622] =
	{
		[613] = {
			{id = 613, cost = 1, x = 543.48, y = -21.83, z = 699.90, h = -0.03
				, requires = {
					["GetQuestInfo(2630,'step') >= 2 or QuestCompleted(2630)"] = true,
				},
			},
		},
		[614] = {
			{id = 614, cost = 1, x = -164.0, y = 0.65, z = 850.7, h = 0.2
				, requires = {
					["QuestCompleted(2517)"] = true,
				},
			},
		},
	},
	[628] =
    {
        [129] = {
            {id = 129, cost = 1, x = -100.02, y = -7.78, z = -63.81, h = -2.9, g = 1019004},
        },
        [639] = {
            {id = 639, cost = 1, x = 151.02, y = 14.78, z = 93.81, h = 0.14, g = 1019070},
        },
        [613] = {
            {id = 613, cost = 1, x = -134.31, y = -6.91, z = -58.86, h = -1.61
				, requires = {
					["GetQuestInfo(2476,'step') == 255 or QuestCompleted(2476)"] = true,
				},
			},
        },	
		[629] =
		{
			{id = 629, cost = 1, x = -86.2, y = 19, z = -198.7, h = 3, b = 1018981, i = 1 
				--, requires = {
					--["GetQuestInfo(3291,'step') >= 4 or QuestCompleted(3291)"] = true,
				--},
			},
		},
		[735] = {
            {id = 735, cost = 1, x = -58.98, y = 79.06, z = 46.55, b = 1024156},
        },
    },
	[629] =
	{
		[628] = {
			{id = 628, cost = 1, x = 0, y = 0, z = 5, h = 0, g = 2007707},
		},
	},
	[635] =
	{
		[612] = {
			{id = 612, cost = 1, x = -32.02, y = 14.31, z = 163.50, h = 0, },
			{id = 612, cost = 1, x = 2.10, y = -2.12, z = 163.50, h = 0, },
		},	
		[620] = {	
			{id = 620, cost = 1, x = 129.18, y = -0.28, z = -3.39, h = 1.49
				, requires = {
					["HasQuest(2455) or QuestCompleted(2455)"] = true,
				},
			},
		},
	},
	[639] =
	{
		[628] = {
			{id = 628, cost = 1, x = 0.04, y = 0.00, z = 12.88, h = -0.00, g = 2008134},
		},
	},
	[680] =
	{
		[129] = {
			{id = 129, cost = 1, x = -0.02, y = 16.35, z = -19.03, h = 3.13, g = 2008373},
		},
	},
	[681] =
	{
		[614] = {
			{id = 614, cost = 1, x = 24.43, y = -1.03, z = 18.57, b = 1019293},
		},
	},
	[683] =
	{
		[612] = {
			{id = 612, cost = 1, x = 1.0, y = -4.27, z = 43.45, h = 0.00, g = 2008372},
		},
	},
	[735] =
    {
        [628] = {
            {id = 628, cost = 1, x = -28.14, y = -0.75, z = -0.02, b = 2009044},
        },
        [736] = {
            {id = 736, cost = 1, x = 34.67, y = 0.38, z = -1.02, b = 2009042},
        },
    },
    [736] =
    {
        [735] = {
            {id = 735, cost = 1, x = 5.74, y = -0.00, z = -0.81, b = 2009043},
        },
    },
	[738] =
    {
        [621] = {
            {id = 621, cost = 1, x = 0.18, y = -2.00, z = 66.02, h = 0.00, b = 2009215},
        },
    },
	[744] =
    {
        [759] = {
            {id = 759, cost = 1, x = 0.02, y = 0.91, z = 18.31, h = 0.00, b = 2009289},
        },
    },
	[759] =
    {
        [614] = {
            {id = 614, cost = 1, x = 147.81, y = -4.18, z = 49.45, h = 0.00, b = 1024792},
        },
		[744] = {
            {id = 744, cost = 1, x = -10.33, y = 0.20, z = 12.89, h = 0.00, b = 1024974},
        },
		[915] = {
            {id = 915, cost = 1, x = 127, y = -4, z = 98, h = 0.00, b = 1032884
                , requires = {
					["GetQuestInfo(3835,'step') >= 3 or QuestCompleted(3836)"] = true,
                },
            },
        },
    },
	[813] =
    {
        [815] = {
            {id = 815, cost = 1, x = 535, y = -5, z = 862, h = 0.01
                , requires = {
                    ["QuestCompleted(3609)"] = true,
                },
            },
        },
        [816] = {
            {id = 816, cost = 1, x = -323, y = 116, z = -832, h = -3.0
				, requires = {
					["GetQuestInfo(3305,'step') == 255 or QuestCompleted(3305)"] = true,
				},
			},
        },
        [817] = {
            {id = 817, cost = 1, x = 878, y = 42, z = -290, h = 1.6
				, requires = {
					["QuestCompleted(3323)"] = true,
				},
			},
        },
        [819] = {
            {id = 819, cost = 1, x = 831, y = 38, z = 407, h = 1.57},
        },
    },
	[814] =
    {
        [819] = {
            {id = 819, cost = 1, x = 802, y = 1, z = 253, h = -1.55, b = "1029807;1027449" -- id changed somewhere?
				, requires = {
					["GetQuestInfo(3282,'step') == 255 or QuestCompleted(3282)"] = true,
				},
			},
        },
        [818] = {
            {id = 818, cost = 1, x = -495, y = 8, z = 586, h = -1.61, b = 1027448
				, requires = {
					["QuestCompleted(3647)"] = true,
				},
			},
        },
        [820] = {
            {id = 820, cost = 1, x = 173, y = 58, z = 879, h = -0.05
				, requires = {
					["GetQuestInfo(3286,'step') > 1 or QuestCompleted(3286)"] = true,
				},
			},
        },
		[895] = {
			{id = 895, cost = 1, x = 737.23, y = 285.02, z = -83.46, b = 2010832
				, requires = {
					["GetQuestInfo(3718,'step') > 2 or QuestCompleted(3718)"] = true,
				},
			},
		},
		[928] = {
            {id = 928, cost = 1, x = 702.45, y = 293.46, z = -158.98, b = 2011154},
        },
    },
	[815] =
    {
        [819] = {
            {id = 819, cost = 1, x = 688, y = -38, z = -661, h = 0.96, b = 1027863
				, requires = {
					["GetQuestInfo(3291,'step') >= 4 or QuestCompleted(3291)"] = true,
				},
			},
        },
        [813] = {
            {id = 813, cost = 1, x = -616, y = 58, z = -675, h = -2.15
				, requires = {
					["QuestCompleted(3609)"] = true,
				},
			},
        },
		[878] = {
            {id = 878, cost = 1, x = 384.77, y = -64.49, z = 511.50, b = 2009985},
        },
    },
	[816] =
    {
        [813] = {
            {id = 813, cost = 1, x = -694, y = 112, z = 833, h = -0.24
				, requires = {
					["GetQuestInfo(3305,'step') == 255 or QuestCompleted(3305)"] = true,
				},
			},
        },
    },
	[817] =
    {
        [813] = {
            {id = 813, cost = 1, x = -820, y = 2.6, z = 737, h = -0.7},
        },
    },
	[818] =
    {
        [814] = {
            {id = 814, cost = 1, x = 264, y = 420, z = -885, h = 2.64, g = 2010635
				, requires = {
					["QuestCompleted(3647)"] = true,
				},
			},
        },
    },
	[819] =
    {
        [813] = {
            {id = 813, cost = 1, x = -241, y = -3, z = -0, h = -1.61},
        },
        [814] = {
            {id = 814, cost = 1, x = 61, y = 36, z = -169, h = -1.19, b = 1027225, i = 1
				, requires = {
					["GetQuestInfo(3282,'step') == 255 or QuestCompleted(3282)"] = true,
				},
			},
        },
        [815] = {
            {id = 815, cost = 1, x = 60, y = 36, z = -171, h = -1.07, b = 1027264
				, requires = {
					["GetQuestInfo(3291,'step') >= 4 or QuestCompleted(3291)"] = true,
				},
			},
        },
		[843] =
		{
			{id = 843, cost = 1, x = 63, y = 1.72, z = 250, h = 1.3, b = 1027231, i = 1 
				--, requires = {
					--["GetQuestInfo(3291,'step') >= 4 or QuestCompleted(3291)"] = true,
				--},
			},
		},
        [844] = {
            {id = 844, cost = 1, x = 118, y = 14, z = 7, h = -1.61, b = 1027230
				, requires = {
					["QuestCompleted(3281)"] = true,
				},
			},
        },
        [844] = {
            {id = 844, cost = 1, x = 118, y = 14, z = 7, h = -1.61, b = 1033863
				, requires = {
					["QuestCompleted(4464)"] = true, -- npc ID changed with 6.01?
				},
			},
        },
    },
	[820] =
    {
        [814] = {
            {id = 814, cost = 1, x = 0, y = -17, z = -160, h = -3.13},
        },
    },
	[842] =
    {
        [156] = {
            {id = 156, cost = 1, x = -72, y = 6, z = 80, h = -0.5, g = 2010599},
        },
        [877] = {
            {id = 877, cost = 1, x = -52, y = 1.5, z = 39, h = 2.9, b = 1029797
				, requires = {
					["HasQuest(3279) and GetQuestInfo(3279,'step') >= 3 and GetQuestInfo(3279,'step') < 255"] = true,
				},
			},
        },
        [813] = {
            {id = 813, cost = 1, x = -52, y = 1.5, z = 39, h = 2.9, b = 1029797
				, requires = {
					["GetQuestInfo(3279,'step') >= 255 or QuestCompleted(3279) and not QuestCompleted(3281)"] = true,
				},
			},
        },
        [844] = {
            {id = 844, cost = 1, x = -52, y = 1.5, z = 39, h = 2.9, b = 1029804
				, requires = {
					["QuestCompleted(3281)"] = true,
				},
			},
        },
    },
	[843] =
	{
		[819] = {
			{id = 819, cost = 1, x = 0, y = 0, z = 4, h = 0, g = 2009759},
		},
	},
	[844] =
    {
        [842] = {
            {id = 842, cost = 1, x = 0, y = 0, z = -13, h = 0.00, g = 2010509},
        },
        [819] = {
            {id = 819, cost = 1, x = 0, y = 1, z = 14, h = -0.00, g = 2009758},
        },
    },
	[857] =
    {
        [878] = {
            {id = 878, cost = 1, x = 99.95, y = 0.00, z = 108.12, b = 2009987},
        },
	},
	[877] =
    {
        [842] = {
            {id = 842, cost = 1, x = 176, y = 5, z = 60, h = 2.9, b = 2010609
				, requires = {
					["GetQuestInfo(3279,'step') >= 3 or QuestCompleted(3279)"] = true,
				},
			},
        },
    },
	[878] =
    {
        [815] = {
            {id = 815, cost = 1, x = 36.00, y = 4.93, z = -6.85, b = 2009986},
        },
        [857] = {
            {id = 857, cost = 1, x = -14.77, y = -2.54, z = 22.60, b = 2009981
                , requires = {
                    ["(HasQuest(3255) or QuestCompleted(3255)) and not (HasQuest(3256) or QuestCompleted(3256))"] = true,
                },
            },
            {id = 857, cost = 1, x = -14.77, y = -2.54, z = 22.60, b = 2010135
                , requires = {
                    ["HasQuest(3256) or QuestCompleted(3256)"] = true,
                },
            },
        },
    },
	[880] =
    {
        [814] = {
            {id = 814, cost = 1, x = 99, y = 1, z = 119, g = 2010601
				, requires = {
					["QuestCompleted(3643)"] = true,
				},
			},
        },
    },
	[915] =
    {
        [759] = {
            {id = 759, cost = 1, x = -50, y = 0, z = -32, h = 0.00, b = 1032885},
        },
    }, 
	[895] =
    {
        [814] = {
            {id = 814, cost = 1, x = 1.27, y = 0.00, z = 1.96, b = 2010829},
        },
        [896] = {
            {id = 896, cost = 1, x = -0.06, y = 0.00, z = -93.86, b = 2010830},
        },
    },
	[896] =
    {
        [895] = {
            {id = 895, cost = 1, x = -499.14, y = 484.00, z = 279.87, b = 2010831},
        },
    },
	[928] =
	{
		[814] = {
            {id = 814, cost = 1, x = -382.52, y = 102.02, z = 387.95, b = 2011155},
        },
    },
	[956] = -- Labyrinthos:
    {
        [962] = { -- to Old Sharlayan
            {id = 962, cost = 1, x = -29.74, y = 179.71, z = -826.21, b = 1039544},
        },
        [960] = { -- Ultima Thule
            {id = 960, cost = 1, x = -334.83, y = -224.20, z = 312.12, b = 1039552},
        },
    },
	[960] = -- Ultima Thule:
    {
        [956] = { -- Labyrinthos
            {id = 956, cost = 1, x = -374.81, y = 81.80, z = 615.96, b = 2012292},
        },
    },
	[957] = -- Thavnair:
    {
        [962] = { -- to Old Sharlayan
            {id = 962, cost = 1, x = -29.74, y = 179.71, z = -826.21, b = 1039544
                , requires = {
                    ["QuestCompleted(9999)"] = true,
                },
            },
        },
        [963] = { -- to Radz-at-Han
            {id = 963, cost = 1, x = 576.49, y = 55.26, z = -682.13, h = 2.36
                , requires = {
                    ["GetQuestInfo(4412,'step') >= 2 or QuestCompleted(4412)"] = true,
                },
            },
            {id = 963, cost = 1, x = 208, y = 60, z = -601, b = 1037650
                , requires = {
                    ["QuestCompleted(4412)"] = false,
                },
            },
        },
        [1056] = { -- to Alzadaal's Legacy
            {id = 1056, cost = 1, x = -270.25, y = 0.08, z = 605.92, b = 1039589
                , requires = {
                    ["(GetQuestInfo(4529,'step') >= 255 or QuestCompleted(4529)) and not (HasQuest(4592) or QuestCompleted(4592))"] = true,
                },
            },
			{id = 1056, cost = 1, x = -270.25, y = 0.08, z = 605.92, b = 1044157
                , requires = {
                    ["QuestCompleted(4592)"] = true,
                },
            },
        },
		[1125] = { -- to Khadga
		    {id = 1125, cost = 1, x = -74.86, y = 99.95, z = -714.56, b = 1037697},
        },
    },
	[958] = -- Garlemald:
    {
        [621] = { -- to The Lochs
            {id = 621, cost = 1, x = -495.63, y = 27.66, z = 634.85, b = 1039553},
        },
        [1024] = { -- to The Nethergate
            {id = 1024, cost = 1, x = -483.30, y = 10.89, z = -677.39, b = 1042017, i = 1
                , requires = {
                    ["QuestCompleted(4395)"] = true,
                },
            },
        },
		[1119] = { -- to Lapis Manalis
		{id = 1119, cost = 1, x = 465.66, y = -18.01, z = 717.94, b = 1044263},
        },
		[1160] = { -- to Senatus
		{id = 1160, cost = 1, x = -368.51, y = 11.16, z = -623.00, b = 2013360},
        },
    },
	[959] = -- Mare Lamentorum:
    {
		[1024] = { -- to The Nethergate
            {id = 1024, cost = 1, x = -663.29, y = 132.65, z = 728.97, b = 2012531
				, requires = {
					["HasQuest(4408) or QuestCompleted(4408)"] = true,
				},
			},
        },
        [1028] = { -- to The Dark Inside
            {id = 1028, cost = 1, x = 188.83, y = 63.44, z = 468.25, b = 1039988},
        },
		[1162] = { -- to The Red Moon
            {id = 1162, cost = 1, x = -103.34, y = 51.43, z = 391.69, a = 2013362},
        },
    },
	[961] = -- Elpis:
    {
			[844] = { -- to Ocular
			{id = 129, cost = 1, x = 281.85, y = 48.39, z = 834.56, g = 2012533},
		},
        [1025] = { -- to The Gates of Pandæmonium
            {id = 1025, cost = 1, x = 809.93, y = 151.81, z = -243.43, b = 2012293},
        },
    },
	[962] = -- Old Sharlayan:
    {
		[129] = { -- to Limsa Lominsa Lower Decks
			{id = 129, cost = 1, x = 159, y = -16, z = 179, g = 1037220},
		},
        [956] = { -- to Labyrinthos
            {id = 956, cost = 1, x = -53.97, y = 18.17, z = -324.52, b = 1037118},
        },
		[957] = { -- to Thavnair
            {id = 957, cost = 1, x = -83.05, y = 6.62, z = -39.38, b = 1037288},
        },
		[987] = { -- to Main Hall
            {id = 987, cost = 1, x = -108.57, y = 5.02, z = 4.53, b = 2011936},
        },
		[990] = {
			{id = 990, cost = 1, x = -101, y = 4, z = 0, h = 0.7, b = 1037293, i = 1 },
		},
        [1185] = { 
            {id = 1185, cost = 1, x = 138, y = -16, z = 221, b = 1046492
                , requires = {
                    ["GetQuestInfo(4860,'step') >= 255 or QuestCompleted(4860)"] = true,
                },
			},
        },
	},
	[963] = -- Radz-at-Han:
    {
        [957] = { -- to Thavnair
            {id = 957, cost = 1, x = 99.53, y = -32.00, z = 225.32, h = 0.79
                , requires = {
                    ["GetQuestInfo(4412,'step') >= 2 or QuestCompleted(4412)"] = true,
                },
            },
        },
        [1078] = { -- to Meghaduta Guest Chambers
            {id = 1078, cost = 1, x = -350.89, y = 55.00, z = -80.77, b = 1043847},
        },
	[1161] = { -- to Estinien's Chambers
            {id = 1161, cost = 1, x = -351.12, y = 55.00, z = -80.85, b = 1043847},
        },
    },
	[971] = -- reaper Start
    {
        [131] = {
            {id = 131, cost = 1, x = 0, y = 0, z = 8, b = 2011673},
        },
	},
	[987] = -- Main Hall:
    {
        [962] = { -- to Old Sharlayan
            {id = 962, cost = 1, x = 0, y = 1, z = 13, b = 2011937},
        },
    },
	[990] = -- Inn:
    {
        [962] = { -- to Old Sharlayan
            {id = 962, cost = 1, x = 0, y = 1, z = 10, b = 2011853},
        },
    },
	[1001] =
    {
        [418] = { 
            {id = 418, cost = 1, x = 0, y = 1, z = 10, b = 2011721},
        },
    },
	[1024] = -- The Nethergate:
    {
        [958] = { -- to Garlemald
            {id = 958, cost = 1, x = 0.18, y = 0, z = 52.25, b = 2012529},
        },
        [959] = { -- to Mare Lamentorum
            {id = 959, cost = 1, x = -0.02, y = 6.61, z = -0.02, b = 2012530
                , requires = {
                    ["GetQuestInfo(4396,'step') > 2 or QuestCompleted(4396)"] = true,
                },
            },
        },
    },
	[1025] = -- The Gates of Pandæmonium:
    {
        [961] = { -- to Elpis
            {id = 961, cost = 1, x = 99.99, y = -0.32, z = 169.97, b = 2012294},
        },
		[1093] = { -- to Stygian Insenescence Cells
            {id = 1093, cost = 1, x = 100.11, y = 7.69, z = -70.68, b = 2013031},
        },
    },
    [1028] = -- The Dark Inside:
    {
        [959] = { -- to Mare Lamentorum
            {id = 959, cost = 1, x = 99.83, y = 0, z = 117.51, b = 2012528},
        },
    },    
    [1056] = -- Alzadaal's Legacy:
    {
        [957] = { -- to Thavnair
            {id = 957, cost = 1, x = 110.00, y = -348.59, z = -45.24, b = 2012841
                , requires = {
                    ["GetQuestInfo(4529,'step') >= 255 or QuestCompleted(4529)"] = true,
                },
            },
        },
        [1077] = { -- Zero's Domain
            {id = 1077, cost = 1, x = 109.99, y = -350.00, z = -91.35, b = 2013039},
        },
    },
    [1077] = -- Zero's Domain
    {
        [1089] = { -- The Fell Court of Troia
            {id = 1089, cost = 1, x = 0.24, y = -0.42, z = -86.34, b = 2013045},
        },
        [1092] = { -- Storm's Crown
            {id = 1092, cost = 1, x = -0.02, y = -0.40, z = -73.75, b = 2013053},
        },
    },
    [1078] = -- Meghaduta Guest Chambers
    {
        [963] = { -- Radz-at-Han
            {id = 963, cost = 1, x = -0.02, y = 0.01, z = 4.73, b = 2013077},
        },
    },
    [1089] = -- The Fell Court of Troia
    {
        [1077] = { -- Zero's Domain
            {id = 1077, cost = 1, x = 14.70, y = 359.20, z = -114.74, b = 2013044},
        },
        [1056] = { -- Alzadaal's Legacy
            {id = 1056, cost = 1, x = -49.08, y = -718.00, z = 130.62, b = 2013040},
        },
    },
    [1092] = -- Storm's Crown
    {
        [1077] = { -- Zero's Domain
            {id = 1077, cost = 1, x = 99.89, y = -18.85, z = 196.88, b = 2013167},
        },
    },
	[1093] = -- Stygian Insenescence Cells
    {
        [1025] = { -- The Gates of Pandæmonium
            {id = 1025, cost = 1, x = 100.20, y = 0.00, z = 119.75, b = 2013032},
        },
    },
	[1119] = -- Lapis Manalis
    {
        [958] = { -- Garlemald
            {id = 958, cost = 1, x = 47.60, y = 365.84, z = -587.42, b = 2013227},
        },
    },
	[1125] = -- Khadga
    {
        [957] = { -- Thavnair
            {id = 957, cost = 1, x = 699.63, y = -181.08, z = 45.66, b = 2013241},
        },
    },
	[1159] = -- The Voidcast Dais
    {
        [1162] = { -- The Red Moon
            {id = 1162, cost = 1, x = 99.94, y = 0.03, z = 113.34, b = 2013366},
        },
    },
	[1160] = -- Senatus
    {
        [958] = { -- Garlemald
            {id = 958, cost = 1, x = 12.04, y = 3.00, z = 79.43, b = 2013361},
        },
    },
	[1161] = -- Estinien's Chambers
    {
        [963] = { -- Radz-at-Han
            {id = 963, cost = 1, x = -0.01, y = 0.00, z = 5.28, b = 2013358},
        },
    },
	[1162] = -- The Red Moon
    {
        [959] = { -- to Mare Lamentorum
            {id = 959, cost = 1, x = -44.57, y = 112.67, z = 769.73, b = 2013363},
        },
		[1159] = { -- The Voidcast Dais
            {id = 1159, cost = 1, x = 61.98, y = 56.69, z = 477.25, b = 2013365},
        },
    },
	-- Dawntrail
	[1170] = -- Sunperch
    {
        [1185] = { 
            {id = 1185, cost = 1, x = 0, y = 2, z = -1, b = 2013923},
        },
    },
	[1171] = {
		[1191] = {
			[1] = {
				["b"] = 2013853;
				["cost"] = 1;
				["id"] = 1191;
				["requires"] = {
					["GetQuestInfo(4930,'step') >= 255 or QuestCompleted(4930)"] = true;
				};
				["x"] = 0.68126249313354;
				["y"] = 1;
				["z"] = 17.543689727783;
			};
		};
	};
	[1185] = -- Tuliyollal
    {
        [962] = { 
            {id = 962, cost = 1, x = 124, y = -17, z = 141, b = 1047501
                , requires = {
                    ["GetQuestInfo(4860,'step') >= 255 or QuestCompleted(4860)"] = true,
                },
			},
        },
        [1170] = { 
            {id = 1170, cost = 1, x = -189, y = 120, z = -367, b = 1047501
                , requires = {
                    ["GetQuestInfo(4919,'step') >= 255 or QuestCompleted(4919)"] = true,
                },
			},
        },
        [1187] = { 
            {id = 1187, cost = 1, x = -276.5, y = 0, z = 87.7, b = 1047751
                , requires = {
                    ["GetQuestInfo(4871,'step') >= 255 or QuestCompleted(4871)"] = true,
                },
			},
        },
        [1188] = { 
            {id = 1188, cost = 1, x = -293.9, y = 0, z = 129.9, h = -1.61
                , requires = {
                    ["GetQuestInfo(4865,'step') >= 255 or QuestCompleted(4865) and (not In(GetKozamaukaSection(ml_task_hub:CurrentTask().pos),2) or (HasQuest(4879) and GetQuestInfo(4879,'step') < 5) or not QuestCompleted(4879))"] = true,
                },
			},
            {id = 1188, cost = 1, x = 167, y = -17, z = 163, b = 1047478
                , requires = {
                    ["GetQuestInfo(4879,'step') >= 5 or QuestCompleted(4879) and In(GetKozamaukaSection(ml_task_hub:CurrentTask().pos),2)"] = true,
                },
			},
        },
        [1189] = { 
            {id = 1189, cost = 1, x = -426, y = 11, z = -13, b = 1048231
                , requires = {
                    ["GetQuestInfo(4897,'step') >= 3 or QuestCompleted(4897)"] = true,
                },
			},
        },
        [1190] = { 
            {id = 1190, cost = 1, x = 50, y = 48, z = -430, b = 1046791
                , requires = {
                    ["GetQuestInfo(4912,'step') >= 3 or QuestCompleted(4912)"] = true,
                },
			},
        },
		[1205] = {
			[1] = {
				["b"] = 1048375;
				["cost"] = 1;
				["id"] = 1205;
				["x"] = -166.857421875;
				["y"] = -14.999356269836;
				["z"] = 208.30078125;
				["i"] = 1; 
				["requires"] = {
					["QuestCompleted(4864)"] = true;
				};
			};
		};
		[1278] = { --Phantom Village
            [1] = {id = 1278, cost = 1, x = 206.32, y = -17.99, z = 63.31, b = 2014671,},
        },		
        [1269] = { --Phantom Village (Quest)
            [1] = {id = 1269, cost = 1, x = 206.32, y = -17.99, z = 63.31, b = 2014669,},
        },			
    },
	
	--Phantom Village (Quest)
	[1269] = {
        [1185] = { --Tuliyollal
            [1] = {id = 1185, cost = 1, x = 79.55, y = -11.25, z = 17.2, b = 2014670,},
        },		
	},
	
	
	--Phantom Village
	[1278] = {
        [1185] = { --Tuliyollal
            [1] = {id = 1185, cost = 1, x = 79.55, y = -11.25, z = 17.2, b = 2014670,},
        },		
	},
	-- Solution Nine
	[1186] = {
		[1191] = {
			[1] = {
				["cost"] = 1;
				["h"] = -0.0380539894104;
				["id"] = 1191;
				["requires"] = {
					["(HasQuest(4933) and GetQuestInfo(4933,'step') >= 3) or QuestCompleted(4933)"] = true;
				};
				["x"] = -0.22500441968441;
				["y"] = -6.0500049591064;
				["z"] = 297.81491088867;
			};
		};
		[1207] = {
			[1] = {
				["b"] = 1048083;
				["cost"] = 1;
				["id"] = 1207;
				["requires"] = {
					["HasQuest(4937) or QuestCompleted(4937)"] = true;
				};
				["x"] = 302.05236816406;
				["y"] = 51.199977874756;
				["z"] = 205.03540039062;
			};
		};
		-- Throne Room
		[1274] = {
			[1] = {
				["b"] = 1053870;
				["cost"] = 1;
				["id"] = 1274;
				["x"] = -70.79;
				["y"] = 42.81;
				["z"] = -543.21;
			};
		};
	};
	[1187] = -- Urqopacha
    {
        [1185] = { 
            {id = 1185, cost = 1, x = 659.5, y = -120, z = -451.4, h = 2.47},
        },
        [1188] = { 
            {id = 1188, cost = 1, x = 726, y = 73, z = 636, h = 1.35
                , requires = {
                    ["HasQuest(4889) or QuestCompleted(4889)"] = true,
                },
			},
        },
    },
	[1188] = -- Kozama'uka
    {
        [1185] = { 
            {id = 1185, cost = 1, x = -285.1, y = 13, z = -849.7, h = -3.08
                , requires = {
                    ["In(GetKozamaukaSection(Player.pos),1)"] = true,
                },
			},
            {id = 1185, cost = 1, x = 759, y = 114, z = 565, b = 1047479
                , requires = {
                    ["In(GetKozamaukaSection(Player.pos),2)"] = true,
                },
			},
        },
        [1187] = { 
            {id = 1187, cost = 1, x = -893, y = 142, z = 472, h = -1.58
                , requires = {
                    ["QuestCompleted(4888)"] = true,
                },
			},
        },
    },
	[1189] = -- Yak T'el
	{
        [1185] = { 
            {id = 1185, cost = 1, x = 28, y = 8, z = -666, b = 1048925},
        },
		[1222] = {
			[1] = {
				["b"] = 2013768;
				["cost"] = 1;
				["id"] = 1222;
				["requires"] = {
					["(HasQuest(4948) and GetQuestInfo(4948,'step') >= 5) or QuestCompleted(4848)"] = true;
				};
				["x"] = -827.26788330078;
				["y"] = -296.04034423828;
				["z"] = 877.53100585938;
			};
		};
    },
	[1190] = -- Shaaloani
	{
        [1185] = { 
            {id = 1185, cost = 1, x = 284, y = 16, z = 801, h = -0.03},
        },
        [1191] = { 
            {id = 1219, cost = 1, x = -652, y = 14, z = -691, h = -2.13
                , requires = {
                    ["GetQuestInfo(4926,'step') >= 255 or QuestCompleted(4926)"] = true,
                },
			},
        },
        [1219] = { 
            {id = 1219, cost = 1, x = -652, y = 14, z = -690, b = 1051420
                , requires = {
                    ["GetQuestInfo(4926,'step') == 3"] = true,
                },
			},
        },
    },
	[1191] = -- HF
	{
		[1171] = {
			[1] = {
				["b"] = 2014030;
				["cost"] = 1;
				["id"] = 1171;
				["requires"] = {
					["GetQuestInfo(4930,'step') >= 255 or QuestCompleted(4930)"] = true;
				};
				["x"] = 221.8203125;
				["y"] = 54.581420898438;
				["z"] = -693.38525390625;
			};
		};
		[1186] = {
			[1] = {
				["cost"] = 1;
				["h"] = 3.120600938797;
				["id"] = 1186;
				["requires"] = {
					["(HasQuest(4933) and GetQuestInfo(4933,'step') >= 3) or QuestCompleted(4933)"] = true;
				};
				["x"] = -293.05706787109;
				["y"] = 51.004890441895;
				["z"] = -862.35760498047;
			};
		};
        [1190] = { 
            {id = 1190, cost = 1, x = 654, y = 147, z = 753, h = 0.52},
        },
		[1220] = {
			[1] = {
				["b"] = 1048145;
				["cost"] = 1;
				["id"] = 1220;
				["requires"] = {
					["(HasQuest(4945) and GetQuestInfo(4945,'step') >= 4) or QuestCompleted(4945)"] = true;
				};
				["x"] = -614.19091796875;
				["y"] = -13.382202148438;
				["z"] = -567.52880859375;
			};
		};
		[1254] = { 
            {id = 1254, cost = 1, x = -614.71, y = -3.39, z = -510.70, b = 1052240},
		},
    },
	[1192] = {
		[1222] = {
			[1] = {
				["b"] = 2014060;
				["cost"] = 1;
				["id"] = 1222;
				["x"] = -0.015319819562137;
				["y"] = 107.22039794922;
				["z"] = 866.42156982422;
			};
		};
	};
	[1205] = {
		[1185] = {
			[1] = {
				["b"] = 2014367;
				["cost"] = 1;
				["id"] = 1185;
				["x"] = -202.50250244141;
				["y"] = -14.969177246094;
				["z"] = 292.40856933594;
			};
		};
	};
	-- Back Room
	[1207] = {  
		[1186] = {
			[1] = {
				["b"] = 2014102;
				["cost"] = 1;
				["id"] = 1186;
				["x"] = -0.01531982421875;
				["y"] = 0.99176025390625;
				["z"] = 16.037170410156;
			};
		};
		[1268] = {
			[1] = {
				["requires"] = {
					["not HasQuest(5299) and QuestCompleted(5250) and not QuestCompleted(5299)"] = true;
				};
				["b"] = 2014751;
				["cost"] = 1;
				["id"] = 1268;
				["x"] = -19.70;
				["y"] = 2.70;
				["z"] = -30.26;
			};
			[2] = {
				["requires"] = {
					["HasQuest(5299) or QuestCompleted(5299)"] = true;
				};
				["b"] = 2014673;
				["cost"] = 1;
				["id"] = 1268;
				["x"] = -19.70;
				["y"] = 2.70;
				["z"] = -30.26;
			};
		};
	};
	-- Break Room
	[1268] = {
		[1207] = {
			[1] = {
				["b"] = 2014672;
				["cost"] = 1;
				["id"] = 1207;
				["x"] = 17.19;
				["y"] = 0.94;
				["z"] = 8.08;
			};
		};
	};
	-- Throne Room
	[1274] = {
		[1186] = {
			[1] = {
				["b"] = 2014680;
				["cost"] = 1;
				["id"] = 1186;
				["x"] = -0.02;
				["y"] = 2.70;
				["z"] = 73.20;
			};
		};
	};
	[1219] = -- Shaaloani
	{
        [1190] = { 
            {id = 1190, cost = 1, x = 0, y = 0, z = 657, b = 2013884},
        },
    },
	[1220] = {
		[1191] = {
			[1] = {
				["b"] = 2014101;
				["cost"] = 1;
				["id"] = 1191;
				["x"] = 100.00890350342;
				["y"] = 1;
				["z"] = 141.67939758301;
			};
		};
	};
	[1222] = {
		[1189] = {
			[1] = {
				["b"] = 2014059;
				["cost"] = 1;
				["id"] = 1189;
				["x"] = -0.07635498046875;
				["y"] = 0.99176025390625;
				["z"] = -8.2857055664062;
			};
		};
		[1192] = {
			[1] = {
				["b"] = 2013769;
				["cost"] = 1;
				["id"] = 1192;
				["x"] = 0.07623291015625;
				["y"] = 1.1749267578125;
				["z"] = -87.937744140625;
			};
		};
	};
	[1254] = 
	{
        [1191] = { 
            {id = 1191, cost = 1, x = 123.83, y = 13.57, z = -82.69, b = 2014479},
        },
    },
	
}-- set reference for mesh mgr

ffxiv_aethercurrent_data = {
	[397] = {
		{ id = 6, aethid = 2005536, x = 402, y = 191, z = 561},
		{ id = 8, aethid = 2006187, x = 424, y = 164, z = -536},
		{ id = 10, aethid = 2006189, x = -332, y = 126, z = -29},
		{ id = 11, aethid = 2006190, x = -659, y = 135, z = -376},
	},
	[398] = {
		{ id = 6, aethid = 2006195, x = 765, y = -15, z = 289},
		{ id = 8, aethid = 2006197, x = 433, y = -47, z = -286},
		{ id = 12, aethid = 2006201, x = -480, y = -5, z = -425},
		{ id = 15, aethid = 2006204, x = 406, y = -90, z = 686},
	},
	[399] = {
		{ id = 6, aethid = 2006205, x = 729, y = 135, z = 150},
		{ id = 9, aethid = 2006208, x = 98, y = 73, z = -174},
		{ id = 11, aethid = 2006210, x = -487, y = 144, z = -285,
			requires = function () return (QuestCompleted(1658) and (GetHinterlandsSection(Player.pos) == 1)) end,
		},  
		{ id = 15, aethid = 2006214, x = -452, y = 138, z = 678,
			requires = function () return (QuestCompleted(1658) and (GetHinterlandsSection(Player.pos) == 1)) end,
		},  
	},
	[400] = {
		{ id = 7, aethid = 2006216, x = 421, y = -43, z = 661},
		{ id = 8, aethid = 2006217, x = -93, y = -6.7, z = 223},
		{ id = 9, aethid = 2006218, x = -775, y = 123, z = 243},
		{ id = 15, aethid = 2006224, x = 340, y = -25, z = -130},
	},
	[401] = {
		{ id = 9, aethid = 2006228, x = -747, y = -57, z = 163, 
			requires = function () return QuestCompleted(1643) end,
		},
		{ id = 10, aethid = 2006229, x = -759, y = -9, z = -110, 
			requires = function () return QuestCompleted(1643) end,
		},
		{ id = 12, aethid = 2006231, x = -180, y = -14, z = -543, 
			requires = function () return QuestCompleted(1643) end,
		},
		{ id = 15, aethid = 2006234, x = -564, y = -36, z = -349, 
			requires = function () return QuestCompleted(1643) end,
		},
	},
	[612] = {
		{ id = 6, aethid = 2007965, x = -487.266, y = 76.726, z = -249.561}, 
		{ id = 8, aethid = 2007967, x = 155.842, y = 53.3515, z = -499.431}, 
		{ id = 12, aethid = 2007971, x = 322.591, y = 88.9832, z = 10.5134,
			requires = function () return QuestCompleted(2530) end,
		},  
		{ id = 13, aethid = 2007972, x = 743.033, y = 181.007, z = -214.052,
			requires = function () return QuestCompleted(2530) end,
		},  
	},
	[613] = {
		{ id = 6, aethid = 2007995, x = 423.562, y = 15.8327, z = 801.565},
		{ id = 10, aethid = 2007999, x = 21.2863, y = 24.0112, z = -623.621},
		{ id = 13, aethid = 2008002, x = 694.769, y = 1.91278, z = -53.4642},
		{ id = 15, aethid = 2008004, x = -805.781, y = 36.5798, z = 235.215,
			requires = function () return QuestCompleted(2484) end,
		},  -- swim required
	},
	[614] = {
		{ id = 8, aethid = 2008007, x = 497.337, y = 16.3552, z = 402.518},
		{ id = 9, aethid = 2008008, x = 163.583, y = 144.57, z = -11.5206},
		{ id = 12, aethid = 2008011, x = 457.528, y = 32.3773, z = 822.43},
		{ id = 14, aethid = 2008013, x = -97.4191, y = 13.2794, z = 563.723},
	},
	[620] = { 
		{ id = 7, aethid = 2007976, x = 202.874, y = 133.925, z = -753.11},
		{ id = 9, aethid = 2007978, x = -271.229, y = 157.942, z = -280.232},
		{ id = 12, aethid = 2007981, x = -485.211, y = 304.567, z = 247.414,
			requires = function () return HasQuest(2534) or QuestCompleted(2534) end,
		}, 
		{ id = 15, aethid = 2007984, x = 146.627, y = 303.757, z = 460.821,
			requires = function () return QuestCompleted(2537) end,
		},   -- gated
	},
	[621] = { 
		{ id = 8, aethid = 2007987, x = -380.191, y = 10.0606, z = 16.9195},
		{ id = 13, aethid = 2007992, x = 109.608, y = 42.0051, z = 788.66},
		{ id = 14, aethid = 2007993, x = 261.534, y = 78.4, z = 69.962},
		{ id = 15, aethid = 2007994, x = 683.406, y = 70, z = 521.172,
			requires = function () return QuestCompleted(2550) end,
		},  
	},
	[622] = {
		{ id = 6, aethid = 2008015, x = 570.277, y = -19.508, z = 438.175},
		{ id = 8, aethid = 2008017, x = 232.005, y = 93.3919, z = -515.794},
		{ id = 10, aethid = 2008019, x = 105.608, y = 116.043, z = -49.6987, 
			requires = function () return QuestCompleted(2507) end,
		}, 
		{ id = 13, aethid = 2008022, x = -693.83, y = 7.2632, z = 658.899},
	},
	-- SHB
	[813] = {
		{ id = 6, aethid = 2010024, x = 554.28, y = 17.9501, z = 352.102},
		{ id = 10, aethid = 2010028, x = 613.245, y = 24.0201, z = -231.128},
		{ id = 13, aethid = 2010031, x = -149.798, y = 15.2812, z = -102.495},
		{ id = 14, aethid = 2010032, x = -619.637, y = 51.5011, z = -199.096},
	},
	[814] = {
		{ id = 6, aethid = 2010034, x = 650, y = 0, z = 556},
		{ id = 10, aethid = 2010038, x = -651.165, y = 1.5, z = 588.412},
		{ id = 13, aethid = 2010041, x = 623.752, y = 285.942, z = -555.25, 
			requires = function () return QuestCompleted(3634) end,
		},
		{ id = 14, aethid = 2010042, x = -62, y = 345, z = -16, 
			requires = function () return QuestCompleted(3634) end,
		},
	},
	[815] = {
		{ id = 6, aethid = 2010044, x = 446.079, y = -60, z = -523},
		{ id = 9, aethid = 2010047, x = 344, y = -66, z = 538},
		{ id = 12, aethid = 2010050, x = -343, y = 47, z = -235, 
			requires = function () return QuestCompleted(3609) and GetAhmAraengSection(Player.pos) == 2 end,
		}, 
		{ id = 14, aethid = 2010052, x = 158, y = -61, z = 674, 
			requires = function () return QuestCompleted(3619) end,
		}, 
	},
	[816] = {
		{ id = 8, aethid = 2010056, x = -231, y = 4, z = 160},
		{ id = 11, aethid = 2010059, x = 12, y = 111, z = -851, 
			requires = function () return QuestCompleted(3313) end,
		},
		{ id = 14, aethid = 2010062, x = 432, y = 90, z = -770, 
			requires = function () return QuestCompleted(3313) end,
		},
		{ id = 15, aethid = 2010063, x = -9, y = 89, z = -247, 
			requires = function () return QuestCompleted(3313) end,
		},
	},
	[817] = {
		{ id = 6, aethid = 2010064, x = -405, y = 7, z = 506},
		{ id = 8, aethid = 2010066, x = -141.571, y = -0.88243, z = 49.7631},
		{ id = 11, aethid = 2010069, x = 338, y = 24, z = 203, 
			requires = function () return QuestCompleted(3334) end,
		},
		{ id = 15, aethid = 2010073, x = 681.139, y = -39.1963, z = -262.754, 
			requires = function () return QuestCompleted(3334) end,
		},
	},
	[818] = {
		{ id = 6, aethid = 2010074, x = 358, y = 396, z = -715},
		{ id = 8, aethid = 2010076, x = 50, y = 380, z = -512},
		{ id = 11, aethid = 2010079, x = 339, y = 298, z = -280},
		{ id = 15, aethid = 2010083, x = -774, y = 63, z = -97, 
			requires = function () return QuestCompleted(3651) end,
		},
	},
	[956] = {
		{ id = 6, aethid = 2011980, x = 346.529, y = 209.352, z = -767.739},
		{ id = 7, aethid = 2011981, x = 748.562, y = 106.712, z = 66.7589},
		{ id = 8, aethid = 2011985, x = -547.726, y = -18.0226, z = 661.873, 
			requires = function () return QuestCompleted(4441) end,
		},
		{ id = 9, aethid = 2011986, x = -128.069, y = -20.5234, z = 676.722, 
		requires = function () return QuestCompleted(4441) end,
		},
		{ id = 10, aethid = 2011982, x = -316.276, y = 79.7614, z = -395.312},
		{ id = 11, aethid = 2011983, x = 32.3334, y = 72.8314, z = -286.272},
		{ id = 12, aethid = 2011984, x = 497.115, y = 73.4197, z = -267.231}, -- confirmed
		{ id = 13, aethid = 2011987, x = -176.381, y = -10.101, z = -242.245, 
			requires = function () return QuestCompleted(4441) end,
		},
		{ id = 14, aethid = 2011988, x = -505.14, y = -21.8212, z = -122.596, 
			requires = function () return QuestCompleted(4441) end,
		},
		{ id = 15, aethid = 2011989, x = 46.2823, y = -29.7999, z = 178.875, 
			requires = function () return QuestCompleted(4441) end,
		},
	},
	[957] = {
		{ id = 6, aethid = 2011990, x = -176.104, y = 21.5304, z = 537.835},
		{ id = 7, aethid = 2011991, x = -49.2675, y = 94.0719, z = -710.757},
		{ id = 8, aethid = 2011995, x = 118.474, y = 4.9335, z = -343.866, 
            requires = function () return QuestCompleted(4412) end,
        },
		{ id = 9, aethid = 2011996, x = 550.018, y = 25.4763, z = -159.076, 
            requires = function () return QuestCompleted(4412) end,
        },
		{ id = 10, aethid = 2011992, x = 303.921, y = 0.280689, z = 473.656},
		{ id = 11, aethid = 2011993, x = -479.439, y = 72.9045, z = -561.809},
		{ id = 12, aethid = 2011994, x = -114.46, y = 87.0873, z = -288.29},
		{ id = 13, aethid = 2011997, x = 93.1188, y = 36.6839, z = -447.865, 
            requires = function () return QuestCompleted(4412) end,
        },
		{ id = 14, aethid = 2011998, x = 294.402, y = 4.0999, z = 425.122, 
            requires = function () return QuestCompleted(4412) end,
        },
		{ id = 15, aethid = 2011999, x = 53.1891, y = 11.3868, z = 187.406, 
            requires = function () return QuestCompleted(4412) end,
        },
	},
	[958] = {						
		{ id = 6, aethid = 2012000, x = -184.222, y = 31.9371, z = 423.606},
		{ id = 7, aethid = 2012001, x = 194.816, y = -12.8414, z = 644.311},
		{ id = 8, aethid = 2012002, x = 83.094, y = 1.52583, z = 102.017},
		{ id = 9, aethid = 2012003, x = 405.295, y = -2.24316, z = 520.317},
		{ id = 10, aethid = 2012004, x = -516.088, y = 42.4699, z = 67.8378},
		{ id = 11, aethid = 2012005, x = 382.184, y = 25.9005, z = -482.196},
		{ id = 12, aethid = 2012006, x = -602.03, y = 34.3171, z = -325.853},
		{ id = 13, aethid = 2012007, x = 79.9136, y = 37.8851, z = -518.181},
		{ id = 14, aethid = 2012008, x = 134.928, y = 14.3984, z = -172.249},
		{ id = 15, aethid = 2012009, x = -144.924, y = 17.5785, z = -420.515},
	},
	[959] = {
		{ id = 6, aethid = 2012010, x = 42.5905, y = 124.015, z = -167.03, 
            requires = function () return QuestCompleted(4400) end,
        },
		{ id = 7, aethid = 2012011, x = -482.744, y = -154.954, z = -595.709, 
            requires = function () return QuestCompleted(4400) end,
        },
		{ id = 8, aethid = 2012012, x = 316.401, y = -154.978, z = -595.519, 
            requires = function () return QuestCompleted(4400) end,
        },
		{ id = 9, aethid = 2012013, x = 29.1046, y = -47.739, z = -550.408, 
            requires = function () return QuestCompleted(4400) end,
        },
		{ id = 10, aethid = 2012014, x = -128.002, y = 66.3504, z = -68.2408, 
            requires = function () return QuestCompleted(4400) end,
        },
		{ id = 11, aethid = 2012015, x = 591.378, y = 149.356, z = 114.936, 
            requires = function () return QuestCompleted(4400) end,
        },
		{ id = 12, aethid = 2012016, x = 388.358, y = 99.9167, z = 306.071, 
            requires = function () return QuestCompleted(4400) end,
        },
		{ id = 13, aethid = 2012017, x = 652.979, y = -160.693, z = -405.081, 
            requires = function () return QuestCompleted(4400) end,
        },
		{ id = 14, aethid = 2012018, x = -733.617, y = -139.662, z = -733.28, 
            requires = function () return QuestCompleted(4400) end,
        },
		{ id = 15, aethid = 2012019, x = 21.7081, y = -133.5, z = -385.731, 
            requires = function () return QuestCompleted(4400) end,
        },
	},
	[961] = {
        { id = 6, aethid = 2012020, x = 628.239, y = 8.31683, z = 107.902, 
            requires = function () return QuestCompleted(4421) end,
        },
        { id = 7, aethid = 2012021, x = -754.753, y = -36.0114, z = 411.134, 
            requires = function () return QuestCompleted(4421) end,
        },
        { id = 8, aethid = 2012022, x = 151.667, y = 7.66582, z = 2.548, 
            requires = function () return QuestCompleted(4421) end,
        },
        { id = 9, aethid = 2012023, x = -144.539, y = -26.2298, z = 551.52, 
            requires = function () return QuestCompleted(4421) end,
        },
        { id = 10, aethid = 2012024, x = -481.407, y = -28.5802, z = 490.562, 
            requires = function () return QuestCompleted(4421) end,
        },
        { id = 11, aethid = 2012025, x = -402.921, y = 327.757, z = -691.323, 
            requires = function () return QuestCompleted(4433) end,
        },
        { id = 12, aethid = 2012026, x = -555.623, y = 158.118, z = 172.429, 
            requires = function () return QuestCompleted(4429) end,
        },
        { id = 13, aethid = 2012027, x = -392.05, y = 173.724, z = -293.599, 
            requires = function () return QuestCompleted(4429) end,
        },
        { id = 14, aethid = 2012028, x = -761.711, y = 160.011, z = -108.987, 
            requires = function () return QuestCompleted(4429) end,
        },
        { id = 15, aethid = 2012029, x = -255.512, y = 143.079, z = -36.9727, 
            requires = function () return QuestCompleted(4429) end,
        },
   	},
	[960] = {
		{ id = 6, aethid = 2012030, x = -333.54, y = 270.851, z = -361.487, 
            requires = function () return QuestCompleted(4455) end,
        },
		{ id = 7, aethid = 2012031, x = 13.118, y = 275.566, z = -756.396, 
            requires = function () return QuestCompleted(4455) end,
        },
		{ id = 8, aethid = 2012032, x = 661.785, y = 439.977, z = 411.757, 
            requires = function () return QuestCompleted(4459) end,
        },
		{ id = 9, aethid = 2012033, x = 539.271, y = 438.001, z = 239.404, 
            requires = function () return QuestCompleted(4459) end,
        },
		{ id = 10, aethid = 2012034, x = 424.573, y = 283.384, z = -679.755, 
            requires = function () return QuestCompleted(4455) end,
        },
		{ id = 11, aethid = 2012035, x = -238.789, y = 320.386, z = -295.141, 
            requires = function () return QuestCompleted(4455) end,
        },
		{ id = 12, aethid = 2012036, x = -385.221, y = 262.517, z = -629.85, 
            requires = function () return QuestCompleted(4455) end,
        },
		{ id = 13, aethid = 2012037, x = 751.878, y = 439.977, z = 357.899, 
            requires = function () return QuestCompleted(4459) end,
        },
		{ id = 14, aethid = 2012038, x = 637.195, y = 439.241, z = 289.665, 
            requires = function () return QuestCompleted(4459) end,
        },
		{ id = 15, aethid = 2012039, x = 567.498, y = 440.93, z = 402.135, 
            requires = function () return QuestCompleted(4459) end,
        },
	},
}
ffxiv_aethercurrent_dataDT = {
	[397] = {
		{ id = 6, aethid = 2005536, x = 402, y = 191, z = 561},
		{ id = 8, aethid = 2006187, x = 424, y = 164, z = -536},
		{ id = 10, aethid = 2006189, x = -332, y = 126, z = -29},
		{ id = 11, aethid = 2006190, x = -659, y = 135, z = -376},
	},
	[398] = {
		{ id = 6, aethid = 2006195, x = 765, y = -15, z = 289},
		{ id = 8, aethid = 2006197, x = 433, y = -47, z = -286},
		{ id = 12, aethid = 2006201, x = -480, y = -5, z = -425},
		{ id = 15, aethid = 2006204, x = 406, y = -90, z = 686},
	},
	[399] = {
		{ id = 6, aethid = 2006205, x = 729, y = 135, z = 150},
		{ id = 9, aethid = 2006208, x = 98, y = 73, z = -174},
		{ id = 11, aethid = 2006210, x = -487, y = 144, z = -285,
			requires = function () return (QuestCompleted(1658) and (GetHinterlandsSection(Player.pos) == 1)) end,
		},  
		{ id = 15, aethid = 2006214, x = -452, y = 138, z = 678,
			requires = function () return (QuestCompleted(1658) and (GetHinterlandsSection(Player.pos) == 1)) end,
		},  
	},
	[400] = {
		{ id = 7, aethid = 2006216, x = 421, y = -43, z = 661},
		{ id = 8, aethid = 2006217, x = -93, y = -6.7, z = 223},
		{ id = 9, aethid = 2006218, x = -775, y = 123, z = 243},
		{ id = 15, aethid = 2006224, x = 340, y = -25, z = -130},
	},
	[401] = {
		{ id = 9, aethid = 2006228, x = -747, y = -57, z = 163, 
			requires = function () return QuestCompleted(1643) end,
		},
		{ id = 10, aethid = 2006229, x = -759, y = -9, z = -110, 
			requires = function () return QuestCompleted(1643) end,
		},
		{ id = 12, aethid = 2006231, x = -180, y = -14, z = -543, 
			requires = function () return QuestCompleted(1643) end,
		},
		{ id = 15, aethid = 2006234, x = -564, y = -36, z = -349, 
			requires = function () return QuestCompleted(1643) end,
		},
	},
	[612] = {
		{ id = 6, aethid = 2007965, x = -487.266, y = 76.726, z = -249.561}, 
		{ id = 8, aethid = 2007967, x = 155.842, y = 53.3515, z = -499.431}, 
		{ id = 12, aethid = 2007971, x = 322.591, y = 88.9832, z = 10.5134,
			requires = function () return QuestCompleted(2530) end,
		},  
		{ id = 13, aethid = 2007972, x = 743.033, y = 181.007, z = -214.052,
			requires = function () return QuestCompleted(2530) end,
		},  
	},
	[613] = {
		{ id = 6, aethid = 2007995, x = 423.562, y = 15.8327, z = 801.565},
		{ id = 10, aethid = 2007999, x = 21.2863, y = 24.0112, z = -623.621},
		{ id = 13, aethid = 2008002, x = 694.769, y = 1.91278, z = -53.4642},
		{ id = 15, aethid = 2008004, x = -805.781, y = 36.5798, z = 235.215,
			requires = function () return QuestCompleted(2484) end,
		},  -- swim required
	},
	[614] = {
		{ id = 8, aethid = 2008007, x = 497.337, y = 16.3552, z = 402.518},
		{ id = 9, aethid = 2008008, x = 163.583, y = 144.57, z = -11.5206},
		{ id = 12, aethid = 2008011, x = 457.528, y = 32.3773, z = 822.43},
		{ id = 14, aethid = 2008013, x = -97.4191, y = 13.2794, z = 563.723},
	},
	[620] = { 
		{ id = 7, aethid = 2007976, x = 202.874, y = 133.925, z = -753.11},
		{ id = 9, aethid = 2007978, x = -271.229, y = 157.942, z = -280.232},
		{ id = 12, aethid = 2007981, x = -485.211, y = 304.567, z = 247.414,
			requires = function () return HasQuest(2534) or QuestCompleted(2534) end,
		}, 
		{ id = 15, aethid = 2007984, x = 146.627, y = 303.757, z = 460.821,
			requires = function () return QuestCompleted(2537) end,
		},   -- gated
	},
	[621] = { 
		{ id = 8, aethid = 2007987, x = -380.191, y = 10.0606, z = 16.9195},
		{ id = 13, aethid = 2007992, x = 109.608, y = 42.0051, z = 788.66},
		{ id = 14, aethid = 2007993, x = 261.534, y = 78.4, z = 69.962},
		{ id = 15, aethid = 2007994, x = 683.406, y = 70, z = 521.172,
			requires = function () return QuestCompleted(2550) end,
		},  
	},
	[622] = {
		{ id = 6, aethid = 2008015, x = 570.277, y = -19.508, z = 438.175},
		{ id = 8, aethid = 2008017, x = 232.005, y = 93.3919, z = -515.794},
		{ id = 10, aethid = 2008019, x = 105.608, y = 116.043, z = -49.6987, 
			requires = function () return QuestCompleted(2507) end,
		}, 
		{ id = 13, aethid = 2008022, x = -693.83, y = 7.2632, z = 658.899},
	},
	-- SHB
	[813] = {
		{ id = 6, aethid = 2010024, x = 554.28, y = 17.9501, z = 352.102},
		{ id = 10, aethid = 2010028, x = 613.245, y = 24.0201, z = -231.128},
		{ id = 13, aethid = 2010031, x = -149.798, y = 15.2812, z = -102.495},
		{ id = 14, aethid = 2010032, x = -619.637, y = 51.5011, z = -199.096},
	},
	[814] = {
		{ id = 6, aethid = 2010034, x = 650, y = 0, z = 556},
		{ id = 10, aethid = 2010038, x = -651.165, y = 1.5, z = 588.412},
		{ id = 13, aethid = 2010041, x = 623.752, y = 285.942, z = -555.25, 
			requires = function () return QuestCompleted(3634) end,
		},
		{ id = 14, aethid = 2010042, x = -62, y = 345, z = -16, 
			requires = function () return QuestCompleted(3634) end,
		},
	},
	[815] = {
		{ id = 6, aethid = 2010044, x = 446.079, y = -60, z = -523},
		{ id = 9, aethid = 2010047, x = 344, y = -66, z = 538},
		{ id = 12, aethid = 2010050, x = -343, y = 47, z = -235, 
			requires = function () return QuestCompleted(3609) and GetAhmAraengSection(Player.pos) == 2 end,
		}, 
		{ id = 14, aethid = 2010052, x = 158, y = -61, z = 674, 
			requires = function () return QuestCompleted(3619) end,
		}, 
	},
	[816] = {
		{ id = 8, aethid = 2010056, x = -231, y = 4, z = 160},
		{ id = 11, aethid = 2010059, x = 12, y = 111, z = -851, 
			requires = function () return QuestCompleted(3313) end,
		},
		{ id = 14, aethid = 2010062, x = 432, y = 90, z = -770, 
			requires = function () return QuestCompleted(3313) end,
		},
		{ id = 15, aethid = 2010063, x = -9, y = 89, z = -247, 
			requires = function () return QuestCompleted(3313) end,
		},
	},
	[817] = {
		{ id = 6, aethid = 2010064, x = -405, y = 7, z = 506},
		{ id = 8, aethid = 2010066, x = -141.571, y = -0.88243, z = 49.7631},
		{ id = 11, aethid = 2010069, x = 338, y = 24, z = 203, 
			requires = function () return QuestCompleted(3334) end,
		},
		{ id = 15, aethid = 2010073, x = 681.139, y = -39.1963, z = -262.754, 
			requires = function () return QuestCompleted(3334) end,
		},
	},
	[818] = {
		{ id = 6, aethid = 2010074, x = 358, y = 396, z = -715},
		{ id = 8, aethid = 2010076, x = 50, y = 380, z = -512},
		{ id = 11, aethid = 2010079, x = 339, y = 298, z = -280},
		{ id = 15, aethid = 2010083, x = -774, y = 63, z = -97, 
			requires = function () return QuestCompleted(3651) end,
		},
	},
	[956] = {
		{ id = 6, aethid = 2011980, x = 346.529, y = 209.352, z = -767.739},
		{ id = 7, aethid = 2011981, x = 748.562, y = 106.712, z = 66.7589},
		{ id = 8, aethid = 2011985, x = -547.726, y = -18.0226, z = 661.873, 
			requires = function () return QuestCompleted(4441) end,
		},
		{ id = 9, aethid = 2011986, x = -128.069, y = -20.5234, z = 676.722, 
		requires = function () return QuestCompleted(4441) end,
		},
	},
	[957] = {
		{ id = 6, aethid = 2011990, x = -176.104, y = 21.5304, z = 537.835},
		{ id = 7, aethid = 2011991, x = -49.2675, y = 94.0719, z = -710.757},
		{ id = 8, aethid = 2011995, x = 118.474, y = 4.9335, z = -343.866, 
            requires = function () return QuestCompleted(4412) end,
        },
		{ id = 9, aethid = 2011996, x = 550.018, y = 25.4763, z = -159.076, 
            requires = function () return QuestCompleted(4412) end,
        },
	},
	[958] = {						
		{ id = 6, aethid = 2012000, x = -184.222, y = 31.9371, z = 423.606},
		{ id = 7, aethid = 2012001, x = 194.816, y = -12.8414, z = 644.311},
		{ id = 11, aethid = 2012005, x = 382.184, y = 25.9005, z = -482.196},
		{ id = 12, aethid = 2012006, x = -602.03, y = 34.3171, z = -325.853},
	},
	[959] = {
		{ id = 6, aethid = 2012010, x = 42.5905, y = 124.015, z = -167.03, 
            requires = function () return QuestCompleted(4400) end,
        },
		{ id = 7, aethid = 2012011, x = -482.744, y = -154.954, z = -595.709, 
            requires = function () return QuestCompleted(4400) end,
        },
		{ id = 8, aethid = 2012012, x = 316.401, y = -154.978, z = -595.519, 
            requires = function () return QuestCompleted(4400) end,
        },
		{ id = 9, aethid = 2012013, x = 29.1046, y = -47.739, z = -550.408, 
            requires = function () return QuestCompleted(4400) end,
        },
		},
	[961] = {
        { id = 6, aethid = 2012020, x = 628.239, y = 8.31683, z = 107.902, 
            requires = function () return QuestCompleted(4421) end,
        },
        { id = 7, aethid = 2012021, x = -754.753, y = -36.0114, z = 411.134, 
            requires = function () return QuestCompleted(4421) end,
        },
        { id = 11, aethid = 2012025, x = -402.921, y = 327.757, z = -691.323, 
            requires = function () return QuestCompleted(4433) end,
        },
        { id = 12, aethid = 2012026, x = -555.623, y = 158.118, z = 172.429, 
            requires = function () return QuestCompleted(4429) end,
        },
    },
	[960] = {
		{ id = 6, aethid = 2012030, x = -333.54, y = 270.851, z = -361.487, 
            requires = function () return QuestCompleted(4455) end,
        },
		{ id = 7, aethid = 2012031, x = 13.118, y = 275.566, z = -756.396, 
            requires = function () return QuestCompleted(4455) end,
        },
		{ id = 8, aethid = 2012032, x = 661.785, y = 439.977, z = 411.757, 
            requires = function () return QuestCompleted(4459) end,
        },
		{ id = 9, aethid = 2012033, x = 539.271, y = 438.001, z = 239.404, 
            requires = function () return QuestCompleted(4459) end,
        },
	},
	[1187] = {						
		{ id = 6, aethid = 2013924, x = 353.57, y = -107.702, z = -238.8}, -- ok
		{ id = 7, aethid = 2013925, x = -458.305, y = -29.6484, z = -493.919},
		{ id = 8, aethid = 2013929, x = -198.46, y = 23.1426, z = -56.54, -- ok
			requires = function () return QuestCompleted(4889) end,
		},
		{ id = 9, aethid = 2013930, x = -812.893, y = 57.4816, z = 105.509, -- ok
			requires = function () return QuestCompleted(4889) end,
		},
		{ id = 10, aethid = 2013926, x = -202.8, y = -72.1271, z = -199},
		{ id = 11, aethid = 2013927, x = 414.78, y = -141.037, z = -681},
		{ id = 12, aethid = 2013928, x = -134.576, y = -93.0551, z = -582.912},
		{ id = 13, aethid = 2013931, x = 70.1898, y = 0.658536, z = 746.44, -- ok
			requires = function () return QuestCompleted(4889) end,
		},
		{ id = 14, aethid = 2013932, x = 368.36, y = 61.0765, z = -9.23, -- ok
			requires = function () return QuestCompleted(4889) end,
		},
		{ id = 15, aethid = 2013933, x = 398.81, y = 86.0047, z = 261.39, -- ok
			requires = function () return QuestCompleted(4889) end,
		},
	},
	[1188] = {		
		{ id = 6, aethid = 2013934, x = 299.51, y = 1.41398, z = -688.42},
		{ id = 7, aethid = 2013935, x = -599.553, y = 5.1607, z = -179.443}, -- ok
		{ id = 8, aethid = 2013939, x = -294.179, y = 110.762, z = 640.009},
		{ id = 9, aethid = 2013940, x = 48.9754, y = 111.338, z = 287.171, -- ok
			requires = function () return QuestCompleted(4879) end,
		},
		{ id = 10, aethid = 2013936, x = -638.039, y = 6.57127, z = -486.501}, -- ok
		{ id = 11, aethid = 2013937, x = 918.152, y = 10.1397, z = -404.091},
		{ id = 12, aethid = 2013938, x = 516.83, y = 17.9898, z = -348.03},
		{ id = 13, aethid = 2013941, x = -754.104, y = 138.692, z = 122.687, -- ok
			requires = function () return QuestCompleted(4879) end,
		},
		{ id = 14, aethid = 2013942, x = 130.47, y = 115.174, z = 522.93, -- ok
			requires = function () return QuestCompleted(4879) end,
		},
		{ id = 15, aethid = 2013943, x = 485.92, y = 121.404, z = 831.311, -- ok
			requires = function () return QuestCompleted(4879) end,
		},
	},
	[1189] = {						
		{ id = 6, aethid = 2013944, x = -114.388, y = 5.86803, z = -527.111},
		{ id = 7, aethid = 2013945, x = 416.08, y = 15.5309, z = -544.98},
		{ id = 8, aethid = 2013949, x = -114.32, y = -212.192, z = 623.79,
			requires = function () return QuestCompleted(4903) end,
		},
		{ id = 9, aethid = 2013950, x = 39.3742, y = -158.612, z = -2.31141,
			requires = function () return QuestCompleted(4903) end,
		},
		{ id = 10, aethid = 2013946, x = -550.591, y = -4.35479, z = -137.652},
		{ id = 11, aethid = 2013947, x = -184.71, y = 22.9362, z = -751.675},
		{ id = 12, aethid = 2013948, x = 610.773, y = 9.62139, z = 233.051},
		{ id = 13, aethid = 2013951, x = -676.539, y = -163.973, z = 236.164,
			requires = function () return QuestCompleted(4903) end,
		},
		{ id = 14, aethid = 2013952, x = 205.188, y = -193.591, z = 160.998,
			requires = function () return QuestCompleted(4903) end,
		},
		{ id = 15, aethid = 2013953, x = 747.188, y = -176.4, z = 712.672,
			requires = function () return QuestCompleted(4903) end,
		},
	},
	[1190] = {						
		{ id = 6, aethid = 2013954, x = 296.071, y = 2.39316, z = 504.021},
		{ id = 7, aethid = 2013955, x = -709.42, y = 33.4075, z = -80.3693},
		{ id = 8, aethid = 2013959, x = -63.2181, y = 18.8507, z = -174.853},
		{ id = 9, aethid = 2013960, x = 380.321, y = -16.9657, z = -508.157},
		{ id = 10, aethid = 2013956, x = -602.93, y = 37.75, z = -352.377},
		{ id = 11, aethid = 2013957, x = -192.187, y = 36.6847, z = -53.1777},
		{ id = 12, aethid = 2013958, x = -620.361, y = -9.0571, z = 323.397},
		{ id = 13, aethid = 2013961, x = 645.594, y = -11.7386, z = -417.655},
		{ id = 14, aethid = 2013962, x = 183.905, y = 11.9269, z = -59.3121},
		{ id = 15, aethid = 2013963, x = 658.289, y = 21.0219, z = 82.9938},
	},
	[1191] = {						
		{ id = 6, aethid = 2013964, x = 397.89, y = 145.347, z = 224.23},--
		{ id = 7, aethid = 2013965, x = 204.578, y = 58.1954, z = -678.492},
		{ id = 8, aethid = 2013969, x = -585.41, y = 20.1695, z = -469.43},
		{ id = 9, aethid = 2013970, x = -600.09, y = 2.21695, z = 267.44},
		{ id = 10, aethid = 2013966, x = 77.55, y = 93.1042, z = -144.94},
		{ id = 11, aethid = 2013967, x = 606.856, y = 127.574, z = -190.36},
		{ id = 12, aethid = 2013968, x = 686, y = 139.201, z = -516.533},
		{ id = 13, aethid = 2013971, x = -286.15, y = 59.4742, z = -263.62},--
		{ id = 14, aethid = 2013972, x = -28.99, y = 71.4324, z = 335.38},
		{ id = 15, aethid = 2013973, x = -457.64, y = -13.3964, z = 693.13},
	},
	[1192] = {						
		 -- Section 2
		{ id = 6, aethid = 2013974, x = -698.848, y = 1.00028, z = 472.007, 
			requires = function () return (HasQuest(4949) and GetQuestInfo(4949,'step') > 2) or QuestCompleted(4949) end,
		},
		-- Section 3
		{ id = 7, aethid = 2013975, x = 753.37, y = 45.0924, z = 347.051, 
			requires = function () return (HasQuest(4951) and GetQuestInfo(4951,'step') > 1) or QuestCompleted(4951) end,
		}, 
		-- Section 4
		{ id = 8, aethid = 2013979, x = 509.7, y = 36.9993, z = -648.81, 
            requires = function () return (HasQuest(4953) and GetQuestInfo(4953,'step') >= 2) or QuestCompleted(4953) end,
        },
		-- Section 5
		{ id = 9, aethid = 2013980, x = -559.59, y = -6.00049, z = -508.52, 
            requires = function () return (HasQuest(4956) and GetQuestInfo(4956,'step') >= 3) or QuestCompleted(4956) end,
        }, 
		-- Section 2
		{ id = 10, aethid = 2013976, x = -516.675, y = 0.0500011, z = 681.003, 
			requires = function () return (HasQuest(4949) and GetQuestInfo(4949,'step') > 2) or QuestCompleted(4949) end,
		},
		--Section 3
		{ id = 11, aethid = 2013977, x = 232.36, y = 0.000501633, z = 544.51, 
			requires = function () return (HasQuest(4951) and GetQuestInfo(4951,'step') > 1) or QuestCompleted(4951) end,
		}, 
	    -- Section 3
		{ id = 12, aethid = 2013978, x = 627.534, y = 9.05097, z = 637.736, 
			requires = function () return (HasQuest(4951) and GetQuestInfo(4951,'step') > 1) or QuestCompleted(4951) end,
		}, 
		-- Section 4
		{ id = 13, aethid = 2013981, x = 315.229, y = 43.7318, z = -539.307, 
            requires = function () return (HasQuest(4953) and GetQuestInfo(4953,'step') >= 2) or QuestCompleted(4953) end,
        }, 
		-- Section 4
		{ id = 14, aethid = 2013982, x = 169.581, y = 29.2416, z = -308.061, 
            requires = function () return (HasQuest(4953) and GetQuestInfo(4953,'step') >= 2) or QuestCompleted(4953) end,
        }, 
		-- Section 5
		{ id = 15, aethid = 2013983, x = -484.18, y = 38, z = -49.99, 
            requires = function () return (HasQuest(4956) and GetQuestInfo(4956,'step') >= 3) or QuestCompleted(4956) end,
        }, 
	},
}
ffxiv_aetheryte_data = {
	[132] = {
		{id = 132, aethid = 2, x = 30.390216827393, y = 1.8258748054504, z = 26.265508651733},
	},
	[148] = {
		{id = 148, aethid = 3, x = 13.585005760193, y = -1.1827243566513, z = 41.725193023682},
	},
	[152] = {
		{id = 152, aethid = 4, x = -189.0665435791, y = 4.4424576759338, z = 293.23275756836},
	},
	[153] = {
		{id = 153, aethid = 5, x = 181.93789672852, y = 8.6657190322876, z = -66.213958740234},
		{id = 153, aethid = 6, x = -226.1929473877, y = 21.010675430298, z = 355.90420532227},
	},
	[154] = {
		{id = 154, aethid = 7, x = -45.544578552246, y = -39.256271362305, z = 230.90368652344},
	},
	[129] = {
		{id = 129, aethid = 8, x = -85.681526184082, y = 18.800333023071, z = -6.4848699569702},
	},
	[130] = {
		{id = 130, aethid = 9, x = -141.2413, y = -3.154881, z = -166.22462},
	},
	[135] = {
		{id = 135, aethid = 10, x = 156.93988037109, y = 14.09584903717, z = 668.01940917969},
	},
	[137] = {
		{id = 137, aethid = 11, x = 490.56713867188, y = 17.416807174683, z = 474.01110839844},
		{id = 137, aethid = 12, x = -20.159227371216, y = 70.599250793457, z = 7.4133810997009},
	},
	[138] = {
		--{id = 138, aethid = 13, x = 652.9736328125, y = 9.2408666610718, z = 509.41586303711},
		{id = 138, aethid = 14, x = 259.89932250977, y = -22.75, z = 223.38513183594},
	},
	[139] = {
		{id = 139, aethid = 15, x = 433.61944580078, y = 3.6090106964111, z = 92.736114501953},
	},
	[180] = {
		{id = 180, aethid = 16, x = -122.27465820313, y = 64.79615020752, z = -211.87341308594},
	},
	[140] = {
		{id = 140, aethid = 17, x = 71.629104614258, y = 45.432174682617, z = -230.00273132324},
	},
	[145] = {
		{id = 145, aethid = 18, x = -379.7414855957, y = -59, z = 142.57489013672},
	},
	[146] = {
		{id = 146, aethid = 19, x = -165.46360778809, y = 26.138355255127, z = -414.46130371094},
		{id = 146, aethid = 20, x = -321.84567260742, y = 8.2604389190674, z = 406.19985961914},
	},
	[147] = {
		{id = 147, aethid = 21, x = 21.909135818481, y = 6.9785833358765, z = 458.83193969727},
		{id = 147, aethid = 22, x = -24.236480712891, y = 48.309478759766, z = -27.79927444458},
	},
	[155] = {
		{id = 155, aethid = 23, x = 227.28480529785, y = 312, z = -229.6822052002},
	},
	[156] = {
		{id = 156, aethid = 24, x = 48.166370391846, y = 20.295000076294, z = -667.26159667969},
	},
	[134] = {
		{id = 134, aethid = 52, x = 224.27067565918, y = 113.09999084473, z = -261.05822753906},
	},
	[141] = {
		{id = 141, aethid = 53, x = -15.56315612793, y = -1.8785282373428, z = -169.75825500488},
	},
	[418] = {
		{id = 418, aethid = 70, x = -68.819107055664, y = 8.1133041381836, z = 46.482696533203},
	},
	[397] = {
		{id = 397, aethid = 71, x = 477.33963012695, y = 213.68281555176, z = 712.01037597656},
	},
	[401] = {
		{id = 401, aethid = 72, x = -611.17010498047, y = -122.47959899902, z = 545.20111083984},
		{id = 401, aethid = 73, x = -613, y = -49.5, z = -415, 
			requires = function () return QuestCompleted(1643) end,
		},
	},
	[402] = {
		{id = 402, aethid = 74, x = -719.61926269531, y = -186.96055603027, z = -591.29595947266},
	},
	[478] = {
		{id = 478, aethid = 75, x = 70.658157348633, y = 209.25, z = -15.381930351257},
	},
	[398] = {
		{id = 398, aethid = 76, x = 533.27545166016, y = -50.119258880615, z = 35.244457244873},
		{id = 398, aethid = 77, x = -300.9377746582, y = -21.131076812744, z = 30.079961776733},
	},
	[399] = {
		{id = 478, aethid = 75, x = 70.658157348633, y = 209.25, z = -15.381930351257},
	},
	[400] = {
		{id = 400, aethid = 78, x = 256.49853515625, y = -41.158931732178, z = 599.15924072266},
		{id = 400, aethid = 79, x = -583.82263183594, y = 49.774040222168, z = 316.41677856445},
	},
	[144] = {
		{id = 144, aethid = 62, x = 3.3, y = 1.04, z = -2.98},
	},
	[250] = {
		{id = 250, aethid = 55, x = 40.9, y = 5.4, z = -14.9},
	},
	[635] = {
		{id = 635, aethid = 104, x = 77.099, y = 0, z = 92.986},
	},
	[612] = {
		{id = 612, aethid = 98, x = -629.11, y = 132.89, z = -509.15},
		{id = 612, aethid = 99, x = 417.77, y = 114.27, z = 240.70,
			requires = function () return QuestCompleted(2530) end,
		},
	},
	[613] = {
		{id = 613, aethid = 106, x = 90.50, y = 3.03, z = -587.47},
		{id = 613, aethid = 105, x = 365.97, y = -117.95, z = -263.31, 
			requires = function () return QuestCompleted(2482) end,
		},
	},
	[614] = {
		{id = 614, aethid = 107, x = 432.43, y = 68.81, z = -85.83},
		{id = 614, aethid = 108, x = 241.02, y = 5.08, z = -402.3, 
			requires = function () return QuestCompleted(2518) end,
		},
	},
	[620] = {
		{id = 620, aethid = 100, x = 114.58, y = 120.10, z = -747.07},
		{id = 620, aethid = 101, x = -272.97, y = 258.03, z = 746.08,
			requires = function () return QuestCompleted(2534) end,
		},
	},
	[621] = {
		{id = 621, aethid = 102, x = -653.27, y = 50.50, z = -12.33
			, requires = {
					["GetQuestInfo(2548,'step') >= 3 or QuestCompleted(2548)"] = true,
			},
		},
		{id = 621, aethid = 103, x = 616.35, y = 81.39, z = 657.47,
			requires = function () return QuestCompleted(2550) end,
		},
	},
	[622] = {
		{id = 622, aethid = 109, x = 555.07, y = -19.51, z = 346.61, 
			requires = function () return QuestCompleted(2630) end,
		},
		{id = 622, aethid = 110, x = 71.34, y = 114.90, z = 36.01, 
			requires = function () return QuestCompleted(2507) end,
		},
	},
	[628] = {
		{id = 628, aethid = 111, x = 45.89, y = 4.20, z = -40.59},
	},
	[759] = {
		{id = 759, aethid = 127, x = 42.65, y = 1.42, z = -14.88},
	},
	[813] = {
		{id = 813, aethid = 132, x = 753, y = 24, z = -28.8},
		{id = 813, aethid = 136, x = -735, y = 53, z = -230},
	},
	[814] = {
		{id = 814, aethid = 137, x = 668, y = 29, z = 289},
		{id = 814, aethid = 138, x = -244, y = 20, z = 385},
		{id = 814, aethid = 139, x = -431, y = 417, z = -618, 
			requires = function () return QuestCompleted(3634) end,
		},
	},
	
	[815] = {
		{id = 815, aethid = 140, x = 246, y = 13, z = -220},
		{id = 815, aethid = 141, x = -499, y = 45, z = -210, 
			requires = function () return QuestCompleted(3609) end,
		},
		{id = 815, aethid = 161, x = 399, y = -24, z = 307},
	},
	[816] = {
		{id = 816, aethid = 144, x = -355, y = 46, z = 482, 
			requires = function () return QuestCompleted(3305) end,
		},
		{id = 816, aethid = 145, x = -72, y = 103, z = -857, 
			requires = function () return QuestCompleted(3313) end,
		},
		{id = 816, aethid = 146, x = 380, y = 87, z = -687, 
			requires = function () return QuestCompleted(3313) end,
		},
	},
	[817] = {
		{id = 817, aethid = 142, x = -103, y = -19, z = 297},
		{id = 817, aethid = 143, x = 382, y = 21, z = -194, 
			requires = function () return QuestCompleted(3334) end,
		},
	},
	[818] = {
		{id = 818, aethid = 147, x = 561, y = 352, z = -199},
		{id = 818, aethid = 148, x = -141, y = -280, z = 218, 
			requires = function () return QuestCompleted(3652) end,
		},
	},
	[819] = {
		{id = 819, aethid = 133, x = -65, y = 4, z = 0, 
			requires = function () return QuestCompleted(3280) end,
		},
	},
	[820] = {
		{id = 820, aethid = 134, x = 0, y = 82, z = 0, 
			requires = function () return QuestCompleted(3631) end,
		},
	},
	
	-- Endwalker
	[956] = { -- Labyrinthos
		{id = 956, aethid = 166, x = 442.01, y = 169.23, z = -474.60, 
			requires = function () return QuestCompleted(4362) end,
		},
		{id = 956, aethid = 167, x = 7.75, y = -28.72, z = -45.34, 
			requires = function () return QuestCompleted(4441) end,
		},
		{id = 956, aethid = 168, x = -726.13, y = -28.72, z = 302.04, 
			requires = function () return QuestCompleted(4441) end,
		},
	},
	[957] = { -- Thavnair
		{id = 957, aethid = 169, x = 192.39, y = 5.80, z = 625.79, 
			requires = function () return HasQuest(4368) or QuestCompleted(4368) end,
		},
		{id = 957, aethid = 170, x = -523.39, y = 2.59, z = 35.31, 
			requires = function () return HasQuest(4372) or QuestCompleted(4372) end,
		},
		{id = 957, aethid = 171, x = 401.86, y = 3.81, z = -244.29, 
			requires = function () return HasQuest(4412) or QuestCompleted(4412) end,
		},
	},
	[958] = { -- Garlemald
		{id = 958, aethid = 172, x = -408.10, y = 24.16, z = 479.97, 
			requires = function () return GetQuestInfo(4383,'step') >= 3 or QuestCompleted(4383) end,
		},
		{id = 958, aethid = 173, x = 516.57, y = -36.12, z = -179.60, 
			requires = function () return GetQuestInfo(4393,'step') >= 2 or QuestCompleted(4393) end,
        },
	},
	[959] = { -- Mare Lamentorum
		{id = 959, aethid = 174, x = -571.70, y = 132.99, z = 657.40, 
			requires = function () return GetQuestInfo(4396,'step') >= 3 or QuestCompleted(4396) end,
		},
		{id = 959, aethid = 175, x = -0.17, y = -130.88, z = -505.32, 
			requires = function () return QuestCompleted(4400) end,
		},
	},
	[960] = { -- Ultima Thule
		{id = 960, aethid = 179, x = -544.49, y = 71.70, z = 274.77, 
			requires = function () return QuestCompleted(4452) end,
		},
		{id = 960, aethid = 180, x = 64.06, y = 270.26, z = -653.18, 
			requires = function () return QuestCompleted(4457) end,
		},
		{id = 960, aethid = 181, x = 489.22, y = 437.27, z = 336.42, 
			requires = function () return QuestCompleted(4460) end,
		},
	},
	[961] = { -- Elpis
		{id = 961, aethid = 176, x = 161.07, y = 11.38, z = 130.06, 
			requires = function () return HasQuest(4421) or QuestCompleted(4421) end,
		},
		{id = 961, aethid = 177, x = -635.12, y = -20.55, z = 540.59, 
			requires = function () return QuestCompleted(4426) end,
		},
		{id = 961, aethid = 178, x = -529.70, y = 160.61, z = -219.93, 
			requires = function () return HasQuest(4430) or QuestCompleted(4430) end,
		},
	},
	[962] = { -- Old Sharlayan
		{id = 962, aethid = 182, x = 2.42, y = 3.27, z = -1.61, 
			requires = function () return QuestCompleted(4357) end,
		},
	},
	[963] = { -- Radz-at-Han
		{id = 963, aethid = 183, x = 24.85, y = 1.10, z = -24.49, 
			requires = function () return QuestCompleted(4417) end,  -- or 4418
		},
	},
	[1185] = { 
		{id = 1185, aethid = 216, x = -24, y = 0, z = 7.5},
	},
	[1186] = { 
		{id = 1186, aethid = 217, x = 0, y = 9, z = 0},
	},
	[1187] = { 
		{id = 1187, aethid = 200, x = 332, y = -160, z = -416},
		{id = 1187, aethid = 201, x = 465, y = 114, z = 634, 
			requires = function () return (HasQuest(4889) and GetQuestInfo(4889,'step') >= 4) or QuestCompleted(4889) end,
		},
	},
	[1188] = { 
		{id = 1188, aethid = 202, x = -162, y = 6, z = -483},
		{id = 1188, aethid = 203, x = 541, y = 117, z = 203, 
			requires = function () return (HasQuest(4879) and GetQuestInfo(4879,'step') >= 5) or QuestCompleted(4879) end,
		},
		{id = 1188, aethid = 204, x = -477, y = 124, z = 311, 
			requires = function () return (HasQuest(4884) and GetQuestInfo(4884,'step') >= 4) or QuestCompleted(4884) end,
		},
	},
	[1189] = { 
		{id = 1189, aethid = 205, x = -397, y = 23, z = -431},
		{id = 1189, aethid = 206, x = 721, y = -132, z = 526, 
			requires = function () return QuestCompleted(4903) end,
		},
	},
	[1190] = { 
		{id = 1190, aethid = 207, x = 386, y = 0, z = 467},
		{id = 1190, aethid = 208, x = -291, y = 19, z = -114},
		{id = 1190, aethid = 209, x = 311, y = -14, z = -567},
	},
	[1191] = { 
		{id = 1191, aethid = 210, x = 514, y = 145, z = 207},
		{id = 1191, aethid = 211, x = -223, y = 31, z = -584},
		{id = 1191, aethid = 212, x = -219, y = 32, z = 120},
	},
	[1192] = { 
        {id = 1192, aethid = 213, x = -0.23, y = 57.18, z = 796.96},
        {id = 1192, aethid = 214, x = 657.98, y = 28.98, z = -284.02, 
            requires = function () return (HasQuest(4953) and GetQuestInfo(4953,'step') >= 2) or QuestCompleted(4953) end,
        },
        {id = 1192, aethid = 215, x = -247.76, y = 55.38, z = -398.46, 
            requires = function () return (HasQuest(4956) and GetQuestInfo(4956,'step') >= 3) or QuestCompleted(4956) end,
        },
    },
}	

function ffxiv_map_nav.GetAetherytes()
	local list = {}
	
	local data = ffxiv_aetheryte_data
	if (table.valid(data)) then
		for mapid,aetherytes in pairs(data) do
			if (table.valid(aetherytes)) then
				for i,aetheryte in pairs(aetherytes) do
					list[aetheryte.aethid] = true
				end
			end
		end
	end
	
	return list
end

ffxiv_map_nav.list = ffxiv_map_nav.GetAetherytes()

function ffxiv_map_nav.IsAetheryte(id)
	return ffxiv_map_nav.list[id] ~= nil
end

function ffxiv_map_nav.IsAethernet(id)
	return ffxiv_map_nav.list[id] == nil
end

function ffxiv_map_nav.SetupNavNodes()
	ml_nav_manager.nodes = {}
    for id, neighbors in pairs(ffxiv_map_nav.data) do
		local node = ml_node:Create()
		if (ValidTable(node)) then
			node.id = id
			for nid, posTable in pairs(neighbors) do
				node:AddNeighbor(nid, posTable)
			end
			ml_nav_manager.AddNode(node)
		end
	end
end

ffxiv_map_nav.SetupNavNodes()
